<abi-corpus path='test-PR18166-libtirpc.so' soname='libtirpc.so.1'>
  <elf-needed>
    <dependency name='libnsl.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='__libc_clntudp_bufcreate' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_broadenable' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_control' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_createerr' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_dtbsize' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_endconf' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_fd2sockinfo' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_fixup_addr' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_freebroadifs' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_get_a_size' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_get_local_uid' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_get_t_size' type='func-type' binding='global-binding' is-defined='yes'/>

    <elf-symbol name='xdr_union' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdr_vector' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdr_void' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdr_wrapstring' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdrmem_create' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdrrec_create' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdrrec_endofrecord' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdrrec_eof' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdrrec_skiprecord' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xdrstdio_create' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xprt_register' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xprt_unregister' type='func-type' binding='global-binding' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='__rpc_lowvers' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_minfd' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__rpc_rawcombuf' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__svc_maxrec' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='__svc_xports' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='_null_auth' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='authdes_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='authdes_ops_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='authnone_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='authsvc_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='clnt_broadcast_key' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='clnt_fd_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='clntraw_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='disrupt_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dname_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dupreq_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='keyserv_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='libnsl_trace_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='libtirpc_debug_level' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='log_stderr' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='loopnconf_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='nc_db_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='nc_key' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='ops_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='port_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='portnum_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='proglst_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='rce_key' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='rpc_call_key' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='rpc_createerr' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='rpcbaddr_cache_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='rpcsoc_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='serialize_pkey' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='svc_auth_none' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='svc_auth_none_ops' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='svc_fd_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='svc_fdset' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='svc_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='svc_maxfd' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='svcauthdesstats_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='svcraw_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='tcp_key' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='tsd_lock' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='udp_key' type='object-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='xprtlist_lock' type='object-type' binding='global-binding' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/auth_none.c' language='LANG_C89'>
    <class-decl name='__auth' size-in-bits='640' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='184' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ah_cred' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ah_verf' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ah_ops' type-id='type-id-3' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ah_private' type-id='type-id-4' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ah_refcnt' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='206' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='opaque_auth' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='174' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='oa_flavor' type-id='type-id-6' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oa_base' type-id='type-id-7' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='oa_length' type-id='type-id-8' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='177' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <typedef-decl name='int32_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='197' column='1' id='type-id-9'/>
    <typedef-decl name='enum_t' type-id='type-id-9' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='44' column='1' id='type-id-6'/>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-11'/>
    <typedef-decl name='__caddr_t' type-id='type-id-11' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='186' column='1' id='type-id-12'/>
    <typedef-decl name='caddr_t' type-id='type-id-12' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='117' column='1' id='type-id-7'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-13'/>
    <typedef-decl name='__u_int' type-id='type-id-13' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='33' column='1' id='type-id-14'/>
    <typedef-decl name='u_int' type-id='type-id-14' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='36' column='1' id='type-id-8'/>
    <class-decl name='auth_ops' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='188' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ah_nextverf' type-id='type-id-16' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ah_marshal' type-id='type-id-17' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ah_validate' type-id='type-id-18' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ah_refresh' type-id='type-id-19' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ah_destroy' type-id='type-id-16' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ah_wrap' type-id='type-id-20' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ah_unwrap' type-id='type-id-20' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='202' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-21'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-16'/>
    <class-decl name='__rpc_xdr' size-in-bits='384' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='103' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_op' type-id='type-id-25' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_ops' type-id='type-id-26' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_public' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_private' type-id='type-id-4' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_base' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_handy' type-id='type-id-8' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-27'/>
    <enum-decl name='xdr_op' id='type-id-25'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='XDR_ENCODE' value='0'/>
      <enumerator name='XDR_DECODE' value='1'/>
      <enumerator name='XDR_FREE' value='2'/>
    </enum-decl>
    <class-decl name='xdr_ops' size-in-bits='576' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='105' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_getlong' type-id='type-id-29' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_putlong' type-id='type-id-30' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_getbytes' type-id='type-id-31' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_putbytes' type-id='type-id-32' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_getpostn' type-id='type-id-33' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_setpostn' type-id='type-id-34' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x_inline' type-id='type-id-35' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x_destroy' type-id='type-id-36' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x_control' type-id='type-id-37' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bool_t' type-id='type-id-9' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='43' column='1' id='type-id-38'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-39'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-43'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-31'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-26'/>
    <typedef-decl name='XDR' type-id='type-id-24' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='128' column='1' id='type-id-57'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-64'/>
    <typedef-decl name='xdrproc_t' type-id='type-id-64' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='144' column='1' id='type-id-65'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-3'/>
    <typedef-decl name='AUTH' type-id='type-id-1' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='207' column='1' id='type-id-67'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-68'/>
    <function-decl name='authnone_create' mangled-name='authnone_create' filepath='/home/max/src/v6/libtirpc/src/auth_none.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='authnone_create'>
      <return type-id='type-id-68'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='273' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-11' visibility='default' filepath='/usr/include/libio.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-70' visibility='default' filepath='/usr/include/libio.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-71' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-72' visibility='default' filepath='/usr/include/libio.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-73' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-74' visibility='default' filepath='/usr/include/libio.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-75' visibility='default' filepath='/usr/include/libio.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-76' visibility='default' filepath='/usr/include/libio.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-77' visibility='default' filepath='/usr/include/libio.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-78' visibility='default' filepath='/usr/include/libio.h' line='338' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='188' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-70' visibility='default' filepath='/usr/include/libio.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-71' visibility='default' filepath='/usr/include/libio.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-71'/>
    <typedef-decl name='__off_t' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='141' column='1' id='type-id-72'/>
    <type-decl name='short unsigned int' size-in-bits='16' id='type-id-73'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-74'/>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='8' id='type-id-75'>
      <subrange length='1'/>
    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='142' column='1' id='type-id-76'/>
    <type-decl name='long unsigned int' size-in-bits='64' id='type-id-80'/>
    <typedef-decl name='size_t' type-id='type-id-80' filepath='/usr/local/gcc-4.8.2/lib/gcc/x86_64-unknown-linux-gnu/4.8.2/include/stddef.h' line='212' column='1' id='type-id-77'/>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='160' id='type-id-78'>
      <subrange length='20'/>
    </array-type-def>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='_null_auth' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='281' column='1'/>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xdrmem_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_opaque_auth' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-23'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-59'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-42'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-45'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-46'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-49'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-50'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-51'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-53'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-54'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-55'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-61'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-62'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-66'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-63'>
      <parameter type-id='type-id-58'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-38'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/auth_unix.c' language='LANG_C89'>
    <typedef-decl name='__uid_t' type-id='type-id-13' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' id='type-id-81'/>
    <typedef-decl name='uid_t' type-id='type-id-81' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='81' column='1' id='type-id-82'/>
    <typedef-decl name='__gid_t' type-id='type-id-13' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='136' column='1' id='type-id-83'/>
    <typedef-decl name='gid_t' type-id='type-id-83' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='66' column='1' id='type-id-84'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <function-decl name='authunix_create' mangled-name='authunix_create' filepath='/home/max/src/v6/libtirpc/src/auth_unix.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='authunix_create'>
      <parameter type-id='type-id-11' name='machname' filepath='/home/max/src/v6/libtirpc/src/auth_unix.c' line='87' column='1'/>
      <parameter type-id='type-id-82' name='uid' filepath='/home/max/src/v6/libtirpc/src/auth_unix.c' line='88' column='1'/>
      <parameter type-id='type-id-84' name='gid' filepath='/home/max/src/v6/libtirpc/src/auth_unix.c' line='89' column='1'/>
      <parameter type-id='type-id-5' name='len' filepath='/home/max/src/v6/libtirpc/src/auth_unix.c' line='90' column='1'/>
      <parameter type-id='type-id-85' name='aup_gids' filepath='/home/max/src/v6/libtirpc/src/auth_unix.c' line='91' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='authunix_create_default' mangled-name='authunix_create_default' filepath='/home/max/src/v6/libtirpc/src/auth_unix.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='authunix_create_default'>
      <return type-id='type-id-68'/>
    </function-decl>
    <var-decl name='_null_auth' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='281' column='1'/>
    <function-decl name='xdrmem_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_opaque_auth' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='warnx' filepath='/usr/include/err.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <class-decl name='authunix_parms' size-in-bits='320' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth_unix.h' line='59' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aup_time' type-id='type-id-87' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth_unix.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='aup_machname' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth_unix.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aup_uid' type-id='type-id-82' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth_unix.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='aup_gid' type-id='type-id-84' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth_unix.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='aup_len' type-id='type-id-8' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth_unix.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='aup_gids' type-id='type-id-85' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth_unix.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__u_long' type-id='type-id-80' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='34' column='1' id='type-id-88'/>
    <typedef-decl name='u_long' type-id='type-id-88' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='37' column='1' id='type-id-87'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-89'/>
    <function-decl name='xdr_authunix_parms' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth_unix.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <class-decl name='timeval' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/time.h' line='31' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-91' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/time.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='type-id-92' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/time.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='149' column='1' id='type-id-91'/>
    <typedef-decl name='__suseconds_t' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='151' column='1' id='type-id-92'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-93'/>
    <class-decl name='timezone' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='57' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tz_minuteswest' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tz_dsttime' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <function-decl name='gettimeofday' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='rpc_createerr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='448' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cf_stat' type-id='type-id-97' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cf_error' type-id='type-id-98' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='450' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='clnt_stat' id='type-id-97'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='RPC_SUCCESS' value='0'/>
      <enumerator name='RPC_CANTENCODEARGS' value='1'/>
      <enumerator name='RPC_CANTDECODERES' value='2'/>
      <enumerator name='RPC_CANTSEND' value='3'/>
      <enumerator name='RPC_CANTRECV' value='4'/>
      <enumerator name='RPC_TIMEDOUT' value='5'/>
      <enumerator name='RPC_INTR' value='18'/>
      <enumerator name='RPC_UDERROR' value='23'/>
      <enumerator name='RPC_VERSMISMATCH' value='6'/>
      <enumerator name='RPC_AUTHERROR' value='7'/>
      <enumerator name='RPC_PROGUNAVAIL' value='8'/>
      <enumerator name='RPC_PROGVERSMISMATCH' value='9'/>
      <enumerator name='RPC_PROCUNAVAIL' value='10'/>
      <enumerator name='RPC_CANTDECODEARGS' value='11'/>
      <enumerator name='RPC_SYSTEMERROR' value='12'/>
      <enumerator name='RPC_UNKNOWNHOST' value='13'/>
      <enumerator name='RPC_UNKNOWNPROTO' value='17'/>
      <enumerator name='RPC_UNKNOWNADDR' value='19'/>
      <enumerator name='RPC_NOBROADCAST' value='21'/>
      <enumerator name='RPC_RPCBFAILURE' value='14'/>
      <enumerator name='RPC_PROGNOTREGISTERED' value='15'/>
      <enumerator name='RPC_N2AXLATEFAILURE' value='22'/>
      <enumerator name='RPC_TLIERROR' value='20'/>
      <enumerator name='RPC_FAILED' value='16'/>
      <enumerator name='RPC_INPROGRESS' value='24'/>
      <enumerator name='RPC_STALERACHANDLE' value='25'/>
      <enumerator name='RPC_CANTCONNECT' value='26'/>
      <enumerator name='RPC_XPRTFAILED' value='27'/>
      <enumerator name='RPC_CANTCREATESTREAM' value='28'/>
    </enum-decl>
    <class-decl name='rpc_err' size-in-bits='96' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='70' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='re_status' type-id='type-id-97' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-99'/>
    <function-decl name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gethostname' filepath='/usr/include/unistd.h' line='902' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='701' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='getegid' filepath='/usr/include/unistd.h' line='707' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-83'/>
    </function-decl>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-100'/>
    <function-decl name='getgroups' filepath='/usr/include/unistd.h' line='712' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-101'/>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/authunix_prot.c' language='LANG_C89'>
    <function-decl name='xdr_authunix_parms' mangled-name='xdr_authunix_parms' filepath='/home/max/src/v6/libtirpc/src/authunix_prot.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_authunix_parms'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/authunix_prot.c' line='50' column='1'/>
      <parameter type-id='type-id-89' name='p' filepath='/home/max/src/v6/libtirpc/src/authunix_prot.c' line='51' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-102'/>
    <function-decl name='xdr_u_long' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-103'/>
    <function-decl name='xdr_string' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-104'/>
    <function-decl name='xdr_u_int' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_array' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/bindresvport.c' language='LANG_C89'>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='180' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='type-id-106' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='type-id-107' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='183' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_family_t' type-id='type-id-73' filepath='/usr/include/x86_64-linux-gnu/bits/sockaddr.h' line='29' column='1' id='type-id-106'/>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='112' id='type-id-107'>
      <subrange length='14'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-108'/>
    <function-decl name='bindresvport_sa' mangled-name='bindresvport_sa' filepath='/home/max/src/v6/libtirpc/src/bindresvport.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bindresvport_sa'>
      <parameter type-id='type-id-5' name='sd' filepath='/home/max/src/v6/libtirpc/src/bindresvport.c' line='73' column='1'/>
      <parameter type-id='type-id-108' name='sa' filepath='/home/max/src/v6/libtirpc/src/bindresvport.c' line='74' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='sockaddr_in' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='225' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sin_family' type-id='type-id-106' visibility='default' filepath='/usr/include/netinet/in.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sin_port' type-id='type-id-110' visibility='default' filepath='/usr/include/netinet/in.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sin_addr' type-id='type-id-111' visibility='default' filepath='/usr/include/netinet/in.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sin_zero' type-id='type-id-112' visibility='default' filepath='/usr/include/netinet/in.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-73' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-113'/>
    <typedef-decl name='in_port_t' type-id='type-id-113' filepath='/usr/include/netinet/in.h' line='97' column='1' id='type-id-110'/>
    <class-decl name='in_addr' size-in-bits='32' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='142' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_addr' type-id='type-id-114' visibility='default' filepath='/usr/include/netinet/in.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='type-id-13' filepath='/usr/include/stdint.h' line='52' column='1' id='type-id-115'/>
    <typedef-decl name='in_addr_t' type-id='type-id-115' filepath='/usr/include/netinet/in.h' line='141' column='1' id='type-id-114'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-116'/>
    <array-type-def dimensions='1' type-id='type-id-116' size-in-bits='64' id='type-id-112'>
      <subrange length='8'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-117'/>
    <function-decl name='bindresvport' mangled-name='bindresvport' filepath='/usr/include/netinet/in.h' line='492' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bindresvport'>
      <parameter type-id='type-id-5' name='sd' filepath='/home/max/src/v6/libtirpc/src/bindresvport.c' line='58' column='1'/>
      <parameter type-id='type-id-117' name='sin' filepath='/home/max/src/v6/libtirpc/src/bindresvport.c' line='59' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
    <typedef-decl name='__socklen_t' type-id='type-id-13' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='192' column='1' id='type-id-118'/>
    <typedef-decl name='socklen_t' type-id='type-id-118' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='35' column='1' id='type-id-119'/>
    <function-decl name='bind' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <typedef-decl name='__pid_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='143' column='1' id='type-id-120'/>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='629' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-120'/>
    </function-decl>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-121'/>
    <function-decl name='getsockname' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/clnt_bcast.c' language='LANG_C89'>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='112' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-123' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-124' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='broadif' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='106' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='broadaddr' type-id='type-id-126' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='link' type-id='type-id-127' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='193' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-106' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__ss_align' type-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__ss_padding' type-id='type-id-128' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='197' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='896' id='type-id-128'>
      <subrange length='112'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='109' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-123' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-124' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='109' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <typedef-decl name='broadlist_t' type-id='type-id-122' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='112' column='1' id='type-id-129'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <function-decl name='__rpc_getbroadifs' mangled-name='__rpc_getbroadifs' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_getbroadifs'>
      <parameter type-id='type-id-5' name='af' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='121' column='1'/>
      <parameter type-id='type-id-5' name='proto' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='121' column='1'/>
      <parameter type-id='type-id-5' name='socktype' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='121' column='1'/>
      <parameter type-id='type-id-130' name='list' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='121' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_freebroadifs' mangled-name='__rpc_freebroadifs' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_freebroadifs'>
      <parameter type-id='type-id-130' name='list' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='192' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__rpc_broadenable' mangled-name='__rpc_broadenable' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_broadenable'>
      <parameter type-id='type-id-5' name='af' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='207' column='1'/>
      <parameter type-id='type-id-5' name='s' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='207' column='1'/>
      <parameter type-id='type-id-123' name='bip' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='207' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <typedef-decl name='u_int32_t' type-id='type-id-13' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='203' column='1' id='type-id-131'/>
    <typedef-decl name='rpcprog_t' type-id='type-id-131' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='46' column='1' id='type-id-132'/>
    <typedef-decl name='rpcvers_t' type-id='type-id-131' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='47' column='1' id='type-id-133'/>
    <typedef-decl name='rpcproc_t' type-id='type-id-131' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='48' column='1' id='type-id-134'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <typedef-decl name='resultproc_t' type-id='type-id-136' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='523' column='1' id='type-id-137'/>
    <function-decl name='rpc_broadcast_exp' mangled-name='rpc_broadcast_exp' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpc_broadcast_exp'>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='229' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='230' column='1'/>
      <parameter type-id='type-id-134' name='proc' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='231' column='1'/>
      <parameter type-id='type-id-65' name='xargs' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='232' column='1'/>
      <parameter type-id='type-id-7' name='argsp' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='233' column='1'/>
      <parameter type-id='type-id-65' name='xresults' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='234' column='1'/>
      <parameter type-id='type-id-7' name='resultsp' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='235' column='1'/>
      <parameter type-id='type-id-137' name='eachresult' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='236' column='1'/>
      <parameter type-id='type-id-5' name='inittime' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='237' column='1'/>
      <parameter type-id='type-id-5' name='waittime' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='238' column='1'/>
      <parameter type-id='type-id-48' name='nettype' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='239' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='rpc_broadcast' mangled-name='rpc_broadcast' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpc_broadcast'>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='639' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='640' column='1'/>
      <parameter type-id='type-id-134' name='proc' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='641' column='1'/>
      <parameter type-id='type-id-65' name='xargs' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='642' column='1'/>
      <parameter type-id='type-id-7' name='argsp' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='643' column='1'/>
      <parameter type-id='type-id-65' name='xresults' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='644' column='1'/>
      <parameter type-id='type-id-7' name='resultsp' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='645' column='1'/>
      <parameter type-id='type-id-137' name='eachresult' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='646' column='1'/>
      <parameter type-id='type-id-48' name='nettype' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='647' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <var-decl name='stderr' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='171' column='1'/>
    <var-decl name='_null_auth' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='281' column='1'/>
    <class-decl name='__rpc_svcxprt' size-in-bits='1344' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='90' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='xp_fd' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='xp_port' type-id='type-id-139' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='xp_ops' type-id='type-id-140' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xp_addrlen' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='xp_raddr' type-id='type-id-141' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='xp_ops2' type-id='type-id-142' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='xp_tp' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='xp_netid' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='xp_ltaddr' type-id='type-id-143' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='xp_rtaddr' type-id='type-id-143' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='xp_verf' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='xp_auth' type-id='type-id-144' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='xp_p1' type-id='type-id-4' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='xp_p2' type-id='type-id-4' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='xp_p3' type-id='type-id-4' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='xp_type' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='126' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__u_short' type-id='type-id-73' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='32' column='1' id='type-id-145'/>
    <typedef-decl name='u_short' type-id='type-id-145' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='35' column='1' id='type-id-139'/>
    <class-decl name='xp_ops' size-in-bits='384' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='93' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='xp_recv' type-id='type-id-147' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='xp_stat' type-id='type-id-148' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xp_getargs' type-id='type-id-149' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='xp_reply' type-id='type-id-147' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='xp_freeargs' type-id='type-id-149' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='xp_destroy' type-id='type-id-150' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-151'/>
    <class-decl name='rpc_msg' size-in-bits='576' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='151' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_xid' type-id='type-id-131' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_direction' type-id='type-id-153' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='msg_type' id='type-id-153'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='CALL' value='0'/>
      <enumerator name='REPLY' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-147'/>
    <enum-decl name='xprt_stat' id='type-id-156'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='XPRT_DIED' value='0'/>
      <enumerator name='XPRT_MOREREQS' value='1'/>
      <enumerator name='XPRT_IDLE' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-150'/>
    <qualified-type-def type-id='type-id-146' const='yes' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-140'/>
    <class-decl name='sockaddr_in6' size-in-bits='224' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='239' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sin6_family' type-id='type-id-106' visibility='default' filepath='/usr/include/netinet/in.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sin6_port' type-id='type-id-110' visibility='default' filepath='/usr/include/netinet/in.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sin6_flowinfo' type-id='type-id-115' visibility='default' filepath='/usr/include/netinet/in.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sin6_addr' type-id='type-id-161' visibility='default' filepath='/usr/include/netinet/in.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sin6_scope_id' type-id='type-id-115' visibility='default' filepath='/usr/include/netinet/in.h' line='245' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='in6_addr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='198' column='1' id='type-id-161'/>
    <class-decl name='xp_ops2' size-in-bits='64' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='112' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='xp_control' type-id='type-id-163' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-163'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-142'/>
    <class-decl name='netbuf' size-in-bits='128' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='82' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='maxlen' type-id='type-id-13' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='len' type-id='type-id-13' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buf' type-id='type-id-4' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='SVCAUTH' size-in-bits='128' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc_auth.h' line='47' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='svc_ah_ops' type-id='type-id-168' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc_auth.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='svc_ah_private' type-id='type-id-7' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc_auth.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='svc_auth_ops' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc_auth.h' line='48' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='svc_ah_wrap' type-id='type-id-170' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc_auth.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='svc_ah_unwrap' type-id='type-id-170' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc_auth.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='svc_ah_destroy' type-id='type-id-171' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc_auth.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-168'/>
    <typedef-decl name='SVCAUTH' type-id='type-id-167' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc_auth.h' line='56' column='1' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-144'/>
    <typedef-decl name='SVCXPRT' type-id='type-id-138' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='127' column='1' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <var-decl name='__svc_xports' type-id='type-id-178' mangled-name='__svc_xports' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='90' column='1' elf-symbol-id='__svc_xports'/>
    <var-decl name='__svc_maxrec' type-id='type-id-5' mangled-name='__svc_maxrec' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='91' column='1' elf-symbol-id='__svc_maxrec'/>
    <var-decl name='libtirpc_debug_level' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/src/debug.h' line='26' column='1'/>
    <var-decl name='log_stderr' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/src/debug.h' line='27' column='1'/>
    <var-decl name='__rpc_lowvers' type-id='type-id-5' mangled-name='__rpc_lowvers' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_bcast.c' line='118' column='1' elf-symbol-id='__rpc_lowvers'/>
    <class-decl name='ifaddrs' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/ifaddrs.h' line='30' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ifa_next' type-id='type-id-180' visibility='default' filepath='/usr/include/ifaddrs.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ifa_name' type-id='type-id-11' visibility='default' filepath='/usr/include/ifaddrs.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ifa_flags' type-id='type-id-13' visibility='default' filepath='/usr/include/ifaddrs.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ifa_addr' type-id='type-id-108' visibility='default' filepath='/usr/include/ifaddrs.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ifa_netmask' type-id='type-id-108' visibility='default' filepath='/usr/include/ifaddrs.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ifa_data' type-id='type-id-4' visibility='default' filepath='/usr/include/ifaddrs.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <function-decl name='getifaddrs' filepath='/usr/include/ifaddrs.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='addrinfo' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/netdb.h' line='569' column='1' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ai_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/netdb.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ai_family' type-id='type-id-5' visibility='default' filepath='/usr/include/netdb.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ai_socktype' type-id='type-id-5' visibility='default' filepath='/usr/include/netdb.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ai_protocol' type-id='type-id-5' visibility='default' filepath='/usr/include/netdb.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ai_addrlen' type-id='type-id-119' visibility='default' filepath='/usr/include/netdb.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ai_addr' type-id='type-id-108' visibility='default' filepath='/usr/include/netdb.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ai_canonname' type-id='type-id-11' visibility='default' filepath='/usr/include/netdb.h' line='577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ai_next' type-id='type-id-183' visibility='default' filepath='/usr/include/netdb.h' line='578' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-182' const='yes' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-186'/>
    <function-decl name='getaddrinfo' filepath='/usr/include/netdb.h' line='664' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-185'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='if_nametoindex' filepath='/usr/include/net/if.h' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='freeifaddrs' filepath='/usr/include/ifaddrs.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='freeaddrinfo' filepath='/usr/include/netdb.h' line='670' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='inet_pton' filepath='/usr/include/arpa/inet.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='setsockopt' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='netconfig' size-in-bits='1088' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='9' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nc_netid' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nc_semantics' type-id='type-id-80' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nc_flag' type-id='type-id-80' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nc_protofmly' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nc_proto' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nc_device' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nc_nlookups' type-id='type-id-80' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nc_lookups' type-id='type-id-103' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nc_unused' type-id='type-id-188' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-80' size-in-bits='576' id='type-id-188'>
      <subrange length='9'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-189'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <class-decl name='__rpc_sockinfo' size-in-bits='128' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='102' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_af' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_proto' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_socktype' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='si_alen' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <function-decl name='__rpc_nconf2sockinfo' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='socket' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_get_a_size' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__rpc_get_t_size' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='libtirpc_log_dbg' filepath='/home/max/src/v6/libtirpc/src/debug.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-193'/>
    <function-decl name='uaddr2taddr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-193'/>
    </function-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='180' column='1' id='type-id-194'/>
    <typedef-decl name='ssize_t' type-id='type-id-194' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='110' column='1' id='type-id-195'/>
    <function-decl name='recvfrom' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-195'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
    <function-decl name='warnx' filepath='/usr/include/err.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdrmem_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_replymsg' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='sendto' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-195'/>
    </function-decl>
    <class-decl name='pollfd' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='40' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='events' type-id='type-id-197' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='revents' type-id='type-id-197' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-197'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-198'/>
    <typedef-decl name='nfds_t' type-id='type-id-80' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='37' column='1' id='type-id-199'/>
    <function-decl name='poll' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='authunix_create_default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='__rpc_setconf' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/nettype.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-200'/>
    <function-decl name='__rpc_getconf' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/nettype.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='__rpc_endconf' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/nettype.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='gettimeofday' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='629' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='xdr_callmsg' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <class-decl name='rpcb_rmtcallargs' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='218' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prog' type-id='type-id-132' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vers' type-id='type-id-133' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='proc' type-id='type-id-134' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='args' type-id='type-id-202' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='225' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='222' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='args_len' type-id='type-id-8' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='args_val' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='rpcb_rmtcallargs' type-id='type-id-201' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='227' column='1' id='type-id-203'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <function-decl name='xdr_rpcb_rmtcallargs' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-204'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <class-decl name='rmtcallargs' size-in-bits='384' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='46' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prog' type-id='type-id-87' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vers' type-id='type-id-87' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='proc' type-id='type-id-87' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='arglen' type-id='type-id-87' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='args_ptr' type-id='type-id-7' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='xdr_args' type-id='type-id-65' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <function-decl name='xdr_rmtcall_args' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-206'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-7'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-155'>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-157'>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-156'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-158'>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-159'>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-173'>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/clnt_dg.c' language='LANG_C89'>
    <class-decl name='cmsghdr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='280' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmsg_len' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cmsg_level' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cmsg_type' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='288' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <class-decl name='msghdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='253' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='msg_name' type-id='type-id-4' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='msg_namelen' type-id='type-id-119' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='msg_iov' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg_iovlen' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='msg_control' type-id='type-id-4' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='msg_controllen' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='msg_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='267' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/uio.h' line='44' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='type-id-4' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/uio.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/uio.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-212'/>
    <function-decl name='__cmsg_nxthdr' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='317' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-212' name='__mhdr' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='317' column='1'/>
      <parameter type-id='type-id-208' name='__cmsg' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='317' column='1'/>
      <return type-id='type-id-208'/>
    </function-decl>
    <class-decl name='__rpc_client' size-in-bits='320' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='96' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_auth' type-id='type-id-68' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_ops' type-id='type-id-214' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_private' type-id='type-id-4' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_netid' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_tp' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='clnt_ops' size-in-bits='384' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='98' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_call' type-id='type-id-216' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_abort' type-id='type-id-217' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_geterr' type-id='type-id-218' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_freeres' type-id='type-id-219' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_destroy' type-id='type-id-217' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cl_control' type-id='type-id-220' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-219'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-214'/>
    <typedef-decl name='CLIENT' type-id='type-id-213' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='120' column='1' id='type-id-228'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-229'/>
    <qualified-type-def type-id='type-id-143' const='yes' id='type-id-230'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <function-decl name='clnt_dg_create' mangled-name='clnt_dg_create' filepath='/home/max/src/v6/libtirpc/src/clnt_dg.c' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_dg_create'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/clnt_dg.c' line='143' column='1'/>
      <parameter type-id='type-id-231' name='svcaddr' filepath='/home/max/src/v6/libtirpc/src/clnt_dg.c' line='144' column='1'/>
      <parameter type-id='type-id-132' name='program' filepath='/home/max/src/v6/libtirpc/src/clnt_dg.c' line='145' column='1'/>
      <parameter type-id='type-id-133' name='version' filepath='/home/max/src/v6/libtirpc/src/clnt_dg.c' line='146' column='1'/>
      <parameter type-id='type-id-8' name='sendsz' filepath='/home/max/src/v6/libtirpc/src/clnt_dg.c' line='147' column='1'/>
      <parameter type-id='type-id-8' name='recvsz' filepath='/home/max/src/v6/libtirpc/src/clnt_dg.c' line='148' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='_null_auth' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='281' column='1'/>
    <var-decl name='__svc_xports' type-id='type-id-178' mangled-name='__svc_xports' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='90' column='1' elf-symbol-id='__svc_xports'/>
    <var-decl name='__svc_maxrec' type-id='type-id-5' mangled-name='__svc_maxrec' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='91' column='1' elf-symbol-id='__svc_maxrec'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigset.h' line='29' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-233' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigset.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-80' size-in-bits='1024' id='type-id-233'>
      <subrange length='16'/>
    </array-type-def>
    <typedef-decl name='__sigset_t' type-id='type-id-232' filepath='/usr/include/x86_64-linux-gnu/bits/sigset.h' line='32' column='1' id='type-id-234'/>
    <typedef-decl name='sigset_t' type-id='type-id-234' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='38' column='1' id='type-id-235'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <function-decl name='sigfillset' filepath='/usr/include/signal.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-234' const='yes' id='type-id-237'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-239'/>
    <function-decl name='pthread_sigmask' filepath='/usr/include/x86_64-linux-gnu/bits/sigthread.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' filepath='/usr/include/pthread.h' line='973' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' filepath='/usr/include/pthread.h' line='961' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='recvmsg' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-195'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='sendto' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-195'/>
    </function-decl>
    <function-decl name='poll' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
    <function-decl name='recvfrom' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-195'/>
    </function-decl>
    <function-decl name='xdrmem_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_replymsg' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_opaque_auth' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='connect' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_seterr_reply' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_cond_init' filepath='/usr/include/pthread.h' line='952' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_dtbsize' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='setsockopt' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_fd2sockinfo' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_get_t_size' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gettimeofday' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='629' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='xdr_callhdr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='warnx' filepath='/usr/include/err.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/x86_64-linux-gnu/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-80'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='authnone_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-222'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-97'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-223'>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-225'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-226'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-227'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-38'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/clnt_generic.c' language='LANG_C89'>
    <function-decl name='__rpc_raise_fd' mangled-name='__rpc_raise_fd' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_raise_fd'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='412' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <typedef-decl name='uint' type-id='type-id-13' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='153' column='1' id='type-id-240'/>
    <function-decl name='clnt_tli_create' mangled-name='clnt_tli_create' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_tli_create'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='316' column='1'/>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='316' column='1'/>
      <parameter type-id='type-id-193' name='svcaddr' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='317' column='1'/>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='317' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='317' column='1'/>
      <parameter type-id='type-id-240' name='sendsz' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='318' column='1'/>
      <parameter type-id='type-id-240' name='recvsz' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='318' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <qualified-type-def type-id='type-id-90' const='yes' id='type-id-241'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-242'/>
    <function-decl name='clnt_tp_create_timed' mangled-name='clnt_tp_create_timed' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_tp_create_timed'>
      <parameter type-id='type-id-48' name='hostname' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='264' column='1'/>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='264' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='264' column='1'/>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='265' column='1'/>
      <parameter type-id='type-id-242' name='tp' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='265' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clnt_create_timed' mangled-name='clnt_create_timed' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_create_timed'>
      <parameter type-id='type-id-48' name='hostname' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='164' column='1'/>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='164' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='164' column='1'/>
      <parameter type-id='type-id-48' name='netclass' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='165' column='1'/>
      <parameter type-id='type-id-242' name='tp' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='165' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-243'/>
    <function-decl name='clnt_create_vers_timed' mangled-name='clnt_create_vers_timed' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_create_vers_timed'>
      <parameter type-id='type-id-48' name='hostname' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='80' column='1'/>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='80' column='1'/>
      <parameter type-id='type-id-243' name='vers_out' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='81' column='1'/>
      <parameter type-id='type-id-133' name='vers_low' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='81' column='1'/>
      <parameter type-id='type-id-133' name='vers_high' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='81' column='1'/>
      <parameter type-id='type-id-48' name='nettype' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='82' column='1'/>
      <parameter type-id='type-id-242' name='tp' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='82' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clnt_create_vers' mangled-name='clnt_create_vers' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_create_vers'>
      <parameter type-id='type-id-48' name='hostname' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='65' column='1'/>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='65' column='1'/>
      <parameter type-id='type-id-243' name='vers_out' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='65' column='1'/>
      <parameter type-id='type-id-133' name='vers_low' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='66' column='1'/>
      <parameter type-id='type-id-133' name='vers_high' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='66' column='1'/>
      <parameter type-id='type-id-48' name='nettype' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='66' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clnt_create' mangled-name='clnt_create' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_create'>
      <parameter type-id='type-id-48' name='hostname' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='148' column='1'/>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='148' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='148' column='1'/>
      <parameter type-id='type-id-48' name='nettype' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='149' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clnt_tp_create' mangled-name='clnt_tp_create' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_tp_create'>
      <parameter type-id='type-id-48' name='hostname' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='251' column='1'/>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='251' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='251' column='1'/>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='252' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='__svc_xports' type-id='type-id-178' mangled-name='__svc_xports' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='90' column='1' elf-symbol-id='__svc_xports'/>
    <var-decl name='__svc_maxrec' type-id='type-id-5' mangled-name='__svc_maxrec' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='91' column='1' elf-symbol-id='__svc_maxrec'/>
    <var-decl name='__rpc_minfd' type-id='type-id-5' mangled-name='__rpc_minfd' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_generic.c' line='409' column='1' elf-symbol-id='__rpc_minfd'/>
    <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fsync' filepath='/usr/include/unistd.h' line='980' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='syslog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__rpc_fd2sockinfo' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
    <function-decl name='__rpc_nconf2fd' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='bindresvport' filepath='/usr/include/netinet/in.h' line='492' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_socktype2seman' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-244'/>
    <qualified-type-def type-id='type-id-132' const='yes' id='type-id-245'/>
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-246'/>
    <function-decl name='clnt_dg_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='setsockopt' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='clnt_vc_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='__strdup' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1303' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-247'/>
    <function-decl name='__rpcb_findaddr_timed' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-193'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='__rpc_setconf' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/nettype.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__rpc_getconf' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/nettype.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='__rpc_endconf' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/nettype.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/clnt_perror.c' language='LANG_C89'>
    <function-decl name='clnt_sperrno' mangled-name='clnt_sperrno' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_sperrno'>
      <parameter type-id='type-id-97' name='stat' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='218' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='clnt_sperror' mangled-name='clnt_sperror' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_sperror'>
      <parameter type-id='type-id-229' name='rpch' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='67' column='1'/>
      <parameter type-id='type-id-48' name='s' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='68' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='clnt_perror' mangled-name='clnt_perror' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_perror'>
      <parameter type-id='type-id-229' name='rpch' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='181' column='1'/>
      <parameter type-id='type-id-48' name='s' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='182' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='clnt_perrno' mangled-name='clnt_perrno' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_perrno'>
      <parameter type-id='type-id-97' name='num' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='231' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='clnt_spcreateerror' mangled-name='clnt_spcreateerror' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_spcreateerror'>
      <parameter type-id='type-id-48' name='s' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='239' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='clnt_pcreateerror' mangled-name='clnt_pcreateerror' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_pcreateerror'>
      <parameter type-id='type-id-48' name='s' filepath='/home/max/src/v6/libtirpc/src/clnt_perror.c' line='307' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='stderr' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='171' column='1'/>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='387' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <typedef-decl name='FILE' type-id='type-id-69' filepath='/usr/include/stdio.h' line='49' column='1' id='type-id-248'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='__builtin_strncat' mangled-name='strncat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/clnt_raw.c' language='LANG_C89'>
    <function-decl name='clnt_raw_create' mangled-name='clnt_raw_create' filepath='/home/max/src/v6/libtirpc/src/clnt_raw.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_raw_create'>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_raw.c' line='81' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_raw.c' line='82' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='_null_auth' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='281' column='1'/>
    <var-decl name='__rpc_rawcombuf' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/raw.h' line='51' column='1'/>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xdr_replymsg' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='svc_getreq_common' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='_seterr_reply' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_opaque_auth' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdrmem_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_callhdr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='authnone_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='warnx' filepath='/usr/include/err.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/clnt_simple.c' language='LANG_C89'>
    <function-decl name='rpc_call' mangled-name='rpc_call' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpc_call'>
      <parameter type-id='type-id-48' name='host' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='92' column='1'/>
      <parameter type-id='type-id-132' name='prognum' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='93' column='1'/>
      <parameter type-id='type-id-133' name='versnum' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='94' column='1'/>
      <parameter type-id='type-id-134' name='procnum' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='95' column='1'/>
      <parameter type-id='type-id-65' name='inproc' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='96' column='1'/>
      <parameter type-id='type-id-48' name='in' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='97' column='1'/>
      <parameter type-id='type-id-65' name='outproc' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='96' column='1'/>
      <parameter type-id='type-id-11' name='out' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='98' column='1'/>
      <parameter type-id='type-id-48' name='nettype' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='99' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <typedef-decl name='pthread_key_t' type-id='type-id-13' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='140' column='1' id='type-id-250'/>
    <var-decl name='rpc_call_key' type-id='type-id-250' visibility='default' filepath='/home/max/src/v6/libtirpc/src/clnt_simple.c' line='104' column='1'/>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='clnt_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='629' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='__builtin_strcmp' mangled-name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_getspecific' filepath='/usr/include/pthread.h' line='1103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_setspecific' filepath='/usr/include/pthread.h' line='1106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <function-decl name='pthread_key_create' filepath='/usr/include/pthread.h' line='1095' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-252'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/clnt_vc.c' language='LANG_C89'>
    <function-decl name='clnt_vc_create' mangled-name='clnt_vc_create' filepath='/home/max/src/v6/libtirpc/src/clnt_vc.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_vc_create'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/clnt_vc.c' line='165' column='1'/>
      <parameter type-id='type-id-231' name='raddr' filepath='/home/max/src/v6/libtirpc/src/clnt_vc.c' line='166' column='1'/>
      <parameter type-id='type-id-245' name='prog' filepath='/home/max/src/v6/libtirpc/src/clnt_vc.c' line='167' column='1'/>
      <parameter type-id='type-id-246' name='vers' filepath='/home/max/src/v6/libtirpc/src/clnt_vc.c' line='168' column='1'/>
      <parameter type-id='type-id-8' name='sendsz' filepath='/home/max/src/v6/libtirpc/src/clnt_vc.c' line='169' column='1'/>
      <parameter type-id='type-id-8' name='recvsz' filepath='/home/max/src/v6/libtirpc/src/clnt_vc.c' line='170' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='_null_auth' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='281' column='1'/>
    <var-decl name='__svc_xports' type-id='type-id-178' mangled-name='__svc_xports' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='90' column='1' elf-symbol-id='__svc_xports'/>
    <var-decl name='__svc_maxrec' type-id='type-id-5' mangled-name='__svc_maxrec' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='91' column='1' elf-symbol-id='__svc_maxrec'/>
    <function-decl name='sigfillset' filepath='/usr/include/signal.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_sigmask' filepath='/usr/include/x86_64-linux-gnu/bits/sigthread.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' filepath='/usr/include/pthread.h' line='973' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' filepath='/usr/include/pthread.h' line='961' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-195'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-195'/>
    </function-decl>
    <function-decl name='poll' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xdrrec_endofrecord' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdrrec_skiprecord' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_replymsg' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='_seterr_reply' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_opaque_auth' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='pthread_cond_init' filepath='/usr/include/pthread.h' line='952' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_dtbsize' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getpeername' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_fd2sockinfo' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gettimeofday' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='629' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='xdrmem_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_callhdr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='syslog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='connect' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='authnone_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='__rpc_get_t_size' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <function-decl name='xdrrec_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-254'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/rpc_dtablesize.c' language='LANG_C89'>
    <function-decl name='_rpc_dtablesize' mangled-name='_rpc_dtablesize' filepath='/home/max/src/v6/libtirpc/src/rpc_dtablesize.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_rpc_dtablesize'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getdtablesize' filepath='/usr/include/unistd.h' line='1008' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/getnetconfig.c' language='LANG_C89'>
    <function-decl name='__strtok_r_1c' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1174' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11' name='__s' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1174' column='1'/>
      <parameter type-id='type-id-10' name='__sep' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1174' column='1'/>
      <parameter type-id='type-id-103' name='__nextp' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1174' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='__strpbrk_c2' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1124' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48' name='__s' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1124' column='1'/>
      <parameter type-id='type-id-5' name='__accept1' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1124' column='1'/>
      <parameter type-id='type-id-5' name='__accept2' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1124' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='__strpbrk_c3' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1135' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48' name='__s' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1135' column='1'/>
      <parameter type-id='type-id-5' name='__accept1' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1135' column='1'/>
      <parameter type-id='type-id-5' name='__accept2' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1135' column='1'/>
      <parameter type-id='type-id-5' name='__accept3' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1136' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='setnetconfig' mangled-name='setnetconfig' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setnetconfig'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getnetconfig' mangled-name='getnetconfig' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getnetconfig'>
      <parameter type-id='type-id-4' name='handlep' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='223' column='1'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='endnetconfig' mangled-name='endnetconfig' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endnetconfig'>
      <parameter type-id='type-id-4' name='handlep' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='359' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getnetconfigent' mangled-name='getnetconfigent' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getnetconfigent'>
      <parameter type-id='type-id-48' name='netid' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='422' column='1'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='freenetconfigent' mangled-name='freenetconfigent' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='freenetconfigent'>
      <parameter type-id='type-id-200' name='netconfigp' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='526' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='nc_sperror' mangled-name='nc_sperror' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nc_sperror'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='nc_perror' mangled-name='nc_perror' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nc_perror'>
      <parameter type-id='type-id-48' name='s' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='671' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='stderr' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='171' column='1'/>
    <var-decl name='__svc_xports' type-id='type-id-178' mangled-name='__svc_xports' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='90' column='1' elf-symbol-id='__svc_xports'/>
    <var-decl name='__svc_maxrec' type-id='type-id-5' mangled-name='__svc_maxrec' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='91' column='1' elf-symbol-id='__svc_maxrec'/>
    <var-decl name='nc_key' type-id='type-id-250' visibility='default' filepath='/home/max/src/v6/libtirpc/src/getnetconfig.c' line='131' column='1'/>
    <function-decl name='pthread_getspecific' filepath='/usr/include/pthread.h' line='1103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_setspecific' filepath='/usr/include/pthread.h' line='1106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_key_create' filepath='/usr/include/pthread.h' line='1095' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_get_next_token' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='485' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='__strtok_r' filepath='/usr/include/string.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fopen' filepath='/usr/include/stdio.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-249'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__builtin_strcmp' mangled-name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='__rawmemchr' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='sleep' filepath='/usr/include/unistd.h' line='445' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/getnetpath.c' language='LANG_C89'>
    <function-decl name='setnetpath' mangled-name='setnetpath' filepath='/home/max/src/v6/libtirpc/src/getnetpath.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setnetpath'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='endnetpath' mangled-name='endnetpath' filepath='/home/max/src/v6/libtirpc/src/getnetpath.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endnetpath'>
      <parameter type-id='type-id-4' name='handlep' filepath='/home/max/src/v6/libtirpc/src/getnetpath.c' line='190' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_get_next_token' mangled-name='_get_next_token' filepath='/home/max/src/v6/libtirpc/src/getnetpath.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_get_next_token'>
      <parameter type-id='type-id-11' name='npp' filepath='/home/max/src/v6/libtirpc/src/getnetpath.c' line='227' column='1'/>
      <parameter type-id='type-id-5' name='token' filepath='/home/max/src/v6/libtirpc/src/getnetpath.c' line='228' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getnetpath' mangled-name='getnetpath' filepath='/home/max/src/v6/libtirpc/src/getnetpath.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getnetpath'>
      <parameter type-id='type-id-4' name='handlep' filepath='/home/max/src/v6/libtirpc/src/getnetpath.c' line='134' column='1'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='setnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='567' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='endnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='syslog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='freenetconfigent' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
    <function-decl name='__builtin_strchr' mangled-name='strchr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getnetconfigent' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='getnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-200'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/getrpcent.c' language='LANG_C89'>
    <function-decl name='__strpbrk_c2' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1124' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48' name='__s' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1124' column='1'/>
      <parameter type-id='type-id-5' name='__accept1' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1124' column='1'/>
      <parameter type-id='type-id-5' name='__accept2' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1124' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='__strpbrk_c3' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1135' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48' name='__s' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1135' column='1'/>
      <parameter type-id='type-id-5' name='__accept1' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1135' column='1'/>
      <parameter type-id='type-id-5' name='__accept2' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1135' column='1'/>
      <parameter type-id='type-id-5' name='__accept3' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1136' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='284' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48' name='__nptr' filepath='/usr/include/stdlib.h' line='284' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='setrpcent' mangled-name='setrpcent' filepath='/usr/include/rpc/netdb.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setrpcent'>
      <parameter type-id='type-id-5' name='f' filepath='/home/max/src/v6/libtirpc/src/getrpcent.c' line='165' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='endrpcent' mangled-name='endrpcent' filepath='/usr/include/rpc/netdb.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endrpcent'>
      <return type-id='type-id-21'/>
    </function-decl>
    <class-decl name='rpcent' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/rpc/netdb.h' line='46' column='1' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r_name' type-id='type-id-11' visibility='default' filepath='/usr/include/rpc/netdb.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='r_aliases' type-id='type-id-103' visibility='default' filepath='/usr/include/rpc/netdb.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='r_number' type-id='type-id-5' visibility='default' filepath='/usr/include/rpc/netdb.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <function-decl name='getrpcent' mangled-name='getrpcent' filepath='/usr/include/rpc/netdb.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrpcent'>
      <return type-id='type-id-257'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rewind' filepath='/usr/include/stdio.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fopen' filepath='/usr/include/stdio.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-249'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-77'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/getrpcport.c' language='LANG_C89'>
    <function-decl name='getrpcport' mangled-name='getrpcport' filepath='/home/max/src/v6/libtirpc/src/getrpcport.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrpcport'>
      <parameter type-id='type-id-11' name='host' filepath='/home/max/src/v6/libtirpc/src/getrpcport.c' line='47' column='1'/>
      <parameter type-id='type-id-5' name='prognum' filepath='/home/max/src/v6/libtirpc/src/getrpcport.c' line='48' column='1'/>
      <parameter type-id='type-id-5' name='versnum' filepath='/home/max/src/v6/libtirpc/src/getrpcport.c' line='48' column='1'/>
      <parameter type-id='type-id-5' name='proto' filepath='/home/max/src/v6/libtirpc/src/getrpcport.c' line='48' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <class-decl name='hostent' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/netdb.h' line='101' column='1' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h_name' type-id='type-id-11' visibility='default' filepath='/usr/include/netdb.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='h_aliases' type-id='type-id-103' visibility='default' filepath='/usr/include/netdb.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='h_addrtype' type-id='type-id-5' visibility='default' filepath='/usr/include/netdb.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='h_length' type-id='type-id-5' visibility='default' filepath='/usr/include/netdb.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='h_addr_list' type-id='type-id-103' visibility='default' filepath='/usr/include/netdb.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <function-decl name='gethostbyname' filepath='/usr/include/netdb.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <function-decl name='pmap_getport' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_clnt.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-139'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/mt_misc.c' language='LANG_C89'>
    <function-decl name='__rpc_createerr' mangled-name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_createerr'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='tsd_key_delete' mangled-name='tsd_key_delete' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tsd_key_delete'>
      <return type-id='type-id-21'/>
    </function-decl>
    <var-decl name='clnt_broadcast_key' type-id='type-id-250' mangled-name='clnt_broadcast_key' visibility='default' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='81' column='1' elf-symbol-id='clnt_broadcast_key'/>
    <var-decl name='rpc_call_key' type-id='type-id-250' mangled-name='rpc_call_key' visibility='default' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='82' column='1' elf-symbol-id='rpc_call_key'/>
    <var-decl name='tcp_key' type-id='type-id-250' mangled-name='tcp_key' visibility='default' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='83' column='1' elf-symbol-id='tcp_key'/>
    <var-decl name='udp_key' type-id='type-id-250' mangled-name='udp_key' visibility='default' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='84' column='1' elf-symbol-id='udp_key'/>
    <var-decl name='nc_key' type-id='type-id-250' mangled-name='nc_key' visibility='default' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='85' column='1' elf-symbol-id='nc_key'/>
    <var-decl name='rce_key' type-id='type-id-250' mangled-name='rce_key' visibility='default' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='86' column='1' elf-symbol-id='rce_key'/>
    <var-decl name='rpc_createerr' type-id='type-id-96' mangled-name='rpc_createerr' visibility='default' filepath='/home/max/src/v6/libtirpc/src/mt_misc.c' line='105' column='1' elf-symbol-id='rpc_createerr'/>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_getspecific' filepath='/usr/include/pthread.h' line='1103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_key_create' filepath='/usr/include/pthread.h' line='1095' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_setspecific' filepath='/usr/include/pthread.h' line='1106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_key_delete' filepath='/usr/include/pthread.h' line='1100' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/pmap_clnt.c' language='LANG_C89'>
    <function-decl name='pmap_set' mangled-name='pmap_set' filepath='/home/max/src/v6/libtirpc/src/pmap_clnt.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pmap_set'>
      <parameter type-id='type-id-87' name='program' filepath='/home/max/src/v6/libtirpc/src/pmap_clnt.c' line='54' column='1'/>
      <parameter type-id='type-id-87' name='version' filepath='/home/max/src/v6/libtirpc/src/pmap_clnt.c' line='54' column='1'/>
      <parameter type-id='type-id-5' name='protocol' filepath='/home/max/src/v6/libtirpc/src/pmap_clnt.c' line='54' column='1'/>
      <parameter type-id='type-id-5' name='port' filepath='/home/max/src/v6/libtirpc/src/pmap_clnt.c' line='54' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='pmap_unset' mangled-name='pmap_unset' filepath='/home/max/src/v6/libtirpc/src/pmap_clnt.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pmap_unset'>
      <parameter type-id='type-id-87' name='program' filepath='/home/max/src/v6/libtirpc/src/pmap_clnt.c' line='86' column='1'/>
      <parameter type-id='type-id-87' name='version' filepath='/home/max/src/v6/libtirpc/src/pmap_clnt.c' line='86' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <var-decl name='__svc_xports' type-id='type-id-178' mangled-name='__svc_xports' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='90' column='1' elf-symbol-id='__svc_xports'/>
    <var-decl name='__svc_maxrec' type-id='type-id-5' mangled-name='__svc_maxrec' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='91' column='1' elf-symbol-id='__svc_maxrec'/>
    <function-decl name='__rpc_getconfip' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/nettype.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='387' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uaddr2taddr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-193'/>
    </function-decl>
    <function-decl name='rpcb_set' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_clnt.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='freenetconfigent' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rpcb_unset' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_clnt.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-38'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/pmap_getmaps.c' language='LANG_C89'>
    <class-decl name='pmaplist' size-in-bits='320' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_prot.h' line='95' column='1' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pml_map' type-id='type-id-261' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_prot.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pml_next' type-id='type-id-262' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_prot.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pmap' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_prot.h' line='88' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pm_prog' type-id='type-id-80' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_prot.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pm_vers' type-id='type-id-80' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_prot.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pm_prot' type-id='type-id-80' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_prot.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pm_port' type-id='type-id-80' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_prot.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-262'/>
    <function-decl name='pmap_getmaps' mangled-name='pmap_getmaps' filepath='/home/max/src/v6/libtirpc/src/pmap_getmaps.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pmap_getmaps'>
      <parameter type-id='type-id-117' name='address' filepath='/home/max/src/v6/libtirpc/src/pmap_getmaps.c' line='65' column='1'/>
      <return type-id='type-id-262'/>
    </function-decl>
    <function-decl name='clnttcp_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt_soc.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clnt_perror' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-229'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/pmap_getport.c' language='LANG_C89'>
    <function-decl name='pmap_getport' mangled-name='pmap_getport' filepath='/home/max/src/v6/libtirpc/src/pmap_getport.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pmap_getport'>
      <parameter type-id='type-id-117' name='address' filepath='/home/max/src/v6/libtirpc/src/pmap_getport.c' line='58' column='1'/>
      <parameter type-id='type-id-87' name='program' filepath='/home/max/src/v6/libtirpc/src/pmap_getport.c' line='59' column='1'/>
      <parameter type-id='type-id-87' name='version' filepath='/home/max/src/v6/libtirpc/src/pmap_getport.c' line='60' column='1'/>
      <parameter type-id='type-id-8' name='protocol' filepath='/home/max/src/v6/libtirpc/src/pmap_getport.c' line='61' column='1'/>
      <return type-id='type-id-139'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <function-decl name='clntudp_bufcreate' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt_soc.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/pmap_prot.c' language='LANG_C89'>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-263'/>
    <function-decl name='xdr_pmap' mangled-name='xdr_pmap' filepath='/home/max/src/v6/libtirpc/src/pmap_prot.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_pmap'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/pmap_prot.c' line='45' column='1'/>
      <parameter type-id='type-id-263' name='regs' filepath='/home/max/src/v6/libtirpc/src/pmap_prot.c' line='46' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <function-decl name='xdr_u_long' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/pmap_prot2.c' language='LANG_C89'>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-264'/>
    <function-decl name='xdr_pmaplist' mangled-name='xdr_pmaplist' filepath='/home/max/src/v6/libtirpc/src/pmap_prot2.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_pmaplist'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/pmap_prot2.c' line='83' column='1'/>
      <parameter type-id='type-id-264' name='rp' filepath='/home/max/src/v6/libtirpc/src/pmap_prot2.c' line='84' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_pmaplist_ptr' mangled-name='xdr_pmaplist_ptr' filepath='/home/max/src/v6/libtirpc/src/pmap_prot2.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_pmaplist_ptr'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/pmap_prot2.c' line='127' column='1'/>
      <parameter type-id='type-id-262' name='rp' filepath='/home/max/src/v6/libtirpc/src/pmap_prot2.c' line='128' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-265'/>
    <function-decl name='xdr_bool' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_reference' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/pmap_rmt.c' language='LANG_C89'>
    <function-decl name='xdr_rmtcall_args' mangled-name='xdr_rmtcall_args' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_rmtcall_args'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='119' column='1'/>
      <parameter type-id='type-id-206' name='cap' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='120' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <class-decl name='rmtcallres' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='52' column='1' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port_ptr' type-id='type-id-102' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resultslen' type-id='type-id-87' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='results_ptr' type-id='type-id-7' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='xdr_results' type-id='type-id-65' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_rmt.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-267'/>
    <function-decl name='xdr_rmtcallres' mangled-name='xdr_rmtcallres' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_rmtcallres'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='153' column='1'/>
      <parameter type-id='type-id-267' name='crp' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='154' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='pmap_rmtcall' mangled-name='pmap_rmtcall' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pmap_rmtcall'>
      <parameter type-id='type-id-117' name='addr' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='74' column='1'/>
      <parameter type-id='type-id-87' name='prog' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='75' column='1'/>
      <parameter type-id='type-id-87' name='vers' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='75' column='1'/>
      <parameter type-id='type-id-87' name='proc' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='75' column='1'/>
      <parameter type-id='type-id-65' name='xdrargs' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='76' column='1'/>
      <parameter type-id='type-id-7' name='argsp' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='77' column='1'/>
      <parameter type-id='type-id-65' name='xdrres' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='76' column='1'/>
      <parameter type-id='type-id-7' name='resp' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='77' column='1'/>
      <parameter type-id='type-id-90' name='tout' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='78' column='1'/>
      <parameter type-id='type-id-102' name='port_ptr' filepath='/home/max/src/v6/libtirpc/src/pmap_rmt.c' line='79' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <function-decl name='xdr_u_long' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='xdr_reference' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='clntudp_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt_soc.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-101'/>
      <return type-id='type-id-229'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/rpc_prot.c' language='LANG_C89'>
    <class-decl name='rejected_reply' size-in-bits='96' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='110' column='1' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rj_stat' type-id='type-id-269' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='reject_stat' id='type-id-269'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='RPC_MISMATCH' value='0'/>
      <enumerator name='AUTH_ERROR' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-270'/>
    <function-decl name='xdr_rejected_reply' mangled-name='xdr_rejected_reply' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_rejected_reply'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='132' column='1'/>
      <parameter type-id='type-id-270' name='rr' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='133' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <class-decl name='accepted_reply' size-in-bits='384' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='89' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ar_verf' type-id='type-id-2' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ar_stat' type-id='type-id-272' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc_msg.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='accept_stat' id='type-id-272'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='SUCCESS' value='0'/>
      <enumerator name='PROG_UNAVAIL' value='1'/>
      <enumerator name='PROG_MISMATCH' value='2'/>
      <enumerator name='PROC_UNAVAIL' value='3'/>
      <enumerator name='GARBAGE_ARGS' value='4'/>
      <enumerator name='SYSTEM_ERR' value='5'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-273'/>
    <function-decl name='xdr_accepted_reply' mangled-name='xdr_accepted_reply' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_accepted_reply'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='96' column='1'/>
      <parameter type-id='type-id-273' name='ar' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='97' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_opaque_auth' mangled-name='xdr_opaque_auth' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_opaque_auth'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='61' column='1'/>
      <parameter type-id='type-id-60' name='ap' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='62' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_des_block' mangled-name='xdr_des_block' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_des_block'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='79' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_replymsg' mangled-name='xdr_replymsg' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_replymsg'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='166' column='1'/>
      <parameter type-id='type-id-154' name='rmsg' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='167' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_callhdr' mangled-name='xdr_callhdr' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_callhdr'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='190' column='1'/>
      <parameter type-id='type-id-154' name='cmsg' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='191' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='_seterr_reply' mangled-name='_seterr_reply' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_seterr_reply'>
      <parameter type-id='type-id-154' name='msg' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='281' column='1'/>
      <parameter type-id='type-id-224' name='error' filepath='/home/max/src/v6/libtirpc/src/rpc_prot.c' line='282' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-274'/>
    <function-decl name='xdr_enum' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-275'/>
    <function-decl name='xdr_u_int32_t' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_bytes' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_opaque' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <class-decl name='xdr_discrim' size-in-bits='128' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='247' column='1' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-5' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='proc' type-id='type-id-65' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='249' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-277'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <function-decl name='xdr_union' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-38'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/rpc_commondata.c' language='LANG_C89'>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='_null_auth' type-id='type-id-2' mangled-name='_null_auth' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_commondata.c' line='36' column='1' elf-symbol-id='_null_auth'/>
    <var-decl name='svc_maxfd' type-id='type-id-5' mangled-name='svc_maxfd' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_commondata.c' line='38' column='1' elf-symbol-id='svc_maxfd'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='65' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fds_bits' type-id='type-id-280' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fd_mask' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='55' column='1' id='type-id-281'/>
    <array-type-def dimensions='1' type-id='type-id-281' size-in-bits='1024' id='type-id-280'>
      <subrange length='16'/>
    </array-type-def>
    <typedef-decl name='fd_set' type-id='type-id-279' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='76' column='1' id='type-id-282'/>
    <var-decl name='svc_fdset' type-id='type-id-282' mangled-name='svc_fdset' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_commondata.c' line='37' column='1' elf-symbol-id='svc_fdset'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/rpc_callmsg.c' language='LANG_C89'>
    <function-decl name='xdr_callmsg' mangled-name='xdr_callmsg' filepath='/home/max/src/v6/libtirpc/src/rpc_callmsg.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xdr_callmsg'>
      <parameter type-id='type-id-58' name='xdrs' filepath='/home/max/src/v6/libtirpc/src/rpc_callmsg.c' line='50' column='1'/>
      <parameter type-id='type-id-154' name='cmsg' filepath='/home/max/src/v6/libtirpc/src/rpc_callmsg.c' line='51' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <function-decl name='xdr_u_int32_t' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_enum' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='xdr_opaque_auth' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='memmove' filepath='/usr/include/string.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='xdr_opaque' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='xdr_u_int' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/xdr.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='__assert_fail' filepath='/usr/include/assert.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/rpc_generic.c' language='LANG_C89'>
    <function-decl name='__rpc_nconf2sockinfo' mangled-name='__rpc_nconf2sockinfo' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='504' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_nconf2sockinfo'>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='504' column='1'/>
      <parameter type-id='type-id-192' name='sip' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='504' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_dtbsize' mangled-name='__rpc_dtbsize' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_dtbsize'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_get_t_size' mangled-name='__rpc_get_t_size' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_get_t_size'>
      <parameter type-id='type-id-5' name='af' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='132' column='1'/>
      <parameter type-id='type-id-5' name='proto' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='132' column='1'/>
      <parameter type-id='type-id-5' name='size' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='133' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__rpc_get_a_size' mangled-name='__rpc_get_a_size' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_get_a_size'>
      <parameter type-id='type-id-5' name='af' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='161' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__rpc_getconfip' mangled-name='__rpc_getconfip' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_getconfip'>
      <parameter type-id='type-id-48' name='nettype' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='222' column='1'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='__rpc_setconf' mangled-name='__rpc_setconf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_setconf'>
      <parameter type-id='type-id-48' name='nettype' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='292' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__rpc_getconf' mangled-name='__rpc_getconf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_getconf'>
      <parameter type-id='type-id-4' name='vhandle' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='335' column='1'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='__rpc_endconf' mangled-name='__rpc_endconf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_endconf'>
      <parameter type-id='type-id-4' name='vhandle' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='412' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rpc_nullproc' mangled-name='rpc_nullproc' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpc_nullproc'>
      <parameter type-id='type-id-229' name='clnt' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='434' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__rpc_fd2sockinfo' mangled-name='__rpc_fd2sockinfo' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_fd2sockinfo'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='467' column='1'/>
      <parameter type-id='type-id-192' name='sip' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='467' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-283'/>
    <function-decl name='__rpc_sockinfo2netid' mangled-name='__rpc_sockinfo2netid' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='552' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_sockinfo2netid'>
      <parameter type-id='type-id-192' name='sip' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='552' column='1'/>
      <parameter type-id='type-id-283' name='netid' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='552' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpcgettp' mangled-name='__rpcgettp' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpcgettp'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='451' column='1'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='__rpc_taddr2uaddr_af' mangled-name='__rpc_taddr2uaddr_af' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_taddr2uaddr_af'>
      <parameter type-id='type-id-5' name='af' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='601' column='1'/>
      <parameter type-id='type-id-231' name='nbuf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='601' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='__rpc_uaddr2taddr_af' mangled-name='__rpc_uaddr2taddr_af' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_uaddr2taddr_af'>
      <parameter type-id='type-id-5' name='af' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='658' column='1'/>
      <parameter type-id='type-id-48' name='uaddr' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='658' column='1'/>
      <return type-id='type-id-193'/>
    </function-decl>
    <function-decl name='__rpc_seman2socktype' mangled-name='__rpc_seman2socktype' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_seman2socktype'>
      <parameter type-id='type-id-5' name='semantics' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='753' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_nconf2fd_flags' mangled-name='__rpc_nconf2fd_flags' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_nconf2fd_flags'>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='526' column='1'/>
      <parameter type-id='type-id-5' name='flags' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='526' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_nconf2fd' mangled-name='__rpc_nconf2fd' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_nconf2fd'>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='546' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='taddr2uaddr' mangled-name='taddr2uaddr' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='taddr2uaddr'>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='581' column='1'/>
      <parameter type-id='type-id-231' name='nbuf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='581' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uaddr2taddr' mangled-name='uaddr2taddr' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uaddr2taddr'>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='591' column='1'/>
      <parameter type-id='type-id-48' name='uaddr' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='591' column='1'/>
      <return type-id='type-id-193'/>
    </function-decl>
    <function-decl name='__rpc_socktype2seman' mangled-name='__rpc_socktype2seman' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_socktype2seman'>
      <parameter type-id='type-id-5' name='socktype' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='770' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_fixup_addr' mangled-name='__rpc_fixup_addr' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_fixup_addr'>
      <parameter type-id='type-id-193' name='new' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='794' column='1'/>
      <parameter type-id='type-id-231' name='svc' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='794' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_sockisbound' mangled-name='__rpc_sockisbound' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_sockisbound'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='820' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_set_netbuf' mangled-name='__rpc_set_netbuf' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_set_netbuf'>
      <parameter type-id='type-id-193' name='nb' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='858' column='1'/>
      <parameter type-id='type-id-77' name='len' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='858' column='1'/>
      <return type-id='type-id-193'/>
    </function-decl>
    <var-decl name='__svc_xports' type-id='type-id-178' mangled-name='__svc_xports' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='90' column='1' elf-symbol-id='__svc_xports'/>
    <var-decl name='__svc_maxrec' type-id='type-id-5' mangled-name='__svc_maxrec' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='91' column='1' elf-symbol-id='__svc_maxrec'/>
    <var-decl name='tcp_key' type-id='type-id-250' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='228' column='1'/>
    <var-decl name='udp_key' type-id='type-id-250' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_generic.c' line='228' column='1'/>
    <enum-decl name='__rlimit_resource' id='type-id-284'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='RLIMIT_CPU' value='0'/>
      <enumerator name='RLIMIT_FSIZE' value='1'/>
      <enumerator name='RLIMIT_DATA' value='2'/>
      <enumerator name='RLIMIT_STACK' value='3'/>
      <enumerator name='RLIMIT_CORE' value='4'/>
      <enumerator name='__RLIMIT_RSS' value='5'/>
      <enumerator name='RLIMIT_NOFILE' value='7'/>
      <enumerator name='__RLIMIT_OFILE' value='7'/>
      <enumerator name='RLIMIT_AS' value='9'/>
      <enumerator name='__RLIMIT_NPROC' value='6'/>
      <enumerator name='__RLIMIT_MEMLOCK' value='8'/>
      <enumerator name='__RLIMIT_LOCKS' value='10'/>
      <enumerator name='__RLIMIT_SIGPENDING' value='11'/>
      <enumerator name='__RLIMIT_MSGQUEUE' value='12'/>
      <enumerator name='__RLIMIT_NICE' value='13'/>
      <enumerator name='__RLIMIT_RTPRIO' value='14'/>
      <enumerator name='__RLIMIT_RTTIME' value='15'/>
      <enumerator name='__RLIMIT_NLIMITS' value='16'/>
      <enumerator name='__RLIM_NLIMITS' value='16'/>
    </enum-decl>
    <typedef-decl name='__rlimit_resource_t' type-id='type-id-284' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='39' column='1' id='type-id-285'/>
    <class-decl name='rlimit' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='141' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rlim_cur' type-id='type-id-287' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rlim_max' type-id='type-id-287' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__rlim_t' type-id='type-id-80' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='146' column='1' id='type-id-288'/>
    <typedef-decl name='rlim_t' type-id='type-id-288' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='133' column='1' id='type-id-287'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-289'/>
    <function-decl name='getrlimit' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-289'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='setnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='__strdup' filepath='/usr/include/x86_64-linux-gnu/bits/string2.h' line='1303' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_setspecific' filepath='/usr/include/pthread.h' line='1106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='endnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='syslog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_getspecific' filepath='/usr/include/pthread.h' line='1103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getnetconfigent' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_key_create' filepath='/usr/include/pthread.h' line='1095' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strcasecmp' filepath='/usr/include/string.h' line='536' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='setnetpath' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='getnetpath' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='endnetpath' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getsockname' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getsockopt' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='freenetconfigent' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='inet_ntop' filepath='/usr/include/arpa/inet.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='inet_pton' filepath='/usr/include/arpa/inet.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='__builtin_strcmp' mangled-name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='setsockopt' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='socket' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/rpc_soc.c' language='LANG_C89'>
    <function-decl name='__libc_clntudp_bufcreate' mangled-name='__libc_clntudp_bufcreate' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_clntudp_bufcreate'>
      <parameter type-id='type-id-117' name='raddr' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='177' column='1'/>
      <parameter type-id='type-id-87' name='prog' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='178' column='1'/>
      <parameter type-id='type-id-87' name='vers' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='179' column='1'/>
      <parameter type-id='type-id-90' name='wait' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='180' column='1'/>
      <parameter type-id='type-id-101' name='sockp' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='181' column='1'/>
      <parameter type-id='type-id-8' name='sendsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='182' column='1'/>
      <parameter type-id='type-id-8' name='recvsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='183' column='1'/>
      <parameter type-id='type-id-5' name='flags' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='184' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clntudp_bufcreate' mangled-name='clntudp_bufcreate' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clntudp_bufcreate'>
      <parameter type-id='type-id-117' name='raddr' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='199' column='1'/>
      <parameter type-id='type-id-87' name='prog' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='200' column='1'/>
      <parameter type-id='type-id-87' name='vers' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='201' column='1'/>
      <parameter type-id='type-id-90' name='wait' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='202' column='1'/>
      <parameter type-id='type-id-101' name='sockp' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='203' column='1'/>
      <parameter type-id='type-id-8' name='sendsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='204' column='1'/>
      <parameter type-id='type-id-8' name='recvsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='205' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clntudp_create' mangled-name='clntudp_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clntudp_create'>
      <parameter type-id='type-id-117' name='raddr' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='220' column='1'/>
      <parameter type-id='type-id-87' name='program' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='221' column='1'/>
      <parameter type-id='type-id-87' name='version' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='222' column='1'/>
      <parameter type-id='type-id-90' name='wait' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='223' column='1'/>
      <parameter type-id='type-id-101' name='sockp' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='224' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clnttcp_create' mangled-name='clnttcp_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnttcp_create'>
      <parameter type-id='type-id-117' name='raddr' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='231' column='1'/>
      <parameter type-id='type-id-87' name='prog' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='232' column='1'/>
      <parameter type-id='type-id-87' name='vers' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='233' column='1'/>
      <parameter type-id='type-id-101' name='sockp' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='234' column='1'/>
      <parameter type-id='type-id-8' name='sendsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='235' column='1'/>
      <parameter type-id='type-id-8' name='recvsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='236' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='clntraw_create' mangled-name='clntraw_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clntraw_create'>
      <parameter type-id='type-id-87' name='prog' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='295' column='1'/>
      <parameter type-id='type-id-87' name='vers' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='296' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='svctcp_create' mangled-name='svctcp_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='svctcp_create'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='350' column='1'/>
      <parameter type-id='type-id-8' name='sendsize' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='351' column='1'/>
      <parameter type-id='type-id-8' name='recvsize' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='352' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='svcudp_bufcreate' mangled-name='svcudp_bufcreate' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='svcudp_bufcreate'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='362' column='1'/>
      <parameter type-id='type-id-8' name='sendsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='363' column='1'/>
      <parameter type-id='type-id-8' name='recvsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='363' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='svcfd_create' mangled-name='svcfd_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='svcfd_create'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='373' column='1'/>
      <parameter type-id='type-id-8' name='sendsize' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='374' column='1'/>
      <parameter type-id='type-id-8' name='recvsize' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='375' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='svcudp_create' mangled-name='svcudp_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='svcudp_create'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='384' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='svcraw_create' mangled-name='svcraw_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='svcraw_create'>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='get_myaddress' mangled-name='get_myaddress' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_myaddress'>
      <parameter type-id='type-id-117' name='addr' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='430' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='callrpc' mangled-name='callrpc' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='callrpc'>
      <parameter type-id='type-id-48' name='host' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='445' column='1'/>
      <parameter type-id='type-id-5' name='prognum' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='446' column='1'/>
      <parameter type-id='type-id-5' name='versnum' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='446' column='1'/>
      <parameter type-id='type-id-5' name='procnum' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='446' column='1'/>
      <parameter type-id='type-id-65' name='inproc' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='447' column='1'/>
      <parameter type-id='type-id-4' name='in' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='448' column='1'/>
      <parameter type-id='type-id-65' name='outproc' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='447' column='1'/>
      <parameter type-id='type-id-4' name='out' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='448' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-291'/>
    <function-decl name='registerrpc' mangled-name='registerrpc' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='registerrpc'>
      <parameter type-id='type-id-5' name='prognum' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='460' column='1'/>
      <parameter type-id='type-id-5' name='versnum' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='460' column='1'/>
      <parameter type-id='type-id-5' name='procnum' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='460' column='1'/>
      <parameter type-id='type-id-291' name='progname' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='461' column='1'/>
      <parameter type-id='type-id-65' name='inproc' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='462' column='1'/>
      <parameter type-id='type-id-65' name='outproc' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='462' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='clnt_broadcast' mangled-name='clnt_broadcast' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clnt_broadcast'>
      <parameter type-id='type-id-87' name='prog' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='500' column='1'/>
      <parameter type-id='type-id-87' name='vers' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='501' column='1'/>
      <parameter type-id='type-id-87' name='proc' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='502' column='1'/>
      <parameter type-id='type-id-65' name='xargs' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='503' column='1'/>
      <parameter type-id='type-id-4' name='argsp' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='504' column='1'/>
      <parameter type-id='type-id-65' name='xresults' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='505' column='1'/>
      <parameter type-id='type-id-4' name='resultsp' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='506' column='1'/>
      <parameter type-id='type-id-137' name='eachresult' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='507' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='authdes_create' mangled-name='authdes_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='authdes_create'>
      <parameter type-id='type-id-11' name='servername' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='529' column='1'/>
      <parameter type-id='type-id-8' name='window' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='530' column='1'/>
      <parameter type-id='type-id-108' name='syncaddr' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='531' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <class-decl name='sockaddr_un' size-in-bits='880' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/un.h' line='30' column='1' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sun_family' type-id='type-id-106' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/un.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sun_path' type-id='type-id-293' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/un.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='864' id='type-id-293'>
      <subrange length='108'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-294'/>
    <function-decl name='clntunix_create' mangled-name='clntunix_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clntunix_create'>
      <parameter type-id='type-id-294' name='raddr' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='560' column='1'/>
      <parameter type-id='type-id-87' name='prog' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='561' column='1'/>
      <parameter type-id='type-id-87' name='vers' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='562' column='1'/>
      <parameter type-id='type-id-101' name='sockp' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='563' column='1'/>
      <parameter type-id='type-id-8' name='sendsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='564' column='1'/>
      <parameter type-id='type-id-8' name='recvsz' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='565' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='svcunix_create' mangled-name='svcunix_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='svcunix_create'>
      <parameter type-id='type-id-5' name='sock' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='610' column='1'/>
      <parameter type-id='type-id-8' name='sendsize' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='611' column='1'/>
      <parameter type-id='type-id-8' name='recvsize' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='612' column='1'/>
      <parameter type-id='type-id-11' name='path' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='613' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='svcunixfd_create' mangled-name='svcunixfd_create' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='svcunixfd_create'>
      <parameter type-id='type-id-5' name='fd' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='671' column='1'/>
      <parameter type-id='type-id-8' name='sendsize' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='672' column='1'/>
      <parameter type-id='type-id-8' name='recvsize' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='673' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='169' column='1'/>
    <var-decl name='stdout' type-id='type-id-71' visibility='default' filepath='/usr/include/stdio.h' line='170' column='1'/>
    <var-decl name='__svc_xports' type-id='type-id-178' mangled-name='__svc_xports' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='90' column='1' elf-symbol-id='__svc_xports'/>
    <var-decl name='__svc_maxrec' type-id='type-id-5' mangled-name='__svc_maxrec' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_com.h' line='91' column='1' elf-symbol-id='__svc_maxrec'/>
    <var-decl name='clnt_broadcast_key' type-id='type-id-250' visibility='default' filepath='/home/max/src/v6/libtirpc/src/rpc_soc.c' line='473' column='1'/>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pmap_getport' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/pmap_clnt.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-139'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_nconf2fd_flags' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_nconf2fd' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpc.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__rpc_getconfip' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/nettype.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='bindresvport' filepath='/usr/include/netinet/in.h' line='492' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='clnt_tli_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='freenetconfigent' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__rpc_createerr' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/x86_64-linux-gnu/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-101'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='listen' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='204' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='t_bind' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='93' column='1' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-143' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qlen' type-id='type-id-13' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/types.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-296'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <function-decl name='svc_tli_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='syslog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-48'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='clnt_raw_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='415' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='svc_fd_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='svc_raw_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-177'/>
    </function-decl>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-298'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-299'/>
    <function-decl name='rpc_call' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-298'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='rpc_reg' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/svc.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_setspecific' filepath='/usr/include/pthread.h' line='1106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-137' const='yes' id='type-id-300'/>
    <function-decl name='rpc_broadcast' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='526' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-298'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-300'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='pthread_key_create' filepath='/usr/include/pthread.h' line='1095' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-105' const='yes' id='type-id-301'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-302'/>
    <function-decl name='getnameinfo' filepath='/usr/include/netdb.h' line='679' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='authdes_seccreate' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/auth.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='clnt_vc_create' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/clnt.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='socket' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='connect' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='setnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='bind' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='endnetconfig' filepath='/home/max/src/v6/libtirpc/tirpc/netconfig.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-290'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' language='LANG_C89'>
    <function-decl name='__rpc_control' mangled-name='__rpc_control' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpc_control'>
      <parameter type-id='type-id-5' name='request' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='105' column='1'/>
      <parameter type-id='type-id-4' name='info' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='106' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='rpcb_set' mangled-name='rpcb_set' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpcb_set'>
      <parameter type-id='type-id-132' name='program' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='513' column='1'/>
      <parameter type-id='type-id-133' name='version' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='514' column='1'/>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='515' column='1'/>
      <parameter type-id='type-id-231' name='address' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='516' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='rpcb_unset' mangled-name='rpcb_unset' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='573' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpcb_unset'>
      <parameter type-id='type-id-132' name='program' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='574' column='1'/>
      <parameter type-id='type-id-133' name='version' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='575' column='1'/>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='576' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='__rpcb_findaddr_timed' mangled-name='__rpcb_findaddr_timed' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rpcb_findaddr_timed'>
      <parameter type-id='type-id-132' name='program' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='698' column='1'/>
      <parameter type-id='type-id-133' name='version' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='699' column='1'/>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='700' column='1'/>
      <parameter type-id='type-id-48' name='host' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='701' column='1'/>
      <parameter type-id='type-id-247' name='clpp' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='702' column='1'/>
      <parameter type-id='type-id-93' name='tp' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='703' column='1'/>
      <return type-id='type-id-193'/>
    </function-decl>
    <function-decl name='rpcb_getaddr' mangled-name='rpcb_getaddr' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpcb_getaddr'>
      <parameter type-id='type-id-132' name='program' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='925' column='1'/>
      <parameter type-id='type-id-133' name='version' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='926' column='1'/>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='927' column='1'/>
      <parameter type-id='type-id-193' name='address' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='928' column='1'/>
      <parameter type-id='type-id-48' name='host' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='929' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <class-decl name='rp__list' size-in-bits='320' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='171' column='1' id='type-id-303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rpcb_map' type-id='type-id-304' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rpcb_next' type-id='type-id-305' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='173' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rpcb' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='140' column='1' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r_prog' type-id='type-id-132' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='r_vers' type-id='type-id-133' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='r_netid' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='r_addr' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='r_owner' type-id='type-id-11' visibility='default' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='rpcb' type-id='type-id-306' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='147' column='1' id='type-id-304'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-305'/>
    <typedef-decl name='rpcblist' type-id='type-id-303' filepath='/home/max/src/v6/libtirpc/tirpc/rpc/rpcb_prot.h' line='195' column='1' id='type-id-307'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-308'/>
    <function-decl name='rpcb_getmaps' mangled-name='rpcb_getmaps' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='960' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpcb_getmaps'>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='961' column='1'/>
      <parameter type-id='type-id-48' name='host' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='962' column='1'/>
      <return type-id='type-id-308'/>
    </function-decl>
    <function-decl name='rpcb_rmtcall' mangled-name='rpcb_rmtcall' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rpcb_rmtcall'>
      <parameter type-id='type-id-190' name='nconf' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1014' column='1'/>
      <parameter type-id='type-id-48' name='host' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1015' column='1'/>
      <parameter type-id='type-id-132' name='prog' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1016' column='1'/>
      <parameter type-id='type-id-133' name='vers' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1017' column='1'/>
      <parameter type-id='type-id-134' name='proc' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1018' column='1'/>
      <parameter type-id='type-id-65' name='xdrargs' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1019' column='1'/>
      <parameter type-id='type-id-7' name='argsp' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1020' column='1'/>
      <parameter type-id='type-id-65' name='xdrres' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1019' column='1'/>
      <parameter type-id='type-id-7' name='resp' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1020' column='1'/>
      <parameter type-id='type-id-90' name='tout' filepath='/home/max/src/v6/libtirpc/src/rpcb_clnt.c' line='1021' column='1'/>
