<abi-corpus path='data/test-read-dwarf/test16-pr18904.so' soname='liboffloadmic_host.so.5'>
  <elf-needed>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='ORSLRelease' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReservePartial' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLTryReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_find_associated_mic_memory' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_physical_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_number_of_devices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='omp_unset_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZN3COI13EngineGetInfoE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI18PipelineSetCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI20PipelineClearCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI21EventRegisterCallbackE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine12m_func_namesE' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine14c_signal_namesE' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream11all_streamsE' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream13m_stream_lockE' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream15m_streams_countE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_major_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_minor_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_is_attached' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_exe_name' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_id' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_so_pid' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_func_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_init_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_var_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_vtable_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../../gcc/liboffloadmic/runtime/cean_util.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../../gcc/liboffloadmic/runtime/coi/coi_client.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32768' id='type-id-3'>
      <subrange length='1024' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='128' id='type-id-7'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='8160' id='type-id-10'>
      <subrange length='255' type-id='type-id-4' id='type-id-11'/>
    </array-type-def>
    <typedef-decl name='COIRESULT' type-id='type-id-12' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIResult_common.h' line='122' column='1' id='type-id-13'/>
    <enum-decl name='COIRESULT' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIResult_common.h' line='57' column='1' id='type-id-12'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_SUCCESS' value='0'/>
      <enumerator name='COI_ERROR' value='1'/>
      <enumerator name='COI_NOT_INITIALIZED' value='2'/>
      <enumerator name='COI_ALREADY_INITIALIZED' value='3'/>
      <enumerator name='COI_ALREADY_EXISTS' value='4'/>
      <enumerator name='COI_DOES_NOT_EXIST' value='5'/>
      <enumerator name='COI_INVALID_POINTER' value='6'/>
      <enumerator name='COI_OUT_OF_RANGE' value='7'/>
      <enumerator name='COI_NOT_SUPPORTED' value='8'/>
      <enumerator name='COI_TIME_OUT_REACHED' value='9'/>
      <enumerator name='COI_MEMORY_OVERLAP' value='10'/>
      <enumerator name='COI_ARGUMENT_MISMATCH' value='11'/>
      <enumerator name='COI_SIZE_MISMATCH' value='12'/>
      <enumerator name='COI_OUT_OF_MEMORY' value='13'/>
      <enumerator name='COI_INVALID_HANDLE' value='14'/>
      <enumerator name='COI_RETRY' value='15'/>
      <enumerator name='COI_RESOURCE_EXHAUSTED' value='16'/>
      <enumerator name='COI_ALREADY_LOCKED' value='17'/>
      <enumerator name='COI_NOT_LOCKED' value='18'/>
      <enumerator name='COI_MISSING_DEPENDENCY' value='19'/>
      <enumerator name='COI_UNDEFINED_SYMBOL' value='20'/>
      <enumerator name='COI_PENDING' value='21'/>
      <enumerator name='COI_BINARY_AND_HARDWARE_MISMATCH' value='22'/>
      <enumerator name='COI_PROCESS_DIED' value='23'/>
      <enumerator name='COI_INVALID_FILE' value='24'/>
      <enumerator name='COI_EVENT_CANCELED' value='25'/>
      <enumerator name='COI_VERSION_MISMATCH' value='26'/>
      <enumerator name='COI_BAD_PORT' value='27'/>
      <enumerator name='COI_AUTHENTICATION_FAILURE' value='28'/>
      <enumerator name='COI_NUM_RESULTS' value='29'/>
    </enum-decl>
    <typedef-decl name='COI_ISA_TYPE' type-id='type-id-15' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIEngine_common.h' line='78' column='1' id='type-id-16'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' linkage-name='12COI_ISA_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIEngine_common.h' line='70' column='1' id='type-id-15'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_ISA_INVALID' value='0'/>
      <enumerator name='COI_ISA_x86_64' value='1'/>
      <enumerator name='COI_ISA_MIC' value='2'/>
      <enumerator name='COI_ISA_KNF' value='3'/>
      <enumerator name='COI_ISA_KNC' value='4'/>
    </enum-decl>
    <typedef-decl name='uint32_t' type-id='type-id-2' filepath='/usr/include/stdint.h' line='51' column='1' id='type-id-17'/>
    <typedef-decl name='COIENGINE' type-id='type-id-18' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='68' column='1' id='type-id-19'/>
    <typedef-decl name='uint8_t' type-id='type-id-1' filepath='/usr/include/stdint.h' line='48' column='1' id='type-id-20'/>
    <typedef-decl name='COIPROCESS' type-id='type-id-21' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='65' column='1' id='type-id-22'/>
    <typedef-decl name='COIEVENT' type-id='type-id-23' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='69' column='1' id='type-id-24'/>
    <typedef-decl name='int32_t' type-id='type-id-25' filepath='/usr/include/stdint.h' line='38' column='1' id='type-id-26'/>
    <typedef-decl name='int8_t' type-id='type-id-27' filepath='/usr/include/stdint.h' line='36' column='1' id='type-id-28'/>
    <typedef-decl name='COIFUNCTION' type-id='type-id-29' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='67' column='1' id='type-id-30'/>
    <typedef-decl name='COILIBRARY' type-id='type-id-31' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='71' column='1' id='type-id-32'/>
    <typedef-decl name='COIPIPELINE' type-id='type-id-33' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='66' column='1' id='type-id-34'/>
    <typedef-decl name='COIBUFFER' type-id='type-id-35' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='70' column='1' id='type-id-36'/>
    <typedef-decl name='COI_ACCESS_FLAGS' type-id='type-id-37' filepath='../../../gcc/liboffloadmic/include/coi/source/COIPipeline_source.h' line='97' column='1' id='type-id-38'/>
    <enum-decl name='COI_ACCESS_FLAGS' filepath='../../../gcc/liboffloadmic/include/coi/source/COIPipeline_source.h' line='69' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_SINK_READ' value='1'/>
      <enumerator name='COI_SINK_WRITE' value='2'/>
      <enumerator name='COI_SINK_WRITE_ENTIRE' value='3'/>
      <enumerator name='COI_SINK_READ_ADDREF' value='4'/>
      <enumerator name='COI_SINK_WRITE_ADDREF' value='5'/>
      <enumerator name='COI_SINK_WRITE_ENTIRE_ADDREF' value='6'/>
    </enum-decl>
    <typedef-decl name='uint16_t' type-id='type-id-39' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-40'/>
    <typedef-decl name='COI_BUFFER_TYPE' type-id='type-id-41' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='87' column='1' id='type-id-42'/>
    <enum-decl name='COI_BUFFER_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='65' column='1' id='type-id-41'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_BUFFER_NORMAL' value='1'/>
      <enumerator name='COI_BUFFER_RESERVED_1' value='2'/>
      <enumerator name='COI_BUFFER_RESERVED_2' value='3'/>
      <enumerator name='COI_BUFFER_PINNED' value='4'/>
      <enumerator name='COI_BUFFER_OPENCL' value='5'/>
    </enum-decl>
    <typedef-decl name='COI_MAP_TYPE' type-id='type-id-43' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='204' column='1' id='type-id-44'/>
    <enum-decl name='COI_MAP_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='183' column='1' id='type-id-43'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_MAP_READ_WRITE' value='1'/>
      <enumerator name='COI_MAP_READ_ONLY' value='2'/>
      <enumerator name='COI_MAP_WRITE_ENTIRE_BUFFER' value='3'/>
    </enum-decl>
    <typedef-decl name='COIMAPINSTANCE' type-id='type-id-45' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='72' column='1' id='type-id-46'/>
    <typedef-decl name='COI_COPY_TYPE' type-id='type-id-47' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='265' column='1' id='type-id-48'/>
    <enum-decl name='COI_COPY_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='240' column='1' id='type-id-47'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_COPY_UNSPECIFIED' value='0'/>
      <enumerator name='COI_COPY_USE_DMA' value='1'/>
      <enumerator name='COI_COPY_USE_CPU' value='2'/>
      <enumerator name='COI_COPY_UNSPECIFIED_MOVE_ENTIRE' value='3'/>
      <enumerator name='COI_COPY_USE_DMA_MOVE_ENTIRE' value='4'/>
      <enumerator name='COI_COPY_USE_CPU_MOVE_ENTIRE' value='5'/>
    </enum-decl>
    <typedef-decl name='COI_BUFFER_STATE' type-id='type-id-49' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='342' column='1' id='type-id-50'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' linkage-name='16COI_BUFFER_STATE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='335' column='1' id='type-id-49'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_BUFFER_VALID' value='0'/>
      <enumerator name='COI_BUFFER_INVALID' value='1'/>
      <enumerator name='COI_BUFFER_VALID_MAY_DROP' value='2'/>
      <enumerator name='COI_BUFFER_RESERVED' value='3'/>
    </enum-decl>
    <typedef-decl name='COI_BUFFER_MOVE_FLAG' type-id='type-id-51' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='362' column='1' id='type-id-52'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' linkage-name='20COI_BUFFER_MOVE_FLAG' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='359' column='1' id='type-id-51'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_BUFFER_MOVE' value='0'/>
      <enumerator name='COI_BUFFER_NO_MOVE' value='1'/>
    </enum-decl>
    <typedef-decl name='COI_ENGINE_INFO' type-id='type-id-53' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='133' column='1' id='type-id-54'/>
    <class-decl name='COI_ENGINE_INFO' size-in-bits='41472' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='83' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='DriverVersion' type-id='type-id-10' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8160'>
        <var-decl name='ISA' type-id='type-id-16' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='NumCores' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8224'>
        <var-decl name='MiscFlags' type-id='type-id-55' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='NumThreads' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8288'>
        <var-decl name='CoreMaxFrequency' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='Load' type-id='type-id-3' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41088'>
        <var-decl name='PhysicalMemory' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41152'>
        <var-decl name='PhysicalMemoryFree' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41216'>
        <var-decl name='SwapMemory' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41280'>
        <var-decl name='SwapMemoryFree' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41344'>
        <var-decl name='VendorId' type-id='type-id-40' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41360'>
        <var-decl name='DeviceId' type-id='type-id-40' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41376'>
        <var-decl name='SubSystemId' type-id='type-id-40' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41392'>
        <var-decl name='BoardStepping' type-id='type-id-40' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41408'>
        <var-decl name='BoardSKU' type-id='type-id-40' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='coi_eng_misc' type-id='type-id-57' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='74' column='1' id='type-id-55'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' linkage-name='12coi_eng_misc' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='70' column='1' id='type-id-57'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='COI_ENG_ECC_DISABLED' value='0'/>
      <enumerator name='COI_ENG_ECC_ENABLED' value='1'/>
      <enumerator name='COI_ENG_ECC_UNKNOWN' value='2'/>
    </enum-decl>
    <class-decl name='coievent' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='63' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opaque' type-id='type-id-7' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-21'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-74'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-75'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-76'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-78'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-82'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
    <namespace-decl name='COI'>
      <function-decl name='fini' mangled-name='_ZN3COI4finiEv' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.cpp' line='482' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='type-id-149'/>
      </function-decl>
      <function-decl name='init' mangled-name='_ZN3COI4initEv' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.cpp' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='type-id-150'/>
      </function-decl>
      <var-decl name='is_available' type-id='type-id-150' mangled-name='_ZN3COI12is_availableE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='60' column='1'/>
      <var-decl name='EngineGetCount' type-id='type-id-132' mangled-name='_ZN3COI14EngineGetCountE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='63' column='1'/>
      <var-decl name='EngineGetHandle' type-id='type-id-130' mangled-name='_ZN3COI15EngineGetHandleE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='64' column='1'/>
      <var-decl name='ProcessCreateFromMemory' type-id='type-id-104' mangled-name='_ZN3COI23ProcessCreateFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='66' column='1'/>
      <var-decl name='ProcessCreateFromFile' type-id='type-id-102' mangled-name='_ZN3COI21ProcessCreateFromFileE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='74' column='1'/>
      <var-decl name='ProcessSetCacheSize' type-id='type-id-124' mangled-name='_ZN3COI19ProcessSetCacheSizeE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='82' column='1'/>
      <var-decl name='ProcessDestroy' type-id='type-id-118' mangled-name='_ZN3COI14ProcessDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='85' column='1'/>
      <var-decl name='ProcessGetFunctionHandles' type-id='type-id-120' mangled-name='_ZN3COI25ProcessGetFunctionHandlesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='87' column='1'/>
      <var-decl name='ProcessLoadLibraryFromMemory' type-id='type-id-128' mangled-name='_ZN3COI28ProcessLoadLibraryFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='90' column='1'/>
      <var-decl name='ProcessUnloadLibrary' type-id='type-id-116' mangled-name='_ZN3COI20ProcessUnloadLibraryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='100' column='1'/>
      <var-decl name='ProcessRegisterLibraries' type-id='type-id-136' mangled-name='_ZN3COI24ProcessRegisterLibrariesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='103' column='1'/>
      <var-decl name='PipelineCreate' type-id='type-id-126' mangled-name='_ZN3COI14PipelineCreateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='109' column='1'/>
      <var-decl name='PipelineDestroy' type-id='type-id-112' mangled-name='_ZN3COI15PipelineDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='111' column='1'/>
      <var-decl name='PipelineRunFunction' type-id='type-id-114' mangled-name='_ZN3COI19PipelineRunFunctionE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='112' column='1'/>
      <var-decl name='BufferCreate' type-id='type-id-140' mangled-name='_ZN3COI12BufferCreateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='119' column='1'/>
      <var-decl name='BufferCreateFromMemory' type-id='type-id-140' mangled-name='_ZN3COI22BufferCreateFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='122' column='1'/>
      <var-decl name='BufferDestroy' type-id='type-id-86' mangled-name='_ZN3COI13BufferDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='126' column='1'/>
      <var-decl name='BufferMap' type-id='type-id-94' mangled-name='_ZN3COI9BufferMapE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='127' column='1'/>
      <var-decl name='BufferUnmap' type-id='type-id-110' mangled-name='_ZN3COI11BufferUnmapE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='130' column='1'/>
      <var-decl name='BufferWrite' type-id='type-id-96' mangled-name='_ZN3COI11BufferWriteE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='132' column='1'/>
      <var-decl name='BufferRead' type-id='type-id-96' mangled-name='_ZN3COI10BufferReadE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='135' column='1'/>
      <var-decl name='BufferReadMultiD' type-id='type-id-98' mangled-name='_ZN3COI16BufferReadMultiDE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='138' column='1'/>
      <var-decl name='BufferWriteMultiD' type-id='type-id-92' mangled-name='_ZN3COI17BufferWriteMultiDE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='141' column='1'/>
      <var-decl name='BufferCopy' type-id='type-id-88' mangled-name='_ZN3COI10BufferCopyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='145' column='1'/>
      <var-decl name='BufferGetSinkAddress' type-id='type-id-100' mangled-name='_ZN3COI20BufferGetSinkAddressE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='148' column='1'/>
      <var-decl name='BufferSetState' type-id='type-id-90' mangled-name='_ZN3COI14BufferSetStateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='149' column='1'/>
      <var-decl name='EventWait' type-id='type-id-134' mangled-name='_ZN3COI9EventWaitE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='153' column='1'/>
      <var-decl name='PerfGetCycleFrequency' type-id='type-id-144' mangled-name='_ZN3COI21PerfGetCycleFrequencyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='156' column='1'/>
      <var-decl name='PipelineClearCPUMask' type-id='type-id-142' mangled-name='_ZN3COI20PipelineClearCPUMaskE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='160' column='1' elf-symbol-id='_ZN3COI20PipelineClearCPUMaskE'/>
      <var-decl name='PipelineSetCPUMask' type-id='type-id-122' mangled-name='_ZN3COI18PipelineSetCPUMaskE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='162' column='1' elf-symbol-id='_ZN3COI18PipelineSetCPUMaskE'/>
      <var-decl name='EngineGetInfo' type-id='type-id-106' mangled-name='_ZN3COI13EngineGetInfoE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='164' column='1' elf-symbol-id='_ZN3COI13EngineGetInfoE'/>
      <var-decl name='EventRegisterCallback' type-id='type-id-108' mangled-name='_ZN3COI21EventRegisterCallbackE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='166' column='1' elf-symbol-id='_ZN3COI21EventRegisterCallbackE'/>
      <var-decl name='ProcessConfigureDMA' type-id='type-id-138' mangled-name='_ZN3COI19ProcessConfigureDMAE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='158' column='1'/>
    </namespace-decl>
    <type-decl name='bool' size-in-bits='8' id='type-id-150'/>
    <function-type size-in-bits='64' id='type-id-85'>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-87'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-89'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-91'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-93'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-95'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-97'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-99'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-101'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-103'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-105'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-107'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-111'>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-113'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-117'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-119'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-121'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-123'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-141'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-143'>
      <return type-id='type-id-56'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-149'/>
    </function-type>
    <type-decl name='int' size-in-bits='32' id='type-id-25'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-4'/>
    <class-decl name='coibuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-67'/>
    <class-decl name='coiengine' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <class-decl name='coifunction' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <class-decl name='coilibrary' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-70'/>
    <class-decl name='coimapinst' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-71'/>
    <class-decl name='coipipeline' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <class-decl name='coiprocess' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <typedef-decl name='uint64_t' type-id='type-id-6' filepath='/usr/include/stdint.h' line='55' column='1' id='type-id-56'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-2'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-39'/>
    <type-decl name='void' id='type-id-149'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-9'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
    <qualified-type-def type-id='type-id-156' const='yes' id='type-id-155'/>
    <type-decl name='char' size-in-bits='8' id='type-id-156'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../../gcc/liboffloadmic/runtime/compiler_if_host.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-157' size-in-bits='128' id='type-id-158'>
      <subrange length='1' type-id='type-id-4' id='type-id-159'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-160' size-in-bits='320' id='type-id-161'>
      <subrange length='1' type-id='type-id-4' id='type-id-159'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-162' size-in-bits='2560' id='type-id-163'>
      <subrange length='20' type-id='type-id-4' id='type-id-164'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-165' size-in-bits='1152' id='type-id-166'>
      <subrange length='9' type-id='type-id-4' id='type-id-167'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-156' size-in-bits='infinite' id='type-id-168'>
      <subrange length='infinite' type-id='type-id-4' id='type-id-169'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-29' size-in-bits='448' id='type-id-170'>
      <subrange length='7' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-153' size-in-bits='2048' id='type-id-172'>
      <subrange length='32' type-id='type-id-4' id='type-id-173'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-153' size-in-bits='448' id='type-id-174'>
      <subrange length='7' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='832' id='type-id-175'>
      <subrange length='104' type-id='type-id-4' id='type-id-176'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-177'>
      <subrange length='16' type-id='type-id-4' id='type-id-178'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' id='type-id-179'>
      <subrange length='24' type-id='type-id-4' id='type-id-180'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-181'>
      <subrange length='40' type-id='type-id-4' id='type-id-182'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' id='type-id-183'>
      <subrange length='8' type-id='type-id-4' id='type-id-184'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='1024' id='type-id-185'>
      <subrange length='16' type-id='type-id-4' id='type-id-178'/>
    </array-type-def>
    <class-decl name='Engine' size-in-bits='5504' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='395' column='1' id='type-id-186'>
      <member-type access='private'>
        <typedef-decl name='SignalMap' type-id='type-id-188' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='608' column='1' id='type-id-187'/>
      </member-type>
      <member-type access='private'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='647' column='1' id='type-id-189'>
          <underlying-type type-id='type-id-14'/>
          <enumerator name='c_func_compute' value='0'/>
          <enumerator name='c_func_myo_init' value='1'/>
          <enumerator name='c_func_myo_fini' value='2'/>
          <enumerator name='c_func_init' value='3'/>
          <enumerator name='c_func_var_table_size' value='4'/>
          <enumerator name='c_func_var_table_copy' value='5'/>
          <enumerator name='c_func_set_stream_affinity' value='6'/>
          <enumerator name='c_funcs_total' value='7'/>
        </enum-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_persist_list' type-id='type-id-190' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='563' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_index' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='611' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='m_physical_index' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='612' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_proc_number' type-id='type-id-191' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='615' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_process' type-id='type-id-22' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='618' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_ready' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='622' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_lock' type-id='type-id-192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='623' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_images' type-id='type-id-193' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='626' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='m_ptr_set' type-id='type-id-194' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='629' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_targetptr_set' type-id='type-id-194' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='630' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2368'>
        <var-decl name='m_signal_map' type-id='type-id-187' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='633' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2752'>
        <var-decl name='m_signal_lock' type-id='type-id-192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='634' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <var-decl name='m_stream_map' type-id='type-id-195' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='637' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3456'>
        <var-decl name='m_stream_lock' type-id='type-id-192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='638' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3776'>
        <var-decl name='m_num_cores' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='639' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3808'>
        <var-decl name='m_num_threads' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='640' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3840'>
        <var-decl name='m_cpus' type-id='type-id-196' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='641' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4864'>
        <var-decl name='m_dyn_libs' type-id='type-id-197' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='644' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='m_func_names' type-id='type-id-174' mangled-name='_ZN6Engine12m_func_namesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='659' column='1' elf-symbol-id='_ZN6Engine12m_func_namesE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5056'>
        <var-decl name='m_funcs' type-id='type-id-170' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='662' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='c_signal_max' type-id='type-id-198' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='665' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='c_signal_names' type-id='type-id-172' mangled-name='_ZN6Engine14c_signal_namesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='666' column='1' elf-symbol-id='_ZN6Engine14c_signal_namesE'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='get_logical_index' mangled-name='_ZNK6Engine17get_logical_indexEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine17get_logical_indexEv'>
          <parameter type-id='type-id-199' is-artificial='yes'/>
          <return type-id='type-id-25'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_physical_index' mangled-name='_ZNK6Engine18get_physical_indexEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine18get_physical_indexEv'>
          <parameter type-id='type-id-199' is-artificial='yes'/>
          <return type-id='type-id-25'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_process' mangled-name='_ZNK6Engine11get_processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine11get_processEv'>
          <parameter type-id='type-id-199' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_thread_id' mangled-name='_ZN6Engine13get_thread_idEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13get_thread_idEv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN6Engine4initEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine4initEv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='unload_library' mangled-name='_ZN6Engine14unload_libraryEPKvPKc' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14unload_libraryEPKvPKc'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-153'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_lib' mangled-name='_ZN6Engine7add_libERK11TargetImage' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine7add_libERK11TargetImage'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-202'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='compute' mangled-name='_ZN6Engine7computeEmRKNSt7__cxx114listIP9coibufferSaIS3_EEEPKvtPvtjPK8coieventPSB_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine7computeEmRKNSt7__cxx114listIP9coibufferSaIS3_EEEPKvtPvtjPK8coieventPSB_'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-203'/>
          <parameter type-id='type-id-204'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-40'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-40'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-13'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init_myo' mangled-name='_ZN6Engine8init_myoEP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine8init_myoEP8coievent'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='fini_myo' mangled-name='_ZN6Engine8fini_myoEP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine8fini_myoEP8coievent'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_ptr_data' mangled-name='_ZN6Engine13find_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13find_ptr_dataEPKv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-205'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_targetptr_data' mangled-name='_ZN6Engine19find_targetptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine19find_targetptr_dataEPKv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-205'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_ptr_data' mangled-name='_ZN6Engine15insert_ptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine15insert_ptr_dataEPKvmRb'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-206'/>
          <return type-id='type-id-205'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_targetptr_data' mangled-name='_ZN6Engine21insert_targetptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine21insert_targetptr_dataEPKvmRb'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-206'/>
          <return type-id='type-id-205'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_ptr_data' mangled-name='_ZN6Engine15remove_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine15remove_ptr_dataEPKv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_targetptr_data' mangled-name='_ZN6Engine21remove_targetptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine21remove_targetptr_dataEPKv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_auto_data' mangled-name='_ZN6Engine14find_auto_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='504' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14find_auto_dataEPKv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-207'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_auto_data' mangled-name='_ZN6Engine16insert_auto_dataEPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine16insert_auto_dataEPKvm'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-207'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_auto_data' mangled-name='_ZN6Engine16remove_auto_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine16remove_auto_dataEPKv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_signal' mangled-name='_ZN6Engine10add_signalEPKvP17OffloadDescriptor' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine10add_signalEPKvP17OffloadDescriptor'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-208'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_signal' mangled-name='_ZN6Engine11find_signalEPKvb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11find_signalEPKvb'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-208'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='stream_destroy' mangled-name='_ZN6Engine14stream_destroyEm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14stream_destroyEm'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-203'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Engine12get_pipelineEm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12get_pipelineEm'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-203'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_stream_map' mangled-name='_ZN6Engine14get_stream_mapEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='555' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-195'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='fini_process' mangled-name='_ZN6Engine12fini_processEb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12fini_processEb'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Engine' mangled-name='_ZN6EngineC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Engine' mangled-name='_ZN6EngineD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_indexes' mangled-name='_ZN6Engine11set_indexesEii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11set_indexesEii'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_process' mangled-name='_ZN6Engine12init_processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12init_processEv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='load_libraries' mangled-name='_ZN6Engine14load_librariesEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14load_librariesEv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_ptr_data' mangled-name='_ZN6Engine13init_ptr_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13init_ptr_dataEv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_device' mangled-name='_ZN6Engine11init_deviceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11init_deviceEv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-209'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Engine12get_pipelineEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12get_pipelineEv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_auto_vars' mangled-name='_ZN6Engine13get_auto_varsEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13get_auto_varsEv'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-210'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='destroy_thread_data' mangled-name='_ZN6Engine19destroy_thread_dataEPv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine19destroy_thread_dataEPv'>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Engine' mangled-name='_ZN6EngineD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6EngineD1Ev'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Engine' mangled-name='_ZN6EngineC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6EngineC1Ev'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TargetImage' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='262' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='origin' type-id='type-id-153' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='offset' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='279' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='TargetImage' mangled-name='_ZN11TargetImageC4EPKcPKvmS1_m' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-153'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-153'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='TargetImage' mangled-name='_ZN11TargetImageC2EPKcPKvmS1_m' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11TargetImageC2EPKcPKvmS1_m'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-153'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-153'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PersistData' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='302' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stack_cpu_addr' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='routine_id' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='thread_id' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stack_ptr_data' type-id='type-id-205' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cpu_stack_addr' type-id='type-id-214' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='320' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='PersistData' mangled-name='_ZN11PersistDataC4EPKvmmm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-215' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='PersistData' mangled-name='_ZN11PersistDataC2EPKvmmm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11PersistDataC1EPKvmmm'>
          <parameter type-id='type-id-215' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PtrData' size-in-bits='832' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='81' column='1' id='type-id-216'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='cpu_addr' type-id='type-id-217' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='cpu_buf' type-id='type-id-36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='mic_buf' type-id='type-id-36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='mic_addr' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='alloc_disp' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='mic_offset' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='is_static' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='alloc_ptr_data_lock' type-id='type-id-192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='ref_count' type-id='type-id-191' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='158' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-205' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC4ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-205' is-artificial='yes'/>
          <parameter type-id='type-id-218'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='operator&lt;' mangled-name='_ZNK7PtrDataltERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK7PtrDataltERKS_'>
          <parameter type-id='type-id-219' is-artificial='yes'/>
          <parameter type-id='type-id-218'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_reference' mangled-name='_ZN7PtrData13add_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrData13add_referenceEv'>
          <parameter type-id='type-id-205' is-artificial='yes'/>
          <return type-id='type-id-191'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_reference' mangled-name='_ZN7PtrData16remove_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrData16remove_referenceEv'>
          <parameter type-id='type-id-205' is-artificial='yes'/>
          <return type-id='type-id-191'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='get_reference' mangled-name='_ZNK7PtrData13get_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK7PtrData13get_referenceEv'>
          <parameter type-id='type-id-219' is-artificial='yes'/>
          <return type-id='type-id-191'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC1ERKS_'>
          <parameter type-id='type-id-205' is-artificial='yes'/>
          <parameter type-id='type-id-218'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC1EPKvm'>
          <parameter type-id='type-id-205' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC1ERKS_'>
          <parameter type-id='type-id-205' is-artificial='yes'/>
          <parameter type-id='type-id-218'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC1EPKvm'>
          <parameter type-id='type-id-205' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AutoData' size-in-bits='192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='208' column='1' id='type-id-220'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='cpu_addr' type-id='type-id-217' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='ref_count' type-id='type-id-191' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='255' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='AutoData' mangled-name='_ZN8AutoDataC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='operator&lt;' mangled-name='_ZNK8AutoDataltERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8AutoDataltERKS_'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <parameter type-id='type-id-222'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_reference' mangled-name='_ZN8AutoData13add_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData13add_referenceEv'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <return type-id='type-id-191'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_reference' mangled-name='_ZN8AutoData16remove_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData16remove_referenceEv'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <return type-id='type-id-191'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nullify_reference' mangled-name='_ZN8AutoData17nullify_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData17nullify_referenceEv'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <return type-id='type-id-191'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='get_reference' mangled-name='_ZNK8AutoData13get_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8AutoData13get_referenceEv'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <return type-id='type-id-191'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='AutoData' mangled-name='_ZN8AutoDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoDataC2EPKvm'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='OFFLOAD' type-id='type-id-208' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='500' column='1' id='type-id-223'/>
    <class-decl name='Arr_Desc' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='46' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rank' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dim' type-id='type-id-161' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Dim_Desc' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='38' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lindex' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lower' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='upper' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stride' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='CeanReadDim' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='52' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PtrDataList' type-id='type-id-226' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='161' column='1' id='type-id-227'/>
    <typedef-decl name='PersistDataList' type-id='type-id-228' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='323' column='1' id='type-id-190'/>
    <typedef-decl name='TargetImageList' type-id='type-id-229' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='282' column='1' id='type-id-193'/>
    <class-decl name='DynLib' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='285' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lib' type-id='type-id-32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='297' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='DynLib' mangled-name='_ZN6DynLibC4EPKcPKvP10coilibrary' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <parameter type-id='type-id-153'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-32'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='DynLib' mangled-name='_ZN6DynLibC2EPKcPKvP10coilibrary' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6DynLibC1EPKcPKvP10coilibrary'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <parameter type-id='type-id-153'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-32'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='StreamMap' type-id='type-id-232' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='392' column='1' id='type-id-195'/>
    <typedef-decl name='_Offload_stream' type-id='type-id-56' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='96' column='1' id='type-id-203'/>
    <class-decl name='OffloadDescriptor' size-in-bits='2368' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='68' column='1' id='type-id-233'>
      <member-type access='public'>
        <enum-decl name='OmpAsyncLastEventType' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='71' column='1' id='type-id-234'>
          <underlying-type type-id='type-id-14'/>
          <enumerator name='c_last_not' value='0'/>
          <enumerator name='c_last_write' value='1'/>
          <enumerator name='c_last_read' value='2'/>
          <enumerator name='c_last_runfunc' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='VarExtra' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='216' column='1' id='type-id-235'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='src_data' type-id='type-id-205' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='dst_data' type-id='type-id-205' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='218' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='auto_data' type-id='type-id-207' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='219' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='cpu_disp' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='220' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='cpu_offset' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='221' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='alloc' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='222' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='read_rng_src' type-id='type-id-236' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='223' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='read_rng_dst' type-id='type-id-236' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='224' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='ptr_arr_offset' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='225' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='is_arr_ptr_el' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='226' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='608'>
            <var-decl name='omp_last_event_type' type-id='type-id-234' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='227' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ReadArrElements&lt;void*&gt;' size-in-bits='512' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='230' column='1' id='type-id-237'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='ranges' type-id='type-id-236' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='269' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='val' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='270' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='el_size' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='271' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='size' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='272' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='offset' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='273' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='length_cur' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='274' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='384'>
            <var-decl name='is_empty' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='275' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='count' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='base' type-id='type-id-214' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='277' column='1'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvEC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-238' is-artificial='yes'/>
              <return type-id='type-id-149'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='read_next' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvE9read_nextEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIPvE9read_nextEb'>
              <parameter type-id='type-id-238' is-artificial='yes'/>
              <parameter type-id='type-id-150'/>
              <return type-id='type-id-150'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvEC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIPvEC1Ev'>
              <parameter type-id='type-id-238' is-artificial='yes'/>
              <return type-id='type-id-149'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ReadArrElements&lt;long int&gt;' size-in-bits='512' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='230' column='1' id='type-id-239'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='ranges' type-id='type-id-236' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='269' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='val' type-id='type-id-191' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='270' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='el_size' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='271' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='size' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='272' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='offset' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='273' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='length_cur' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='274' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='384'>
            <var-decl name='is_empty' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='275' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='count' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='base' type-id='type-id-214' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='277' column='1'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlEC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-240' is-artificial='yes'/>
              <return type-id='type-id-149'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='read_next' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlE9read_nextEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIlE9read_nextEb'>
              <parameter type-id='type-id-240' is-artificial='yes'/>
              <parameter type-id='type-id-150'/>
              <return type-id='type-id-150'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlEC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIlEC1Ev'>
              <parameter type-id='type-id-240' is-artificial='yes'/>
              <return type-id='type-id-149'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='BufferList' type-id='type-id-242' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='213' column='1' id='type-id-241'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_stack_ptr_data' type-id='type-id-205' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='281' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_destroy_stack' type-id='type-id-227' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='282' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_device' type-id='type-id-243' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='285' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_wait_all_devices' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='288' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='328'>
        <var-decl name='m_is_mandatory' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='291' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='336'>
        <var-decl name='m_is_openmp' type-id='type-id-244' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='294' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_in' type-id='type-id-245' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='297' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='m_out' type-id='type-id-245' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='300' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='m_compute_buffers' type-id='type-id-241' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='303' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_destroy_buffers' type-id='type-id-241' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='306' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='m_vars' type-id='type-id-246' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='309' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='m_vars_extra' type-id='type-id-247' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='310' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='m_vars_total' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='311' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_status' type-id='type-id-248' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='314' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='m_func_desc' type-id='type-id-249' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='317' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='m_func_desc_size' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='318' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_inout_buf' type-id='type-id-36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='321' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='m_in_deps' type-id='type-id-60' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='324' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1792'>
        <var-decl name='m_in_deps_total' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1824'>
        <var-decl name='m_in_deps_allocated' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1856'>
        <var-decl name='m_out_deps' type-id='type-id-60' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='327' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1920'>
        <var-decl name='m_out_deps_total' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='328' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1952'>
        <var-decl name='m_out_deps_allocated' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='329' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1984'>
        <var-decl name='m_stream' type-id='type-id-203' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2048'>
        <var-decl name='m_timer_data' type-id='type-id-250' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='335' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2112'>
        <var-decl name='m_in_datalen' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2176'>
        <var-decl name='m_out_datalen' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2240'>
        <var-decl name='m_need_runfunction' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='343' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2248'>
        <var-decl name='m_initial_need_runfunction' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='347' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2256'>
        <var-decl name='m_out_with_preallocated' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2264'>
        <var-decl name='m_preallocated_alloc' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <var-decl name='m_traceback_called' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='360' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <var-decl name='m_omp_async_last_event_type' type-id='type-id-234' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='362' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorC4EiP15_Offload_statusbbP20OffloadHostTimerData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-248'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-250'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='offload' mangled-name='_ZN17OffloadDescriptor7offloadEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7offloadEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-153'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-246'/>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-252'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='offload_finish' mangled-name='_ZN17OffloadDescriptor14offload_finishEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor14offload_finishEb'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='is_signaled' mangled-name='_ZN17OffloadDescriptor11is_signaledEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor11is_signaledEv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_timer_data' mangled-name='_ZNK17OffloadDescriptor14get_timer_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17OffloadDescriptor14get_timer_dataEv'>
          <parameter type-id='type-id-253' is-artificial='yes'/>
          <return type-id='type-id-250'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_stream' mangled-name='_ZN17OffloadDescriptor10set_streamEm' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor10set_streamEm'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-203'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_stream' mangled-name='_ZN17OffloadDescriptor10get_streamEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor10get_streamEv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <return type-id='type-id-203'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='offload_wrap' mangled-name='_ZN17OffloadDescriptor12offload_wrapEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor12offload_wrapEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-153'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-246'/>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-252'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='wait_dependencies' mangled-name='_ZN17OffloadDescriptor17wait_dependenciesEPPKvim' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17wait_dependenciesEPPKvim'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-203'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_descriptors' mangled-name='_ZN17OffloadDescriptor17setup_descriptorsEP7VarDescP8VarDesc2iiPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17setup_descriptorsEP7VarDescP8VarDesc2iiPKv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-246'/>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_misc_data' mangled-name='_ZN17OffloadDescriptor15setup_misc_dataEPKc' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15setup_misc_dataEPKc'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-153'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='send_pointer_data' mangled-name='_ZN17OffloadDescriptor17send_pointer_dataEbPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17send_pointer_dataEbPv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='send_noncontiguous_pointer_data' mangled-name='_ZN17OffloadDescriptor31send_noncontiguous_pointer_dataEiP7PtrDataS1_P8coieventRmjS3_' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor31send_noncontiguous_pointer_dataEiP7PtrDataS1_P8coieventRmjS3_'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-205'/>
          <parameter type-id='type-id-205'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-254'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='receive_noncontiguous_pointer_data' mangled-name='_ZN17OffloadDescriptor34receive_noncontiguous_pointer_dataEiP9coibufferP8coieventRmjS3_' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor34receive_noncontiguous_pointer_dataEiP9coibufferP8coieventRmjS3_'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-36'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-254'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='gather_copyin_data' mangled-name='_ZN17OffloadDescriptor18gather_copyin_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor18gather_copyin_dataEv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='compute' mangled-name='_ZN17OffloadDescriptor7computeEPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7computeEPv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='receive_pointer_data' mangled-name='_ZN17OffloadDescriptor20receive_pointer_dataEbbPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20receive_pointer_dataEbbPv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='scatter_copyout_data' mangled-name='_ZN17OffloadDescriptor20scatter_copyout_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20scatter_copyout_dataEv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='cleanup' mangled-name='_ZN17OffloadDescriptor7cleanupEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7cleanupEv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='find_ptr_data' mangled-name='_ZN17OffloadDescriptor13find_ptr_dataERP7PtrDataPvllbb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor13find_ptr_dataERP7PtrDataPvllbb'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-255'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-225'/>
          <parameter type-id='type-id-225'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='alloc_ptr_data' mangled-name='_ZN17OffloadDescriptor14alloc_ptr_dataERP7PtrDataPvlllibbb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor14alloc_ptr_dataERP7PtrDataPvlllibbb'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-255'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-225'/>
          <parameter type-id='type-id-225'/>
          <parameter type-id='type-id-225'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='create_preallocated_buffer' mangled-name='_ZN17OffloadDescriptor26create_preallocated_bufferEP7PtrDataPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-205'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_static_ptr_data' mangled-name='_ZN17OffloadDescriptor20init_static_ptr_dataEP7PtrData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20init_static_ptr_dataEP7PtrData'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-205'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_mic_address' mangled-name='_ZN17OffloadDescriptor16init_mic_addressEP7PtrData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor16init_mic_addressEP7PtrData'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-205'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='offload_stack_memory_manager' mangled-name='_ZN17OffloadDescriptor28offload_stack_memory_managerEPKviiiPb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor28offload_stack_memory_managerEPKviiiPb'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-256'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nullify_target_stack' mangled-name='_ZN17OffloadDescriptor20nullify_target_stackEP9coibufferm' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20nullify_target_stackEP9coibufferm'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-36'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='gen_var_descs_for_pointer_array' mangled-name='_ZN17OffloadDescriptor31gen_var_descs_for_pointer_arrayEi' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor31gen_var_descs_for_pointer_arrayEi'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_stream_in_dependencies' mangled-name='_ZN17OffloadDescriptor26get_stream_in_dependenciesERjRP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor26get_stream_in_dependenciesERjRP8coievent'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-257'/>
          <parameter type-id='type-id-258'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='report_coi_error' mangled-name='_ZN17OffloadDescriptor16report_coi_errorE11error_types9COIRESULT' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor16report_coi_errorE11error_types9COIRESULT'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-259'/>
          <parameter type-id='type-id-13'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='translate_coi_error' mangled-name='_ZNK17OffloadDescriptor19translate_coi_errorE9COIRESULT' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17OffloadDescriptor19translate_coi_errorE9COIRESULT'>
          <parameter type-id='type-id-253' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <return type-id='type-id-260'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_omp_async_info' mangled-name='_ZN17OffloadDescriptor20setup_omp_async_infoEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20setup_omp_async_infoEv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='register_omp_event_call_back' mangled-name='_ZN17OffloadDescriptor28register_omp_event_call_backEPK8coieventPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor28register_omp_event_call_backEPK8coieventPKv'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorD1Ev'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorC2EiP15_Offload_statusbbP20OffloadHostTimerData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorC2EiP15_Offload_statusbbP20OffloadHostTimerData'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-248'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-250'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorD1Ev'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='CeanReadRanges' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='58' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arr_desc' type-id='type-id-262' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ptr' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current_number' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='range_max_number' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='range_size' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_noncont_ind' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='init_offset' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='Dim' type-id='type-id-158' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Stream' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='326' column='1' id='type-id-263'>
      <member-type access='public'>
        <typedef-decl name='StreamMap' type-id='type-id-232' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='371' column='1' id='type-id-264'/>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='m_streams_count' type-id='type-id-56' mangled-name='_ZN6Stream15m_streams_countE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='373' column='1' elf-symbol-id='_ZN6Stream15m_streams_countE'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='all_streams' type-id='type-id-264' mangled-name='_ZN6Stream11all_streamsE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='374' column='1' elf-symbol-id='_ZN6Stream11all_streamsE'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='m_stream_lock' type-id='type-id-192' mangled-name='_ZN6Stream13m_stream_lockE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='375' column='1' elf-symbol-id='_ZN6Stream13m_stream_lockE'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_device' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_number_of_cpus' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_pipeline' type-id='type-id-34' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_last_offload' type-id='type-id-208' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_stream_cpus' type-id='type-id-196' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='389' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Stream' mangled-name='_ZN6StreamC4Eii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Stream12get_pipelineEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream12get_pipelineEv'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_device' mangled-name='_ZN6Stream10get_deviceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream10get_deviceEv'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <return type-id='type-id-25'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_cpu_number' mangled-name='_ZN6Stream14get_cpu_numberEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream14get_cpu_numberEv'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <return type-id='type-id-25'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_pipeline' mangled-name='_ZN6Stream12set_pipelineEP11coipipeline' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream12set_pipelineEP11coipipeline'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_last_offload' mangled-name='_ZN6Stream16get_last_offloadEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream16get_last_offloadEv'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <return type-id='type-id-208'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_last_offload' mangled-name='_ZN6Stream16set_last_offloadEP17OffloadDescriptor' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream16set_last_offloadEP17OffloadDescriptor'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <parameter type-id='type-id-208'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='find_stream' mangled-name='_ZN6Stream11find_streamEmb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream11find_streamEmb'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-265'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='add_stream' mangled-name='_ZN6Stream10add_streamEii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream10add_streamEii'>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-203'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamD2Ev'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamD2Ev'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Stream' mangled-name='_ZN6StreamC2Eii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamC2Eii'>
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='DynLibList' type-id='type-id-266' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='299' column='1' id='type-id-197'/>
    <typedef-decl name='pid_t' type-id='type-id-267' filepath='/usr/include/unistd.h' line='260' column='1' id='type-id-209'/>
    <typedef-decl name='__pid_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='133' column='1' id='type-id-267'/>
    <typedef-decl name='AutoSet' type-id='type-id-268' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='259' column='1' id='type-id-269'/>
    <class-decl name='PtrDataTable' size-in-bits='704' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='163' column='1' id='type-id-194'>
      <member-type access='private'>
        <typedef-decl name='PtrSet' type-id='type-id-271' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='165' column='1' id='type-id-270'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='type-id-270' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_ptr_lock' type-id='type-id-192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='204' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='find_ptr_data' mangled-name='_ZN12PtrDataTable13find_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable13find_ptr_dataEPKv'>
          <parameter type-id='type-id-272' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-205'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='insert_ptr_data' mangled-name='_ZN12PtrDataTable15insert_ptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable15insert_ptr_dataEPKvmRb'>
          <parameter type-id='type-id-272' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-206'/>
          <return type-id='type-id-205'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_ptr_data' mangled-name='_ZN12PtrDataTable15remove_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable15remove_ptr_dataEPKv'>
          <parameter type-id='type-id-272' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MemRange' size-in-bits='128' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='46' column='1' id='type-id-273'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_start' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='76' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_length' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='77' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-274' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-274' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='start' mangled-name='_ZNK8MemRange5startEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange5startEv'>
          <parameter type-id='type-id-275' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='end' mangled-name='_ZNK8MemRange3endEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange3endEv'>
          <parameter type-id='type-id-275' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='length' mangled-name='_ZNK8MemRange6lengthEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange6lengthEv'>
          <parameter type-id='type-id-275' is-artificial='yes'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='overlaps' mangled-name='_ZNK8MemRange8overlapsERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange8overlapsERKS_'>
          <parameter type-id='type-id-275' is-artificial='yes'/>
          <parameter type-id='type-id-276'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='contains' mangled-name='_ZNK8MemRange8containsERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange8containsERKS_'>
          <parameter type-id='type-id-275' is-artificial='yes'/>
          <parameter type-id='type-id-276'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8MemRangeC2EPKvm'>
          <parameter type-id='type-id-274' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8MemRangeC2EPKvm'>
          <parameter type-id='type-id-274' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OffloadHostTimerData' size-in-bits='4160' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='51' column='1' id='type-id-277'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='57' column='1' id='type-id-162'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='58' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='total' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='59' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='type-id-153' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='phases' type-id='type-id-163' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='sent_bytes' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='received_bytes' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='card_number' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='offload_number' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='target' type-id='type-id-278' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='next' type-id='type-id-250' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='VarDesc' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='254' column='1' id='type-id-279'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='256' column='1' id='type-id-280'>
          <member-type access='private'>
            <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='257' column='1' id='type-id-281'>
              <data-member access='public' layout-offset-in-bits='4'>
                <var-decl name='dst' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='258' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='src' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='259' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private'>
            <var-decl name='' type-id='type-id-281' visibility='default'/>
          </data-member>
          <data-member access='private'>
            <var-decl name='bits' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='261' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__1' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='265' column='1' id='type-id-282'>
          <member-type access='private'>
            <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='266' column='1' id='type-id-283'>
              <data-member access='public' layout-offset-in-bits='7'>
                <var-decl name='in' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='267' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='6'>
                <var-decl name='out' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='268' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private'>
            <var-decl name='' type-id='type-id-283' visibility='default'/>
          </data-member>
          <data-member access='private'>
            <var-decl name='bits' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='270' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='287' column='1' id='type-id-284'>
          <data-member access='private'>
            <var-decl name='count' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='291' column='1'/>
          </data-member>
          <data-member access='private'>
            <var-decl name='disp' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='293' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='298' column='1' id='type-id-285'>
          <data-member access='private'>
            <var-decl name='alloc' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='299' column='1'/>
          </data-member>
          <data-member access='private'>
            <var-decl name='ptr_arr_offset' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='300' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-280' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='direction' type-id='type-id-282' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='alloc_if' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='free_if' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='align' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mic_offset' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-286' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-225' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='type-id-285' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='into' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ptr' type-id='type-id-151' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='314' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='varDescFlags' size-in-bits='32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='217' column='1' id='type-id-286'>
      <member-type access='private'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='218' column='1' id='type-id-287'>
          <data-member access='public' layout-offset-in-bits='31'>
            <var-decl name='is_static' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='220' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='30'>
            <var-decl name='is_static_dstn' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='222' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='29'>
            <var-decl name='has_length' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='224' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='28'>
            <var-decl name='is_stack_buf' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='226' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='27'>
            <var-decl name='targetptr' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='228' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='26'>
            <var-decl name='preallocated' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='230' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='25'>
            <var-decl name='is_pointer' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='232' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='24'>
            <var-decl name='sink_addr' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='23'>
            <var-decl name='alloc_disp' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='237' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='22'>
            <var-decl name='is_noncont_src' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='239' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='21'>
            <var-decl name='is_noncont_dst' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='241' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='20'>
            <var-decl name='always_copy' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='244' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='19'>
            <var-decl name='always_delete' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='246' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='18'>
            <var-decl name='pin' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='248' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bits' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='250' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='_Offload_status' type-id='type-id-288' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='94' column='1' id='type-id-289'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-289' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='89' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='result' type-id='type-id-260' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_number' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_sent' type-id='type-id-290' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_received' type-id='type-id-290' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Offload_result' type-id='type-id-291' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='87' column='1' id='type-id-260'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' linkage-name='15_Offload_result' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='80' column='1' id='type-id-291'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='OFFLOAD_SUCCESS' value='0'/>
      <enumerator name='OFFLOAD_DISABLED' value='1'/>
      <enumerator name='OFFLOAD_UNAVAILABLE' value='2'/>
      <enumerator name='OFFLOAD_OUT_OF_MEMORY' value='3'/>
      <enumerator name='OFFLOAD_PROCESS_DIED' value='4'/>
      <enumerator name='OFFLOAD_ERROR' value='5'/>
    </enum-decl>
    <class-decl name='FunctionDescriptor' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='467' column='1' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='in_datalen' type-id='type-id-293' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='out_datalen' type-id='type-id-293' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='console_enabled' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='timer_enabled' type-id='type-id-20' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='offload_report_level' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offload_number' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='vars_num' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_offset' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data' type-id='type-id-168' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='495' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='OffloadTargetTimerData' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='43' column='1' id='type-id-278'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='45' column='1' id='type-id-165'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='46' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='total' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='47' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='frequency' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='phases' type-id='type-id-166' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='VarDesc2' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='318' column='1' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sname' type-id='type-id-153' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dname' type-id='type-id-153' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='320' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='OffloadFlags' size-in-bits='32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='160' column='1' id='type-id-252'>
      <member-type access='private'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='162' column='1' id='type-id-295'>
          <data-member access='public' layout-offset-in-bits='31'>
            <var-decl name='fortran_traceback' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='163' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='30'>
            <var-decl name='omp_async' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private'>
        <var-decl name='flags' type-id='type-id-17' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='161' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bits' type-id='type-id-295' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='165' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='error_types' type-id='type-id-296' filepath='../../../gcc/liboffloadmic/runtime/liboffload_error_codes.h' line='184' column='1' id='type-id-259'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' linkage-name='11error_types' filepath='../../../gcc/liboffloadmic/runtime/liboffload_error_codes.h' line='38' column='1' id='type-id-296'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='c_device_is_not_available' value='0'/>
      <enumerator name='c_invalid_device_number' value='1'/>
      <enumerator name='c_offload1' value='2'/>
      <enumerator name='c_unknown_var_type' value='3'/>
      <enumerator name='c_send_func_ptr' value='4'/>
      <enumerator name='c_receive_func_ptr' value='5'/>
      <enumerator name='c_malloc' value='6'/>
      <enumerator name='c_offload_malloc' value='7'/>
      <enumerator name='c_invalid_env_var_value' value='8'/>
      <enumerator name='c_invalid_env_var_int_value' value='9'/>
      <enumerator name='c_invalid_env_report_value' value='10'/>
      <enumerator name='c_offload_signaled1' value='11'/>
      <enumerator name='c_offload_signaled2' value='12'/>
      <enumerator name='c_myotarget_checkresult' value='13'/>
      <enumerator name='c_myowrapper_checkresult' value='14'/>
      <enumerator name='c_offload_descriptor_offload' value='15'/>
      <enumerator name='c_merge_var_descs1' value='16'/>
      <enumerator name='c_merge_var_descs2' value='17'/>
      <enumerator name='c_mic_parse_env_var_list1' value='18'/>
      <enumerator name='c_mic_parse_env_var_list2' value='19'/>
      <enumerator name='c_mic_process_exit_ret' value='20'/>
      <enumerator name='c_mic_process_exit_sig' value='21'/>
      <enumerator name='c_mic_process_exit' value='22'/>
      <enumerator name='c_mic_init3' value='23'/>
      <enumerator name='c_mic_init4' value='24'/>
      <enumerator name='c_mic_init5' value='25'/>
      <enumerator name='c_mic_init6' value='26'/>
      <enumerator name='c_no_static_var_data' value='27'/>
      <enumerator name='c_no_ptr_data' value='28'/>
      <enumerator name='c_get_engine_handle' value='29'/>
      <enumerator name='c_get_engine_index' value='30'/>
      <enumerator name='c_process_create' value='31'/>
      <enumerator name='c_process_set_cache_size' value='32'/>
      <enumerator name='c_process_get_func_handles' value='33'/>
      <enumerator name='c_process_wait_shutdown' value='34'/>
      <enumerator name='c_process_proxy_flush' value='35'/>
      <enumerator name='c_load_library' value='36'/>
      <enumerator name='c_pipeline_create' value='37'/>
      <enumerator name='c_pipeline_run_func' value='38'/>
      <enumerator name='c_pipeline_start_run_funcs' value='39'/>
      <enumerator name='c_buf_create' value='40'/>
      <enumerator name='c_buf_create_out_of_mem' value='41'/>
      <enumerator name='c_buf_create_from_mem' value='42'/>
      <enumerator name='c_buf_destroy' value='43'/>
      <enumerator name='c_buf_map' value='44'/>
      <enumerator name='c_buf_unmap' value='45'/>
      <enumerator name='c_buf_read' value='46'/>
      <enumerator name='c_buf_write' value='47'/>
      <enumerator name='c_buf_copy' value='48'/>
      <enumerator name='c_buf_get_address' value='49'/>
      <enumerator name='c_buf_add_ref' value='50'/>
      <enumerator name='c_buf_release_ref' value='51'/>
      <enumerator name='c_buf_set_state' value='52'/>
      <enumerator name='c_event_wait' value='53'/>
      <enumerator name='c_zero_or_neg_ptr_len' value='54'/>
      <enumerator name='c_zero_or_neg_transfer_size' value='55'/>
      <enumerator name='c_bad_ptr_mem_alloc' value='56'/>
      <enumerator name='c_bad_ptr_mem_range' value='57'/>
      <enumerator name='c_different_src_and_dstn_sizes' value='58'/>
      <enumerator name='c_ranges_dont_match' value='59'/>
      <enumerator name='c_destination_is_over' value='60'/>
      <enumerator name='c_slice_of_noncont_array' value='61'/>
      <enumerator name='c_non_contiguous_dope_vector' value='62'/>
      <enumerator name='c_pointer_array_mismatch' value='63'/>
      <enumerator name='c_omp_invalid_device_num_env' value='64'/>
      <enumerator name='c_omp_invalid_device_num' value='65'/>
      <enumerator name='c_unknown_binary_type' value='66'/>
      <enumerator name='c_multiple_target_exes' value='67'/>
      <enumerator name='c_no_target_exe' value='68'/>
      <enumerator name='c_incorrect_affinity' value='69'/>
      <enumerator name='c_cannot_set_affinity' value='70'/>
      <enumerator name='c_report_host' value='71'/>
      <enumerator name='c_report_target' value='72'/>
      <enumerator name='c_report_title' value='73'/>
      <enumerator name='c_report_from_file' value='74'/>
      <enumerator name='c_report_file' value='75'/>
      <enumerator name='c_report_line' value='76'/>
      <enumerator name='c_report_tag' value='77'/>
      <enumerator name='c_report_seconds' value='78'/>
      <enumerator name='c_report_bytes' value='79'/>
      <enumerator name='c_report_mic' value='80'/>
      <enumerator name='c_report_cpu_time' value='81'/>
      <enumerator name='c_report_cpu_to_mic_data' value='82'/>
      <enumerator name='c_report_mic_time' value='83'/>
      <enumerator name='c_report_mic_to_cpu_data' value='84'/>
      <enumerator name='c_report_unknown_timer_node' value='85'/>
      <enumerator name='c_report_unknown_trace_node' value='86'/>
      <enumerator name='c_report_offload' value='87'/>
      <enumerator name='c_report_w_tag' value='88'/>
      <enumerator name='c_report_state' value='89'/>
      <enumerator name='c_report_start' value='90'/>
      <enumerator name='c_report_init' value='91'/>
      <enumerator name='c_report_logical_card' value='92'/>
      <enumerator name='c_report_physical_card' value='93'/>
      <enumerator name='c_report_register' value='94'/>
      <enumerator name='c_report_init_func' value='95'/>
      <enumerator name='c_report_create_buf_host' value='96'/>
      <enumerator name='c_report_create_buf_mic' value='97'/>
      <enumerator name='c_report_send_pointer_data' value='98'/>
      <enumerator name='c_report_sent_pointer_data' value='99'/>
      <enumerator name='c_report_gather_copyin_data' value='100'/>
      <enumerator name='c_report_copyin_data' value='101'/>
      <enumerator name='c_report_state_signal' value='102'/>
      <enumerator name='c_report_signal' value='103'/>
      <enumerator name='c_report_wait' value='104'/>
      <enumerator name='c_report_compute' value='105'/>
      <enumerator name='c_report_receive_pointer_data' value='106'/>
      <enumerator name='c_report_received_pointer_data' value='107'/>
      <enumerator name='c_report_start_target_func' value='108'/>
      <enumerator name='c_report_var' value='109'/>
      <enumerator name='c_report_scatter_copyin_data' value='110'/>
      <enumerator name='c_report_gather_copyout_data' value='111'/>
      <enumerator name='c_report_scatter_copyout_data' value='112'/>
      <enumerator name='c_report_copyout_data' value='113'/>
      <enumerator name='c_report_unregister' value='114'/>
      <enumerator name='c_report_destroy' value='115'/>
      <enumerator name='c_report_myoinit' value='116'/>
      <enumerator name='c_report_myoregister' value='117'/>
      <enumerator name='c_report_myofini' value='118'/>
      <enumerator name='c_report_mic_myo_shared' value='119'/>
      <enumerator name='c_report_mic_myo_fptr' value='120'/>
      <enumerator name='c_report_myosharedmalloc' value='121'/>
      <enumerator name='c_report_myosharedfree' value='122'/>
      <enumerator name='c_report_myosharedalignedmalloc' value='123'/>
      <enumerator name='c_report_myosharedalignedfree' value='124'/>
      <enumerator name='c_report_myoacquire' value='125'/>
      <enumerator name='c_report_myorelease' value='126'/>
      <enumerator name='c_report_myosupportsfeature' value='127'/>
      <enumerator name='c_report_myosharedarenacreate' value='128'/>
      <enumerator name='c_report_myosharedalignedarenamalloc' value='129'/>
      <enumerator name='c_report_myosharedalignedarenafree' value='130'/>
      <enumerator name='c_report_myoarenaacquire' value='131'/>
      <enumerator name='c_report_myoarenarelease' value='132'/>
      <enumerator name='c_coipipe_max_number' value='133'/>
      <enumerator name='c_in_with_preallocated' value='134'/>
      <enumerator name='c_report_no_host_exe' value='135'/>
      <enumerator name='c_report_path_buff_overflow' value='136'/>
      <enumerator name='c_create_pipeline_for_stream' value='137'/>
      <enumerator name='c_offload_no_stream' value='138'/>
      <enumerator name='c_get_engine_info' value='139'/>
      <enumerator name='c_clear_cpu_mask' value='140'/>
      <enumerator name='c_set_cpu_mask' value='141'/>
      <enumerator name='c_report_state_stream' value='142'/>
      <enumerator name='c_report_stream' value='143'/>
      <enumerator name='c_unload_library' value='144'/>
    </enum-decl>
    <typedef-decl name='TARGET_TYPE' type-id='type-id-297' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='65' column='1' id='type-id-298'/>
    <enum-decl name='TARGET_TYPE' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='61' column='1' id='type-id-297'>
      <underlying-type type-id='type-id-14'/>
      <enumerator name='TARGET_NONE' value='0'/>
      <enumerator name='TARGET_HOST' value='1'/>
      <enumerator name='TARGET_MIC' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-262'/>
    <reference-type-def kind='lvalue' type-id='type-id-220' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-207'/>
    <reference-type-def kind='lvalue' type-id='type-id-269' size-in-bits='64' id='type-id-210'/>
    <reference-type-def kind='lvalue' type-id='type-id-60' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-236'/>
    <reference-type-def kind='lvalue' type-id='type-id-230' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-301' id='type-id-243'/>
    <reference-type-def kind='lvalue' type-id='type-id-186' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-250'/>
    <reference-type-def kind='lvalue' type-id='type-id-213' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-215'/>
    <reference-type-def kind='lvalue' type-id='type-id-216' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-205'/>
    <qualified-type-def type-id='type-id-205' const='yes' id='type-id-304'/>
    <reference-type-def kind='lvalue' type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-306'/>
    <reference-type-def kind='lvalue' type-id='type-id-205' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-272'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-265'/>
    <reference-type-def kind='lvalue' type-id='type-id-211' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-318'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-324'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <reference-type-def kind='lvalue' type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <reference-type-def kind='lvalue' type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <reference-type-def kind='lvalue' type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <reference-type-def kind='lvalue' type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <reference-type-def kind='lvalue' type-id='type-id-337' size-in-bits='64' id='type-id-338'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-340'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-344'/>
    <pointer-type-def type-id='type-id-345' size-in-bits='64' id='type-id-346'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-348'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-352'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-356'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-364'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-372'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-374'/>
    <reference-type-def kind='lvalue' type-id='type-id-150' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-256'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-375'/>
    <reference-type-def kind='lvalue' type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-377'/>
    <reference-type-def kind='lvalue' type-id='type-id-35' size-in-bits='64' id='type-id-378'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-379'/>
    <qualified-type-def type-id='type-id-220' const='yes' id='type-id-380'/>
    <reference-type-def kind='lvalue' type-id='type-id-380' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-221'/>
    <reference-type-def kind='lvalue' type-id='type-id-78' size-in-bits='64' id='type-id-200'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-381'/>
    <reference-type-def kind='lvalue' type-id='type-id-381' size-in-bits='64' id='type-id-382'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-383'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-384'/>
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-199'/>
    <qualified-type-def type-id='type-id-273' const='yes' id='type-id-217'/>
    <reference-type-def kind='lvalue' type-id='type-id-217' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-275'/>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-385'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-253'/>
    <qualified-type-def type-id='type-id-213' const='yes' id='type-id-386'/>
    <reference-type-def kind='lvalue' type-id='type-id-386' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-388'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-389'/>
    <reference-type-def kind='lvalue' type-id='type-id-389' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-219'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-390'/>
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-391'/>
    <qualified-type-def type-id='type-id-309' const='yes' id='type-id-392'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-393'/>
    <qualified-type-def type-id='type-id-311' const='yes' id='type-id-394'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-313' const='yes' id='type-id-396'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-397'/>
    <qualified-type-def type-id='type-id-315' const='yes' id='type-id-398'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-399'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-400'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <qualified-type-def type-id='type-id-319' const='yes' id='type-id-402'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-403'/>
    <qualified-type-def type-id='type-id-321' const='yes' id='type-id-404'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-405'/>
    <qualified-type-def type-id='type-id-323' const='yes' id='type-id-406'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-407'/>
    <qualified-type-def type-id='type-id-325' const='yes' id='type-id-408'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <qualified-type-def type-id='type-id-327' const='yes' id='type-id-410'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <qualified-type-def type-id='type-id-329' const='yes' id='type-id-412'/>
    <reference-type-def kind='lvalue' type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <qualified-type-def type-id='type-id-331' const='yes' id='type-id-414'/>
    <reference-type-def kind='lvalue' type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <qualified-type-def type-id='type-id-333' const='yes' id='type-id-416'/>
    <reference-type-def kind='lvalue' type-id='type-id-416' size-in-bits='64' id='type-id-417'/>
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-418'/>
    <reference-type-def kind='lvalue' type-id='type-id-418' size-in-bits='64' id='type-id-419'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-420'/>
    <reference-type-def kind='lvalue' type-id='type-id-420' size-in-bits='64' id='type-id-421'/>
    <qualified-type-def type-id='type-id-339' const='yes' id='type-id-422'/>
    <reference-type-def kind='lvalue' type-id='type-id-422' size-in-bits='64' id='type-id-423'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-424'/>
    <qualified-type-def type-id='type-id-341' const='yes' id='type-id-425'/>
    <reference-type-def kind='lvalue' type-id='type-id-425' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-427'/>
    <qualified-type-def type-id='type-id-343' const='yes' id='type-id-428'/>
    <reference-type-def kind='lvalue' type-id='type-id-428' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-430'/>
    <qualified-type-def type-id='type-id-345' const='yes' id='type-id-431'/>
    <reference-type-def kind='lvalue' type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-433'/>
    <qualified-type-def type-id='type-id-347' const='yes' id='type-id-434'/>
    <reference-type-def kind='lvalue' type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-436'/>
    <qualified-type-def type-id='type-id-349' const='yes' id='type-id-437'/>
    <reference-type-def kind='lvalue' type-id='type-id-437' size-in-bits='64' id='type-id-438'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-439'/>
    <qualified-type-def type-id='type-id-351' const='yes' id='type-id-440'/>
    <reference-type-def kind='lvalue' type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-443'/>
    <reference-type-def kind='lvalue' type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-445'/>
    <qualified-type-def type-id='type-id-355' const='yes' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-448'/>
    <qualified-type-def type-id='type-id-357' const='yes' id='type-id-449'/>
    <reference-type-def kind='lvalue' type-id='type-id-449' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-451'/>
    <qualified-type-def type-id='type-id-359' const='yes' id='type-id-452'/>
    <reference-type-def kind='lvalue' type-id='type-id-452' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-454'/>
    <qualified-type-def type-id='type-id-361' const='yes' id='type-id-455'/>
    <reference-type-def kind='lvalue' type-id='type-id-455' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-457'/>
    <qualified-type-def type-id='type-id-363' const='yes' id='type-id-458'/>
    <reference-type-def kind='lvalue' type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-460'/>
    <qualified-type-def type-id='type-id-365' const='yes' id='type-id-461'/>
    <reference-type-def kind='lvalue' type-id='type-id-461' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-463'/>
    <qualified-type-def type-id='type-id-367' const='yes' id='type-id-464'/>
    <reference-type-def kind='lvalue' type-id='type-id-464' size-in-bits='64' id='type-id-465'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' id='type-id-466'/>
    <qualified-type-def type-id='type-id-369' const='yes' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-469'/>
    <qualified-type-def type-id='type-id-371' const='yes' id='type-id-470'/>
    <reference-type-def kind='lvalue' type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-472'/>
    <qualified-type-def type-id='type-id-373' const='yes' id='type-id-473'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-475'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-476'/>
    <qualified-type-def type-id='type-id-477' const='yes' id='type-id-478'/>
    <reference-type-def kind='lvalue' type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-480'/>
    <qualified-type-def type-id='type-id-481' const='yes' id='type-id-482'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <qualified-type-def type-id='type-id-484' const='yes' id='type-id-485'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-487' const='yes' id='type-id-488'/>
    <reference-type-def kind='lvalue' type-id='type-id-488' size-in-bits='64' id='type-id-489'/>
    <qualified-type-def type-id='type-id-490' const='yes' id='type-id-491'/>
    <reference-type-def kind='lvalue' type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-493'/>
    <qualified-type-def type-id='type-id-494' const='yes' id='type-id-495'/>
    <reference-type-def kind='lvalue' type-id='type-id-495' size-in-bits='64' id='type-id-496'/>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' id='type-id-497'/>
    <qualified-type-def type-id='type-id-498' const='yes' id='type-id-499'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-501'/>
    <qualified-type-def type-id='type-id-502' const='yes' id='type-id-503'/>
    <reference-type-def kind='lvalue' type-id='type-id-503' size-in-bits='64' id='type-id-504'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-505'/>
    <qualified-type-def type-id='type-id-506' const='yes' id='type-id-507'/>
    <reference-type-def kind='lvalue' type-id='type-id-507' size-in-bits='64' id='type-id-508'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-509'/>
    <qualified-type-def type-id='type-id-510' const='yes' id='type-id-511'/>
    <pointer-type-def type-id='type-id-511' size-in-bits='64' id='type-id-512'/>
    <qualified-type-def type-id='type-id-513' const='yes' id='type-id-514'/>
    <reference-type-def kind='lvalue' type-id='type-id-514' size-in-bits='64' id='type-id-515'/>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-516'/>
    <qualified-type-def type-id='type-id-517' const='yes' id='type-id-518'/>
    <reference-type-def kind='lvalue' type-id='type-id-518' size-in-bits='64' id='type-id-519'/>
    <qualified-type-def type-id='type-id-520' const='yes' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' id='type-id-522'/>
    <qualified-type-def type-id='type-id-523' const='yes' id='type-id-524'/>
    <reference-type-def kind='lvalue' type-id='type-id-524' size-in-bits='64' id='type-id-525'/>
    <qualified-type-def type-id='type-id-526' const='yes' id='type-id-527'/>
    <reference-type-def kind='lvalue' type-id='type-id-527' size-in-bits='64' id='type-id-528'/>
    <qualified-type-def type-id='type-id-529' const='yes' id='type-id-530'/>
    <reference-type-def kind='lvalue' type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-533' const='yes' id='type-id-534'/>
    <reference-type-def kind='lvalue' type-id='type-id-534' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-536' const='yes' id='type-id-537'/>
    <reference-type-def kind='lvalue' type-id='type-id-537' size-in-bits='64' id='type-id-538'/>
    <qualified-type-def type-id='type-id-539' const='yes' id='type-id-540'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-542' const='yes' id='type-id-543'/>
    <reference-type-def kind='lvalue' type-id='type-id-543' size-in-bits='64' id='type-id-544'/>
    <qualified-type-def type-id='type-id-545' const='yes' id='type-id-546'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-548'/>
    <qualified-type-def type-id='type-id-549' const='yes' id='type-id-550'/>
    <reference-type-def kind='lvalue' type-id='type-id-550' size-in-bits='64' id='type-id-551'/>
    <qualified-type-def type-id='type-id-552' const='yes' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-558' const='yes' id='type-id-559'/>
    <reference-type-def kind='lvalue' type-id='type-id-559' size-in-bits='64' id='type-id-560'/>
    <qualified-type-def type-id='type-id-561' const='yes' id='type-id-562'/>
    <reference-type-def kind='lvalue' type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' id='type-id-564'/>
    <qualified-type-def type-id='type-id-565' const='yes' id='type-id-566'/>
    <reference-type-def kind='lvalue' type-id='type-id-566' size-in-bits='64' id='type-id-567'/>
    <qualified-type-def type-id='type-id-568' const='yes' id='type-id-569'/>
    <reference-type-def kind='lvalue' type-id='type-id-569' size-in-bits='64' id='type-id-570'/>
    <qualified-type-def type-id='type-id-571' const='yes' id='type-id-572'/>
    <reference-type-def kind='lvalue' type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <qualified-type-def type-id='type-id-574' const='yes' id='type-id-575'/>
    <reference-type-def kind='lvalue' type-id='type-id-575' size-in-bits='64' id='type-id-576'/>
    <qualified-type-def type-id='type-id-577' const='yes' id='type-id-578'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-580' const='yes' id='type-id-581'/>
    <reference-type-def kind='lvalue' type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-584'/>
    <reference-type-def kind='lvalue' type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-586' const='yes' id='type-id-587'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' id='type-id-588'/>
    <qualified-type-def type-id='type-id-589' const='yes' id='type-id-590'/>
    <reference-type-def kind='lvalue' type-id='type-id-590' size-in-bits='64' id='type-id-591'/>
    <qualified-type-def type-id='type-id-592' const='yes' id='type-id-593'/>
    <reference-type-def kind='lvalue' type-id='type-id-593' size-in-bits='64' id='type-id-594'/>
    <qualified-type-def type-id='type-id-595' const='yes' id='type-id-596'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-597'/>
    <qualified-type-def type-id='type-id-598' const='yes' id='type-id-599'/>
    <reference-type-def kind='lvalue' type-id='type-id-599' size-in-bits='64' id='type-id-600'/>
    <qualified-type-def type-id='type-id-601' const='yes' id='type-id-602'/>
    <reference-type-def kind='lvalue' type-id='type-id-602' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-604' const='yes' id='type-id-605'/>
    <pointer-type-def type-id='type-id-605' size-in-bits='64' id='type-id-606'/>
    <qualified-type-def type-id='type-id-607' const='yes' id='type-id-608'/>
    <reference-type-def kind='lvalue' type-id='type-id-608' size-in-bits='64' id='type-id-609'/>
    <qualified-type-def type-id='type-id-610' const='yes' id='type-id-611'/>
    <reference-type-def kind='lvalue' type-id='type-id-611' size-in-bits='64' id='type-id-612'/>
    <qualified-type-def type-id='type-id-613' const='yes' id='type-id-614'/>
    <pointer-type-def type-id='type-id-614' size-in-bits='64' id='type-id-615'/>
    <qualified-type-def type-id='type-id-616' const='yes' id='type-id-617'/>
    <reference-type-def kind='lvalue' type-id='type-id-617' size-in-bits='64' id='type-id-618'/>
    <qualified-type-def type-id='type-id-619' const='yes' id='type-id-620'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' id='type-id-621'/>
    <qualified-type-def type-id='type-id-622' const='yes' id='type-id-623'/>
    <reference-type-def kind='lvalue' type-id='type-id-623' size-in-bits='64' id='type-id-624'/>
    <qualified-type-def type-id='type-id-625' const='yes' id='type-id-626'/>
    <pointer-type-def type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <qualified-type-def type-id='type-id-628' const='yes' id='type-id-629'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' id='type-id-630'/>
    <qualified-type-def type-id='type-id-631' const='yes' id='type-id-632'/>
    <pointer-type-def type-id='type-id-632' size-in-bits='64' id='type-id-633'/>
    <qualified-type-def type-id='type-id-634' const='yes' id='type-id-635'/>
    <reference-type-def kind='lvalue' type-id='type-id-635' size-in-bits='64' id='type-id-636'/>
    <qualified-type-def type-id='type-id-637' const='yes' id='type-id-638'/>
    <reference-type-def kind='lvalue' type-id='type-id-638' size-in-bits='64' id='type-id-639'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' id='type-id-640'/>
    <qualified-type-def type-id='type-id-641' const='yes' id='type-id-642'/>
    <reference-type-def kind='lvalue' type-id='type-id-642' size-in-bits='64' id='type-id-643'/>
    <pointer-type-def type-id='type-id-642' size-in-bits='64' id='type-id-644'/>
    <qualified-type-def type-id='type-id-645' const='yes' id='type-id-646'/>
    <reference-type-def kind='lvalue' type-id='type-id-646' size-in-bits='64' id='type-id-647'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-648'/>
    <qualified-type-def type-id='type-id-649' const='yes' id='type-id-650'/>
    <reference-type-def kind='lvalue' type-id='type-id-650' size-in-bits='64' id='type-id-651'/>
    <pointer-type-def type-id='type-id-650' size-in-bits='64' id='type-id-652'/>
    <qualified-type-def type-id='type-id-653' const='yes' id='type-id-654'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-655'/>
    <qualified-type-def type-id='type-id-656' const='yes' id='type-id-657'/>
    <pointer-type-def type-id='type-id-657' size-in-bits='64' id='type-id-658'/>
    <qualified-type-def type-id='type-id-659' const='yes' id='type-id-660'/>
    <reference-type-def kind='lvalue' type-id='type-id-660' size-in-bits='64' id='type-id-661'/>
    <qualified-type-def type-id='type-id-662' const='yes' id='type-id-663'/>
    <pointer-type-def type-id='type-id-663' size-in-bits='64' id='type-id-664'/>
    <qualified-type-def type-id='type-id-665' const='yes' id='type-id-666'/>
    <reference-type-def kind='lvalue' type-id='type-id-666' size-in-bits='64' id='type-id-667'/>
    <qualified-type-def type-id='type-id-668' const='yes' id='type-id-669'/>
    <pointer-type-def type-id='type-id-669' size-in-bits='64' id='type-id-670'/>
    <qualified-type-def type-id='type-id-671' const='yes' id='type-id-672'/>
    <reference-type-def kind='lvalue' type-id='type-id-672' size-in-bits='64' id='type-id-673'/>
    <qualified-type-def type-id='type-id-674' const='yes' id='type-id-675'/>
    <pointer-type-def type-id='type-id-675' size-in-bits='64' id='type-id-676'/>
    <qualified-type-def type-id='type-id-677' const='yes' id='type-id-678'/>
    <reference-type-def kind='lvalue' type-id='type-id-678' size-in-bits='64' id='type-id-679'/>
    <qualified-type-def type-id='type-id-680' const='yes' id='type-id-681'/>
    <pointer-type-def type-id='type-id-681' size-in-bits='64' id='type-id-682'/>
    <qualified-type-def type-id='type-id-683' const='yes' id='type-id-684'/>
    <reference-type-def kind='lvalue' type-id='type-id-684' size-in-bits='64' id='type-id-685'/>
    <qualified-type-def type-id='type-id-266' const='yes' id='type-id-686'/>
    <reference-type-def kind='lvalue' type-id='type-id-686' size-in-bits='64' id='type-id-687'/>
    <pointer-type-def type-id='type-id-686' size-in-bits='64' id='type-id-688'/>
    <qualified-type-def type-id='type-id-689' const='yes' id='type-id-690'/>
    <reference-type-def kind='lvalue' type-id='type-id-690' size-in-bits='64' id='type-id-691'/>
    <qualified-type-def type-id='type-id-692' const='yes' id='type-id-693'/>
    <reference-type-def kind='lvalue' type-id='type-id-693' size-in-bits='64' id='type-id-694'/>
    <qualified-type-def type-id='type-id-228' const='yes' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-695' size-in-bits='64' id='type-id-696'/>
    <pointer-type-def type-id='type-id-695' size-in-bits='64' id='type-id-697'/>
    <qualified-type-def type-id='type-id-698' const='yes' id='type-id-699'/>
    <reference-type-def kind='lvalue' type-id='type-id-699' size-in-bits='64' id='type-id-700'/>
    <qualified-type-def type-id='type-id-701' const='yes' id='type-id-702'/>
    <reference-type-def kind='lvalue' type-id='type-id-702' size-in-bits='64' id='type-id-703'/>
    <qualified-type-def type-id='type-id-226' const='yes' id='type-id-704'/>
    <reference-type-def kind='lvalue' type-id='type-id-704' size-in-bits='64' id='type-id-705'/>
    <pointer-type-def type-id='type-id-704' size-in-bits='64' id='type-id-706'/>
    <qualified-type-def type-id='type-id-707' const='yes' id='type-id-708'/>
    <reference-type-def kind='lvalue' type-id='type-id-708' size-in-bits='64' id='type-id-709'/>
    <qualified-type-def type-id='type-id-710' const='yes' id='type-id-711'/>
    <reference-type-def kind='lvalue' type-id='type-id-711' size-in-bits='64' id='type-id-712'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-713'/>
    <reference-type-def kind='lvalue' type-id='type-id-713' size-in-bits='64' id='type-id-714'/>
    <pointer-type-def type-id='type-id-713' size-in-bits='64' id='type-id-715'/>
    <qualified-type-def type-id='type-id-716' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-717' size-in-bits='64' id='type-id-718'/>
    <qualified-type-def type-id='type-id-719' const='yes' id='type-id-720'/>
    <reference-type-def kind='lvalue' type-id='type-id-720' size-in-bits='64' id='type-id-721'/>
    <qualified-type-def type-id='type-id-242' const='yes' id='type-id-722'/>
    <reference-type-def kind='lvalue' type-id='type-id-722' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-722' size-in-bits='64' id='type-id-723'/>
    <qualified-type-def type-id='type-id-724' const='yes' id='type-id-725'/>
    <reference-type-def kind='lvalue' type-id='type-id-725' size-in-bits='64' id='type-id-726'/>
    <qualified-type-def type-id='type-id-727' const='yes' id='type-id-728'/>
    <reference-type-def kind='lvalue' type-id='type-id-728' size-in-bits='64' id='type-id-729'/>
    <qualified-type-def type-id='type-id-730' const='yes' id='type-id-731'/>
    <pointer-type-def type-id='type-id-731' size-in-bits='64' id='type-id-732'/>
    <qualified-type-def type-id='type-id-733' const='yes' id='type-id-734'/>
    <reference-type-def kind='lvalue' type-id='type-id-734' size-in-bits='64' id='type-id-735'/>
    <qualified-type-def type-id='type-id-736' const='yes' id='type-id-737'/>
    <reference-type-def kind='lvalue' type-id='type-id-737' size-in-bits='64' id='type-id-738'/>
    <qualified-type-def type-id='type-id-739' const='yes' id='type-id-740'/>
    <reference-type-def kind='lvalue' type-id='type-id-740' size-in-bits='64' id='type-id-741'/>
    <qualified-type-def type-id='type-id-742' const='yes' id='type-id-743'/>
    <reference-type-def kind='lvalue' type-id='type-id-743' size-in-bits='64' id='type-id-744'/>
    <qualified-type-def type-id='type-id-745' const='yes' id='type-id-746'/>
    <reference-type-def kind='lvalue' type-id='type-id-746' size-in-bits='64' id='type-id-747'/>
    <qualified-type-def type-id='type-id-748' const='yes' id='type-id-749'/>
    <reference-type-def kind='lvalue' type-id='type-id-749' size-in-bits='64' id='type-id-750'/>
    <qualified-type-def type-id='type-id-751' const='yes' id='type-id-752'/>
    <reference-type-def kind='lvalue' type-id='type-id-752' size-in-bits='64' id='type-id-753'/>
    <qualified-type-def type-id='type-id-754' const='yes' id='type-id-755'/>
    <reference-type-def kind='lvalue' type-id='type-id-755' size-in-bits='64' id='type-id-756'/>
    <qualified-type-def type-id='type-id-757' const='yes' id='type-id-758'/>
    <reference-type-def kind='lvalue' type-id='type-id-758' size-in-bits='64' id='type-id-759'/>
    <qualified-type-def type-id='type-id-760' const='yes' id='type-id-761'/>
    <reference-type-def kind='lvalue' type-id='type-id-761' size-in-bits='64' id='type-id-762'/>
    <qualified-type-def type-id='type-id-763' const='yes' id='type-id-764'/>
    <reference-type-def kind='lvalue' type-id='type-id-764' size-in-bits='64' id='type-id-765'/>
    <qualified-type-def type-id='type-id-766' const='yes' id='type-id-767'/>
    <reference-type-def kind='lvalue' type-id='type-id-767' size-in-bits='64' id='type-id-768'/>
    <qualified-type-def type-id='type-id-769' const='yes' id='type-id-770'/>
    <reference-type-def kind='lvalue' type-id='type-id-770' size-in-bits='64' id='type-id-771'/>
    <qualified-type-def type-id='type-id-772' const='yes' id='type-id-773'/>
    <reference-type-def kind='lvalue' type-id='type-id-773' size-in-bits='64' id='type-id-774'/>
    <qualified-type-def type-id='type-id-775' const='yes' id='type-id-776'/>
    <reference-type-def kind='lvalue' type-id='type-id-776' size-in-bits='64' id='type-id-777'/>
    <qualified-type-def type-id='type-id-778' const='yes' id='type-id-779'/>
    <reference-type-def kind='lvalue' type-id='type-id-779' size-in-bits='64' id='type-id-780'/>
    <qualified-type-def type-id='type-id-781' const='yes' id='type-id-782'/>
    <reference-type-def kind='lvalue' type-id='type-id-782' size-in-bits='64' id='type-id-783'/>
    <qualified-type-def type-id='type-id-784' const='yes' id='type-id-785'/>
    <reference-type-def kind='lvalue' type-id='type-id-785' size-in-bits='64' id='type-id-786'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-787'/>
    <reference-type-def kind='lvalue' type-id='type-id-787' size-in-bits='64' id='type-id-788'/>
    <pointer-type-def type-id='type-id-787' size-in-bits='64' id='type-id-789'/>
    <qualified-type-def type-id='type-id-790' const='yes' id='type-id-791'/>
    <pointer-type-def type-id='type-id-791' size-in-bits='64' id='type-id-792'/>
    <qualified-type-def type-id='type-id-793' const='yes' id='type-id-794'/>
    <pointer-type-def type-id='type-id-794' size-in-bits='64' id='type-id-795'/>
    <qualified-type-def type-id='type-id-796' const='yes' id='type-id-797'/>
    <pointer-type-def type-id='type-id-797' size-in-bits='64' id='type-id-798'/>
    <qualified-type-def type-id='type-id-799' const='yes' id='type-id-800'/>
    <reference-type-def kind='lvalue' type-id='type-id-800' size-in-bits='64' id='type-id-801'/>
    <pointer-type-def type-id='type-id-800' size-in-bits='64' id='type-id-802'/>
    <qualified-type-def type-id='type-id-803' const='yes' id='type-id-804'/>
    <reference-type-def kind='lvalue' type-id='type-id-804' size-in-bits='64' id='type-id-805'/>
    <pointer-type-def type-id='type-id-804' size-in-bits='64' id='type-id-806'/>
    <qualified-type-def type-id='type-id-807' const='yes' id='type-id-808'/>
    <reference-type-def kind='lvalue' type-id='type-id-808' size-in-bits='64' id='type-id-809'/>
    <pointer-type-def type-id='type-id-808' size-in-bits='64' id='type-id-810'/>
    <qualified-type-def type-id='type-id-811' const='yes' id='type-id-812'/>
    <reference-type-def kind='lvalue' type-id='type-id-812' size-in-bits='64' id='type-id-813'/>
    <pointer-type-def type-id='type-id-812' size-in-bits='64' id='type-id-814'/>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-815'/>
    <reference-type-def kind='lvalue' type-id='type-id-815' size-in-bits='64' id='type-id-816'/>
    <pointer-type-def type-id='type-id-815' size-in-bits='64' id='type-id-817'/>
    <qualified-type-def type-id='type-id-818' const='yes' id='type-id-819'/>
    <reference-type-def kind='lvalue' type-id='type-id-819' size-in-bits='64' id='type-id-820'/>
    <qualified-type-def type-id='type-id-821' const='yes' id='type-id-822'/>
    <reference-type-def kind='lvalue' type-id='type-id-822' size-in-bits='64' id='type-id-823'/>
    <qualified-type-def type-id='type-id-824' const='yes' id='type-id-825'/>
    <reference-type-def kind='lvalue' type-id='type-id-825' size-in-bits='64' id='type-id-826'/>
    <qualified-type-def type-id='type-id-827' const='yes' id='type-id-828'/>
    <reference-type-def kind='lvalue' type-id='type-id-828' size-in-bits='64' id='type-id-829'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-830'/>
    <reference-type-def kind='lvalue' type-id='type-id-830' size-in-bits='64' id='type-id-831'/>
    <pointer-type-def type-id='type-id-830' size-in-bits='64' id='type-id-832'/>
    <qualified-type-def type-id='type-id-833' const='yes' id='type-id-834'/>
    <reference-type-def kind='lvalue' type-id='type-id-834' size-in-bits='64' id='type-id-835'/>
    <qualified-type-def type-id='type-id-836' const='yes' id='type-id-837'/>
    <reference-type-def kind='lvalue' type-id='type-id-837' size-in-bits='64' id='type-id-838'/>
    <qualified-type-def type-id='type-id-839' const='yes' id='type-id-840'/>
    <reference-type-def kind='lvalue' type-id='type-id-840' size-in-bits='64' id='type-id-841'/>
    <qualified-type-def type-id='type-id-842' const='yes' id='type-id-843'/>
    <reference-type-def kind='lvalue' type-id='type-id-843' size-in-bits='64' id='type-id-844'/>
    <qualified-type-def type-id='type-id-845' const='yes' id='type-id-846'/>
    <reference-type-def kind='lvalue' type-id='type-id-846' size-in-bits='64' id='type-id-847'/>
    <pointer-type-def type-id='type-id-846' size-in-bits='64' id='type-id-848'/>
    <qualified-type-def type-id='type-id-849' const='yes' id='type-id-850'/>
    <reference-type-def kind='lvalue' type-id='type-id-850' size-in-bits='64' id='type-id-851'/>
    <qualified-type-def type-id='type-id-852' const='yes' id='type-id-853'/>
    <reference-type-def kind='lvalue' type-id='type-id-853' size-in-bits='64' id='type-id-854'/>
    <qualified-type-def type-id='type-id-855' const='yes' id='type-id-856'/>
    <reference-type-def kind='lvalue' type-id='type-id-856' size-in-bits='64' id='type-id-857'/>
    <qualified-type-def type-id='type-id-858' const='yes' id='type-id-859'/>
    <reference-type-def kind='lvalue' type-id='type-id-859' size-in-bits='64' id='type-id-860'/>
    <qualified-type-def type-id='type-id-861' const='yes' id='type-id-862'/>
    <reference-type-def kind='lvalue' type-id='type-id-862' size-in-bits='64' id='type-id-863'/>
    <qualified-type-def type-id='type-id-864' const='yes' id='type-id-865'/>
    <reference-type-def kind='lvalue' type-id='type-id-865' size-in-bits='64' id='type-id-866'/>
    <pointer-type-def type-id='type-id-865' size-in-bits='64' id='type-id-867'/>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-868'/>
    <reference-type-def kind='lvalue' type-id='type-id-868' size-in-bits='64' id='type-id-869'/>
    <pointer-type-def type-id='type-id-868' size-in-bits='64' id='type-id-870'/>
    <qualified-type-def type-id='type-id-871' const='yes' id='type-id-872'/>
    <reference-type-def kind='lvalue' type-id='type-id-872' size-in-bits='64' id='type-id-873'/>
    <qualified-type-def type-id='type-id-874' const='yes' id='type-id-875'/>
    <reference-type-def kind='lvalue' type-id='type-id-875' size-in-bits='64' id='type-id-876'/>
    <qualified-type-def type-id='type-id-877' const='yes' id='type-id-878'/>
    <reference-type-def kind='lvalue' type-id='type-id-878' size-in-bits='64' id='type-id-879'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-880'/>
    <reference-type-def kind='lvalue' type-id='type-id-880' size-in-bits='64' id='type-id-881'/>
    <pointer-type-def type-id='type-id-880' size-in-bits='64' id='type-id-882'/>
    <qualified-type-def type-id='type-id-883' const='yes' id='type-id-884'/>
    <reference-type-def kind='lvalue' type-id='type-id-884' size-in-bits='64' id='type-id-885'/>
    <qualified-type-def type-id='type-id-886' const='yes' id='type-id-887'/>
    <reference-type-def kind='lvalue' type-id='type-id-887' size-in-bits='64' id='type-id-888'/>
    <qualified-type-def type-id='type-id-889' const='yes' id='type-id-890'/>
    <reference-type-def kind='lvalue' type-id='type-id-890' size-in-bits='64' id='type-id-891'/>
    <reference-type-def kind='lvalue' type-id='type-id-892' size-in-bits='64' id='type-id-893'/>
    <pointer-type-def type-id='type-id-892' size-in-bits='64' id='type-id-894'/>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-895'/>
    <reference-type-def kind='lvalue' type-id='type-id-481' size-in-bits='64' id='type-id-896'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' id='type-id-897'/>
    <reference-type-def kind='lvalue' type-id='type-id-487' size-in-bits='64' id='type-id-898'/>
    <reference-type-def kind='lvalue' type-id='type-id-490' size-in-bits='64' id='type-id-899'/>
    <pointer-type-def type-id='type-id-490' size-in-bits='64' id='type-id-900'/>
    <reference-type-def kind='lvalue' type-id='type-id-494' size-in-bits='64' id='type-id-901'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-902'/>
    <reference-type-def kind='lvalue' type-id='type-id-498' size-in-bits='64' id='type-id-903'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-904'/>
    <reference-type-def kind='lvalue' type-id='type-id-502' size-in-bits='64' id='type-id-905'/>
    <pointer-type-def type-id='type-id-502' size-in-bits='64' id='type-id-906'/>
    <reference-type-def kind='lvalue' type-id='type-id-506' size-in-bits='64' id='type-id-907'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-908'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' id='type-id-909'/>
    <reference-type-def kind='lvalue' type-id='type-id-513' size-in-bits='64' id='type-id-910'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' id='type-id-911'/>
    <reference-type-def kind='lvalue' type-id='type-id-912' size-in-bits='64' id='type-id-913'/>
    <reference-type-def kind='lvalue' type-id='type-id-517' size-in-bits='64' id='type-id-914'/>
    <pointer-type-def type-id='type-id-915' size-in-bits='64' id='type-id-916'/>
    <reference-type-def kind='lvalue' type-id='type-id-529' size-in-bits='64' id='type-id-917'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-918'/>
    <reference-type-def kind='lvalue' type-id='type-id-919' size-in-bits='64' id='type-id-920'/>
    <reference-type-def kind='lvalue' type-id='type-id-533' size-in-bits='64' id='type-id-921'/>
    <pointer-type-def type-id='type-id-922' size-in-bits='64' id='type-id-923'/>
    <reference-type-def kind='lvalue' type-id='type-id-545' size-in-bits='64' id='type-id-924'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-925'/>
    <reference-type-def kind='lvalue' type-id='type-id-926' size-in-bits='64' id='type-id-927'/>
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' id='type-id-928'/>
    <pointer-type-def type-id='type-id-929' size-in-bits='64' id='type-id-930'/>
    <reference-type-def kind='lvalue' type-id='type-id-561' size-in-bits='64' id='type-id-931'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-932'/>
    <reference-type-def kind='lvalue' type-id='type-id-933' size-in-bits='64' id='type-id-934'/>
    <reference-type-def kind='lvalue' type-id='type-id-565' size-in-bits='64' id='type-id-935'/>
    <pointer-type-def type-id='type-id-936' size-in-bits='64' id='type-id-937'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' id='type-id-938'/>
    <reference-type-def kind='lvalue' type-id='type-id-580' size-in-bits='64' id='type-id-939'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-940'/>
    <reference-type-def kind='lvalue' type-id='type-id-589' size-in-bits='64' id='type-id-941'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' id='type-id-942'/>
    <reference-type-def kind='lvalue' type-id='type-id-598' size-in-bits='64' id='type-id-943'/>
    <pointer-type-def type-id='type-id-604' size-in-bits='64' id='type-id-944'/>
    <reference-type-def kind='lvalue' type-id='type-id-607' size-in-bits='64' id='type-id-945'/>
    <pointer-type-def type-id='type-id-613' size-in-bits='64' id='type-id-946'/>
    <reference-type-def kind='lvalue' type-id='type-id-616' size-in-bits='64' id='type-id-947'/>
    <pointer-type-def type-id='type-id-619' size-in-bits='64' id='type-id-948'/>
    <reference-type-def kind='lvalue' type-id='type-id-622' size-in-bits='64' id='type-id-949'/>
    <pointer-type-def type-id='type-id-625' size-in-bits='64' id='type-id-950'/>
    <reference-type-def kind='lvalue' type-id='type-id-628' size-in-bits='64' id='type-id-951'/>
    <pointer-type-def type-id='type-id-631' size-in-bits='64' id='type-id-952'/>
    <reference-type-def kind='lvalue' type-id='type-id-634' size-in-bits='64' id='type-id-953'/>
    <reference-type-def kind='lvalue' type-id='type-id-637' size-in-bits='64' id='type-id-954'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' id='type-id-955'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-956'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-957'/>
    <reference-type-def kind='lvalue' type-id='type-id-645' size-in-bits='64' id='type-id-958'/>
    <pointer-type-def type-id='type-id-645' size-in-bits='64' id='type-id-959'/>
    <reference-type-def kind='lvalue' type-id='type-id-649' size-in-bits='64' id='type-id-960'/>
    <pointer-type-def type-id='type-id-649' size-in-bits='64' id='type-id-961'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-962'/>
    <reference-type-def kind='lvalue' type-id='type-id-656' size-in-bits='64' id='type-id-963'/>
    <pointer-type-def type-id='type-id-656' size-in-bits='64' id='type-id-964'/>
    <pointer-type-def type-id='type-id-965' size-in-bits='64' id='type-id-966'/>
    <reference-type-def kind='lvalue' type-id='type-id-659' size-in-bits='64' id='type-id-967'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-968'/>
    <pointer-type-def type-id='type-id-662' size-in-bits='64' id='type-id-969'/>
    <pointer-type-def type-id='type-id-970' size-in-bits='64' id='type-id-971'/>
    <reference-type-def kind='lvalue' type-id='type-id-665' size-in-bits='64' id='type-id-972'/>
    <reference-type-def kind='lvalue' type-id='type-id-668' size-in-bits='64' id='type-id-973'/>
    <pointer-type-def type-id='type-id-668' size-in-bits='64' id='type-id-974'/>
    <pointer-type-def type-id='type-id-975' size-in-bits='64' id='type-id-976'/>
    <reference-type-def kind='lvalue' type-id='type-id-671' size-in-bits='64' id='type-id-977'/>
    <reference-type-def kind='lvalue' type-id='type-id-674' size-in-bits='64' id='type-id-978'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' id='type-id-979'/>
    <pointer-type-def type-id='type-id-980' size-in-bits='64' id='type-id-981'/>
    <reference-type-def kind='lvalue' type-id='type-id-677' size-in-bits='64' id='type-id-982'/>
    <reference-type-def kind='lvalue' type-id='type-id-680' size-in-bits='64' id='type-id-983'/>
    <pointer-type-def type-id='type-id-680' size-in-bits='64' id='type-id-984'/>
    <pointer-type-def type-id='type-id-985' size-in-bits='64' id='type-id-986'/>
    <reference-type-def kind='lvalue' type-id='type-id-683' size-in-bits='64' id='type-id-987'/>
    <reference-type-def kind='lvalue' type-id='type-id-266' size-in-bits='64' id='type-id-988'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-989'/>
    <reference-type-def kind='lvalue' type-id='type-id-990' size-in-bits='64' id='type-id-991'/>
    <reference-type-def kind='lvalue' type-id='type-id-692' size-in-bits='64' id='type-id-992'/>
    <reference-type-def kind='lvalue' type-id='type-id-228' size-in-bits='64' id='type-id-993'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-994'/>
    <reference-type-def kind='lvalue' type-id='type-id-995' size-in-bits='64' id='type-id-996'/>
    <reference-type-def kind='lvalue' type-id='type-id-701' size-in-bits='64' id='type-id-997'/>
    <reference-type-def kind='lvalue' type-id='type-id-226' size-in-bits='64' id='type-id-998'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-999'/>
    <reference-type-def kind='lvalue' type-id='type-id-1000' size-in-bits='64' id='type-id-1001'/>
    <reference-type-def kind='lvalue' type-id='type-id-710' size-in-bits='64' id='type-id-1002'/>
    <reference-type-def kind='lvalue' type-id='type-id-229' size-in-bits='64' id='type-id-1003'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-1004'/>
    <reference-type-def kind='lvalue' type-id='type-id-1005' size-in-bits='64' id='type-id-1006'/>
    <reference-type-def kind='lvalue' type-id='type-id-719' size-in-bits='64' id='type-id-1007'/>
    <reference-type-def kind='lvalue' type-id='type-id-242' size-in-bits='64' id='type-id-1008'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-1009'/>
    <reference-type-def kind='lvalue' type-id='type-id-1010' size-in-bits='64' id='type-id-1011'/>
    <reference-type-def kind='lvalue' type-id='type-id-727' size-in-bits='64' id='type-id-1012'/>
    <reference-type-def kind='lvalue' type-id='type-id-730' size-in-bits='64' id='type-id-1013'/>
    <pointer-type-def type-id='type-id-730' size-in-bits='64' id='type-id-1014'/>
    <reference-type-def kind='lvalue' type-id='type-id-733' size-in-bits='64' id='type-id-1015'/>
    <pointer-type-def type-id='type-id-733' size-in-bits='64' id='type-id-1016'/>
    <reference-type-def kind='lvalue' type-id='type-id-736' size-in-bits='64' id='type-id-1017'/>
    <pointer-type-def type-id='type-id-736' size-in-bits='64' id='type-id-1018'/>
    <reference-type-def kind='lvalue' type-id='type-id-739' size-in-bits='64' id='type-id-1019'/>
    <pointer-type-def type-id='type-id-739' size-in-bits='64' id='type-id-1020'/>
    <reference-type-def kind='lvalue' type-id='type-id-742' size-in-bits='64' id='type-id-1021'/>
    <pointer-type-def type-id='type-id-742' size-in-bits='64' id='type-id-1022'/>
    <reference-type-def kind='lvalue' type-id='type-id-745' size-in-bits='64' id='type-id-1023'/>
    <pointer-type-def type-id='type-id-745' size-in-bits='64' id='type-id-1024'/>
    <reference-type-def kind='lvalue' type-id='type-id-748' size-in-bits='64' id='type-id-1025'/>
    <pointer-type-def type-id='type-id-748' size-in-bits='64' id='type-id-1026'/>
    <reference-type-def kind='lvalue' type-id='type-id-751' size-in-bits='64' id='type-id-1027'/>
    <pointer-type-def type-id='type-id-751' size-in-bits='64' id='type-id-1028'/>
    <reference-type-def kind='lvalue' type-id='type-id-754' size-in-bits='64' id='type-id-1029'/>
    <pointer-type-def type-id='type-id-754' size-in-bits='64' id='type-id-1030'/>
    <reference-type-def kind='lvalue' type-id='type-id-757' size-in-bits='64' id='type-id-1031'/>
    <pointer-type-def type-id='type-id-757' size-in-bits='64' id='type-id-1032'/>
    <reference-type-def kind='lvalue' type-id='type-id-760' size-in-bits='64' id='type-id-1033'/>
    <pointer-type-def type-id='type-id-760' size-in-bits='64' id='type-id-1034'/>
    <reference-type-def kind='lvalue' type-id='type-id-763' size-in-bits='64' id='type-id-1035'/>
    <pointer-type-def type-id='type-id-763' size-in-bits='64' id='type-id-1036'/>
    <reference-type-def kind='lvalue' type-id='type-id-766' size-in-bits='64' id='type-id-1037'/>
    <pointer-type-def type-id='type-id-766' size-in-bits='64' id='type-id-1038'/>
    <pointer-type-def type-id='type-id-769' size-in-bits='64' id='type-id-1039'/>
    <pointer-type-def type-id='type-id-772' size-in-bits='64' id='type-id-1040'/>
    <pointer-type-def type-id='type-id-775' size-in-bits='64' id='type-id-1041'/>
    <pointer-type-def type-id='type-id-778' size-in-bits='64' id='type-id-1042'/>
    <reference-type-def kind='lvalue' type-id='type-id-781' size-in-bits='64' id='type-id-1043'/>
    <pointer-type-def type-id='type-id-781' size-in-bits='64' id='type-id-1044'/>
    <reference-type-def kind='lvalue' type-id='type-id-784' size-in-bits='64' id='type-id-1045'/>
    <pointer-type-def type-id='type-id-784' size-in-bits='64' id='type-id-1046'/>
    <reference-type-def kind='lvalue' type-id='type-id-196' size-in-bits='64' id='type-id-1047'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-1048'/>
    <pointer-type-def type-id='type-id-790' size-in-bits='64' id='type-id-1049'/>
    <pointer-type-def type-id='type-id-793' size-in-bits='64' id='type-id-1050'/>
    <pointer-type-def type-id='type-id-796' size-in-bits='64' id='type-id-1051'/>
    <reference-type-def kind='lvalue' type-id='type-id-232' size-in-bits='64' id='type-id-1052'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-1053'/>
    <reference-type-def kind='lvalue' type-id='type-id-821' size-in-bits='64' id='type-id-1054'/>
    <reference-type-def kind='lvalue' type-id='type-id-824' size-in-bits='64' id='type-id-1055'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-1056'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-1057'/>
    <reference-type-def kind='lvalue' type-id='type-id-836' size-in-bits='64' id='type-id-1058'/>
    <reference-type-def kind='lvalue' type-id='type-id-839' size-in-bits='64' id='type-id-1059'/>
    <reference-type-def kind='lvalue' type-id='type-id-845' size-in-bits='64' id='type-id-1060'/>
    <pointer-type-def type-id='type-id-845' size-in-bits='64' id='type-id-1061'/>
    <reference-type-def kind='lvalue' type-id='type-id-849' size-in-bits='64' id='type-id-1062'/>
    <pointer-type-def type-id='type-id-849' size-in-bits='64' id='type-id-1063'/>
    <reference-type-def kind='lvalue' type-id='type-id-852' size-in-bits='64' id='type-id-1064'/>
    <pointer-type-def type-id='type-id-852' size-in-bits='64' id='type-id-1065'/>
    <reference-type-def kind='lvalue' type-id='type-id-855' size-in-bits='64' id='type-id-1066'/>
    <pointer-type-def type-id='type-id-855' size-in-bits='64' id='type-id-1067'/>
    <reference-type-def kind='lvalue' type-id='type-id-858' size-in-bits='64' id='type-id-1068'/>
    <pointer-type-def type-id='type-id-858' size-in-bits='64' id='type-id-1069'/>
    <reference-type-def kind='lvalue' type-id='type-id-861' size-in-bits='64' id='type-id-1070'/>
    <pointer-type-def type-id='type-id-861' size-in-bits='64' id='type-id-1071'/>
    <reference-type-def kind='lvalue' type-id='type-id-864' size-in-bits='64' id='type-id-1072'/>
    <pointer-type-def type-id='type-id-864' size-in-bits='64' id='type-id-1073'/>
    <reference-type-def kind='lvalue' type-id='type-id-268' size-in-bits='64' id='type-id-1074'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-1075'/>
    <reference-type-def kind='lvalue' type-id='type-id-877' size-in-bits='64' id='type-id-1076'/>
    <reference-type-def kind='lvalue' type-id='type-id-271' size-in-bits='64' id='type-id-1077'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-1078'/>
    <reference-type-def kind='lvalue' type-id='type-id-889' size-in-bits='64' id='type-id-1079'/>
    <reference-type-def kind='lvalue' type-id='type-id-17' size-in-bits='64' id='type-id-257'/>
    <reference-type-def kind='lvalue' type-id='type-id-56' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-1080'/>
    <qualified-type-def type-id='type-id-151' const='yes' id='type-id-1081'/>
    <reference-type-def kind='lvalue' type-id='type-id-1081' size-in-bits='64' id='type-id-1082'/>
    <pointer-type-def type-id='type-id-1081' size-in-bits='64' id='type-id-1083'/>
    <namespace-decl name='std'>
      <class-decl name='pair&lt;long unsigned int const, Stream*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='128' column='1' id='type-id-845'>
        <member-type access='public'>
          <typedef-decl name='first_type' type-id='type-id-892' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='130' column='1' id='type-id-1084'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-892' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-265' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='134' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' mangled-name='_ZNSt4pairIKmP6StreamEC4ERKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-847'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' mangled-name='_ZNSt4pairIKmP6StreamEC4EOS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-1060'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator=' mangled-name='_ZNSt4pairIKmP6StreamEaSERKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-847'/>
            <return type-id='type-id-1060'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator=' mangled-name='_ZNSt4pairIKmP6StreamEaSEOS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-1060'/>
            <return type-id='type-id-1060'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='swap' mangled-name='_ZNSt4pairIKmP6StreamE4swapERS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='310' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-1060'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='pair&lt;long unsigned int const&amp;, 0ul&gt;' mangled-name='_ZNSt4pairIKmP6StreamEC4IJRS0_EJLm0EEJEJEEERSt5tupleIJDpT_EERS6_IJDpT1_EESt12_Index_tupleIJXspT0_EEESF_IJXspT2_EEE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/tuple' line='1551' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-1085'/>
            <parameter type-id='type-id-1086'/>
            <parameter type-id='type-id-1087'/>
            <parameter type-id='type-id-1088'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair&lt;long unsigned int const&amp;&gt;' mangled-name='_ZNSt4pairIKmP6StreamEC4IJRS0_EJEEESt21piecewise_construct_tSt5tupleIJDpT_EES7_IJDpT0_EE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/tuple' line='1539' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-1089'/>
            <parameter type-id='type-id-1090'/>
            <parameter type-id='type-id-1091'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='pair&lt;long unsigned int const&amp;, 0ul&gt;' mangled-name='_ZNSt4pairIKmP6StreamEC2IJRS0_EJLm0EEJEJEEERSt5tupleIJDpT_EERS6_IJDpT1_EESt12_Index_tupleIJXspT0_EEESF_IJXspT2_EEE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/tuple' line='1551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt4pairIKmP6StreamEC1IJRS0_EJLm0EEJEJEEERSt5tupleIJDpT_EERS6_IJDpT1_EESt12_Index_tupleIJXspT0_EEESF_IJXspT2_EEE'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-1085'/>
            <parameter type-id='type-id-1086'/>
            <parameter type-id='type-id-1087'/>
            <parameter type-id='type-id-1088'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair&lt;long unsigned int const&amp;&gt;' mangled-name='_ZNSt4pairIKmP6StreamEC2IJRS0_EJEEESt21piecewise_construct_tSt5tupleIJDpT_EES7_IJDpT0_EE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/tuple' line='1539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt4pairIKmP6StreamEC2IJRS0_EJEEESt21piecewise_construct_tSt5tupleIJDpT_EES7_IJDpT0_EE'>
            <parameter type-id='type-id-1061' is-artificial='yes'/>
            <parameter type-id='type-id-1089'/>
            <parameter type-id='type-id-1090'/>
            <parameter type-id='type-id-1091'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;coibuffer*&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-766'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-361'/>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-506' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1092'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1094' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1093'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-908' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1095'/>
        </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1038' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEEC4ERKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1038' is-artificial='yes'/>
            <parameter type-id='type-id-768'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1038' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP9coibufferEEC2Ev'>
            <parameter type-id='type-id-1038' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP9coibufferEED1Ev'>
            <parameter type-id='type-id-1038' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP9coibufferEED1Ev'>
            <parameter type-id='type-id-1038' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;coibuffer*&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-506'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-730'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-321' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeIP9coibufferE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeIP9coibufferE9_M_valptrEv'>
            <parameter type-id='type-id-908' is-artificial='yes'/>
            <return type-id='type-id-379'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt10_List_nodeIP9coibufferE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt10_List_nodeIP9coibufferE9_M_valptrEv'>
            <parameter type-id='type-id-509' is-artificial='yes'/>
            <return type-id='type-id-377'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;PersistData&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-757'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-355'/>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-494' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1096'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1094' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1097'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-902' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1098'/>
        </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeI11PersistDataEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeI11PersistDataEEC4ERKS2_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <parameter type-id='type-id-759'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeI11PersistDataEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeI11PersistDataEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeI11PersistDataEEC1Ev'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeI11PersistDataEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeI11PersistDataEED2Ev'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;PersistData&gt;' size-in-bits='448' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-494'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-730'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-313' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeI11PersistDataE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeI11PersistDataE9_M_valptrEv'>
            <parameter type-id='type-id-902' is-artificial='yes'/>
            <return type-id='type-id-215'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt10_List_nodeI11PersistDataE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-497' is-artificial='yes'/>
            <return type-id='type-id-388'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;PtrData*&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-760'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-357'/>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-498' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1099'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1094' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1100'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-904' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1101'/>
        </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1034' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEEC4ERKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1034' is-artificial='yes'/>
            <parameter type-id='type-id-762'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1034' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP7PtrDataEEC2Ev'>
            <parameter type-id='type-id-1034' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP7PtrDataEED1Ev'>
            <parameter type-id='type-id-1034' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP7PtrDataEED1Ev'>
            <parameter type-id='type-id-1034' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;PtrData*&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-498'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-730'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-315' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeIP7PtrDataE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeIP7PtrDataE9_M_valptrEv'>
            <parameter type-id='type-id-904' is-artificial='yes'/>
            <return type-id='type-id-307'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt10_List_nodeIP7PtrDataE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-501' is-artificial='yes'/>
            <return type-id='type-id-306'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;TargetImage&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-763'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-359'/>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-502' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1102'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1094' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1103'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-906' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1104'/>
        </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeI11TargetImageEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeI11TargetImageEEC4ERKS2_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <parameter type-id='type-id-765'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeI11TargetImageEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeI11TargetImageEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeI11TargetImageEEC2Ev'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeI11TargetImageEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeI11TargetImageEED1Ev'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;TargetImage&gt;' size-in-bits='448' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-502'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-730'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-319' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeI11TargetImageE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeI11TargetImageE9_M_valptrEv'>
            <parameter type-id='type-id-906' is-artificial='yes'/>
            <return type-id='type-id-212'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt10_List_nodeI11TargetImageE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-505' is-artificial='yes'/>
            <return type-id='type-id-391'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree_node&lt;std::pair&lt;void const* const, OffloadDescriptor*&gt; &gt;' size-in-bits='384' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='134' column='1' id='type-id-649'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-653'/>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='_M_storage' type-id='type-id-327' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='149' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt13_Rb_tree_nodeISt4pairIKPKvP17OffloadDescriptorEE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt13_Rb_tree_nodeISt4pairIKPKvP17OffloadDescriptorEE9_M_valptrEv'>
            <parameter type-id='type-id-961' is-artificial='yes'/>
            <return type-id='type-id-1073'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt13_Rb_tree_nodeISt4pairIKPKvP17OffloadDescriptorEE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt13_Rb_tree_nodeISt4pairIKPKvP17OffloadDescriptorEE9_M_valptrEv'>
            <parameter type-id='type-id-652' is-artificial='yes'/>
            <return type-id='type-id-867'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree_node&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt;' size-in-bits='384' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='134' column='1' id='type-id-645'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-653'/>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='_M_storage' type-id='type-id-325' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='149' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt13_Rb_tree_nodeISt4pairIKmP6StreamEE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt13_Rb_tree_nodeISt4pairIKmP6StreamEE9_M_valptrEv'>
            <parameter type-id='type-id-959' is-artificial='yes'/>
            <return type-id='type-id-1061'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt13_Rb_tree_nodeISt4pairIKmP6StreamEE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt13_Rb_tree_nodeISt4pairIKmP6StreamEE9_M_valptrEv'>
            <parameter type-id='type-id-648' is-artificial='yes'/>
            <return type-id='type-id-848'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-775'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-367'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1094' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1105'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-959' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1106'/>
        </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1041' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEEC4ERKS6_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1041' is-artificial='yes'/>
            <parameter type-id='type-id-777'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1041' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEEC1Ev'>
            <parameter type-id='type-id-1041' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEED1Ev'>
            <parameter type-id='type-id-1041' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEEC1Ev'>
            <parameter type-id='type-id-1041' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEEC2ERKS6_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEEC1ERKS6_'>
            <parameter type-id='type-id-1041' is-artificial='yes'/>
            <parameter type-id='type-id-777'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt13_Rb_tree_nodeISt4pairIKmP6StreamEEED1Ev'>
            <parameter type-id='type-id-1041' is-artificial='yes'/>
            <parameter type-id='type-id-25' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree_node&lt;AutoData&gt;' size-in-bits='448' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='134' column='1' id='type-id-637'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-653'/>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='_M_storage' type-id='type-id-309' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='149' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt13_Rb_tree_nodeI8AutoDataE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt13_Rb_tree_nodeI8AutoDataE9_M_valptrEv'>
            <parameter type-id='type-id-955' is-artificial='yes'/>
            <return type-id='type-id-207'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt13_Rb_tree_nodeI8AutoDataE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt13_Rb_tree_nodeI8AutoDataE9_M_valptrEv'>
            <parameter type-id='type-id-640' is-artificial='yes'/>
            <return type-id='type-id-221'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree_iterator&lt;AutoData&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='174' column='1' id='type-id-613'>
        <member-type access='public'>
          <typedef-decl name='_Base_ptr' type-id='type-id-1108' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='184' column='1' id='type-id-1107'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-299' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='177' column='1' id='type-id-1109'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-207' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='178' column='1' id='type-id-1110'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='_Self' type-id='type-id-613' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='183' column='1' id='type-id-616'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-1107' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='240' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_Rb_tree_iterator' mangled-name='_ZNSt17_Rb_tree_iteratorI8AutoDataEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-946' is-artificial='yes'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_Rb_tree_iterator' mangled-name='_ZNSt17_Rb_tree_iteratorI8AutoDataEC4EPSt18_Rb_tree_node_base' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-946' is-artificial='yes'/>
            <parameter type-id='type-id-1107'/>
            <return type-id='type-id-149'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator*' mangled-name='_ZNKSt17_Rb_tree_iteratorI8AutoDataEdeEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-615' is-artificial='yes'/>
            <return type-id='type-id-1109'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator-&gt;' mangled-name='_ZNKSt17_Rb_tree_iteratorI8AutoDataEptEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-615' is-artificial='yes'/>
            <return type-id='type-id-1110'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator++' mangled-name='_ZNSt17_Rb_tree_iteratorI8AutoDataEppEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-946' is-artificial='yes'/>
            <return type-id='type-id-947'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator++' mangled-name='_ZNSt17_Rb_tree_iteratorI8AutoDataEppEi' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-946' is-artificial='yes'/>
            <parameter type-id='type-id-25'/>
            <return type-id='type-id-616'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator--' mangled-name='_ZNSt17_Rb_tree_iteratorI8AutoDataEmmEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt17_Rb_tree_iteratorI8AutoDataEmmEv'>
            <parameter type-id='type-id-946' is-artificial='yes'/>
            <return type-id='type-id-947'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator--' mangled-name='_ZNSt17_Rb_tree_iteratorI8AutoDataEmmEi' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-946' is-artificial='yes'/>
            <parameter type-id='type-id-25'/>
            <return type-id='type-id-616'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator==' mangled-name='_ZNKSt17_Rb_tree_iteratorI8AutoDataEeqERKS1_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt17_Rb_tree_iteratorI8AutoDataEeqERKS1_'>
            <parameter type-id='type-id-615' is-artificial='yes'/>
            <parameter type-id='type-id-618'/>
            <return type-id='type-id-150'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator!=' mangled-name='_ZNKSt17_Rb_tree_iteratorI8AutoDataEneERKS1_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_tree.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-615' is-artificial='yes'/>
            <parameter type-id='type-id-618'/>
            <return type-id='type-id-150'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
