<abi-corpus version='2.0' path='data/test-read-dwarf/test19-pr19023-libtcmalloc_and_profiler.so' soname='libtcmalloc_and_profiler.so.4'>
  <elf-needed>
    <dependency name='libunwind.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='GetHeapProfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerDump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStart' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='IsHeapProfilerRunning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetEstimatedAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV15MallocExtension' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16MmapSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16SbrkSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18DevMemSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19DefaultSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19HugetlbSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22TCMallocImplementation' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE13kPageHeapType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE14kLargeSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE16kThreadCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE17kCentralCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE18kTransferCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE21kPageHeapUnmappedType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE22kLargeUnmappedSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__free_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__malloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__memalign_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__realloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='heap_leak_checker_bcad_variable' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_alloc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/base/atomicops-internals-x86.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/dynamic_annotations.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C89'>
    <function-decl name='RunningOnValgrind' mangled-name='RunningOnValgrind' filepath='src/base/dynamic_annotations.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='RunningOnValgrind'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ValgrindSlowdown' mangled-name='ValgrindSlowdown' filepath='src/base/dynamic_annotations.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ValgrindSlowdown'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/elf_mem_image.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='128' id='type-id-4'>
      <subrange length='16' type-id='type-id-5' id='type-id-6'/>
    </array-type-def>
    <typedef-decl name='Elf64_Half' type-id='type-id-7' filepath='/usr/include/elf.h' line='34' column='1' id='type-id-8'/>
    <typedef-decl name='Elf64_Word' type-id='type-id-9' filepath='/usr/include/elf.h' line='39' column='1' id='type-id-10'/>
    <typedef-decl name='Elf64_Xword' type-id='type-id-11' filepath='/usr/include/elf.h' line='45' column='1' id='type-id-12'/>
    <typedef-decl name='Elf64_Addr' type-id='type-id-11' filepath='/usr/include/elf.h' line='50' column='1' id='type-id-13'/>
    <typedef-decl name='Elf64_Off' type-id='type-id-11' filepath='/usr/include/elf.h' line='54' column='1' id='type-id-14'/>
    <typedef-decl name='Elf64_Section' type-id='type-id-7' filepath='/usr/include/elf.h' line='58' column='1' id='type-id-15'/>
    <typedef-decl name='Elf64_Versym' type-id='type-id-8' filepath='/usr/include/elf.h' line='62' column='1' id='type-id-16'/>
    <class-decl name='Elf64_Ehdr' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='88' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e_ident' type-id='type-id-4' visibility='default' filepath='/usr/include/elf.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='e_type' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='e_machine' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='e_version' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='e_entry' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='e_phoff' type-id='type-id-14' visibility='default' filepath='/usr/include/elf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='e_shoff' type-id='type-id-14' visibility='default' filepath='/usr/include/elf.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='e_flags' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='e_ehsize' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='e_phentsize' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='e_phnum' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='e_shentsize' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='e_shnum' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='e_shstrndx' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Sym' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='389' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_info' type-id='type-id-3' visibility='default' filepath='/usr/include/elf.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='st_other' type-id='type-id-3' visibility='default' filepath='/usr/include/elf.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='st_shndx' type-id='type-id-15' visibility='default' filepath='/usr/include/elf.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_value' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_size' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='395' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Phdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='551' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_type' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='p_flags' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_offset' type-id='type-id-14' visibility='default' filepath='/usr/include/elf.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_vaddr' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_paddr' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_filesz' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_memsz' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_align' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='559' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdef' size-in-bits='160' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='812' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vd_version' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='vd_flags' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vd_ndx' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vd_cnt' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vd_hash' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vd_aux' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vd_next' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='819' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdaux' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='849' column='1' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vda_name' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='850' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vda_next' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='851' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-22' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-7'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-25'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <reference-type-def kind='lvalue' type-id='type-id-28' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-30'/>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-31'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-48'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-49'/>
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-52'/>
    <qualified-type-def type-id='type-id-53' id='type-id-54'/>
    <reference-type-def kind='lvalue' type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-55'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-56'/>
    <namespace-decl name='base'>
      <class-decl name='ElfMemImage' size-in-bits='576' visibility='default' filepath='./src/base/elf_mem_image.h' line='56' column='1' id='type-id-23'>
        <member-type access='private'>
          <class-decl name='SymbolInfo' size-in-bits='256' is-struct='yes' visibility='default' filepath='./src/base/elf_mem_image.h' line='64' column='1' id='type-id-26'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='name' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='65' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='version' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='66' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='address' type-id='type-id-58' visibility='default' filepath='./src/base/elf_mem_image.h' line='68' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='symbol' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='69' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='SymbolIterator' size-in-bits='384' visibility='default' filepath='./src/base/elf_mem_image.h' line='73' column='1' id='type-id-28'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='info_' type-id='type-id-26' visibility='default' filepath='./src/base/elf_mem_image.h' line='84' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <var-decl name='index_' type-id='type-id-1' visibility='default' filepath='./src/base/elf_mem_image.h' line='85' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='320'>
              <var-decl name='image_' type-id='type-id-59' visibility='default' filepath='./src/base/elf_mem_image.h' line='86' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <function-decl name='SymbolIterator' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' filepath='./src/base/elf_mem_image.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi'>
                <parameter type-id='type-id-30' is-artificial='yes'/>
                <parameter type-id='type-id-58'/>
                <parameter type-id='type-id-1'/>
                <return type-id='type-id-60'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator-&gt;' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorptEv' filepath='src/base/elf_mem_image.cc' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorptEv'>
                <parameter type-id='type-id-56' name='this' is-artificial='yes'/>
                <return type-id='type-id-51'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator*' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratordeEv' filepath='src/base/elf_mem_image.cc' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratordeEv'>
                <parameter type-id='type-id-56' name='this' is-artificial='yes'/>
                <return type-id='type-id-50'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator==' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' filepath='src/base/elf_mem_image.cc' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_'>
                <parameter type-id='type-id-56' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-54' name='rhs' filepath='src/base/elf_mem_image.cc' line='370' column='1'/>
                <return type-id='type-id-61'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator!=' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' filepath='src/base/elf_mem_image.cc' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_'>
                <parameter type-id='type-id-56' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-54' name='rhs' filepath='src/base/elf_mem_image.cc' line='370' column='1'/>
                <return type-id='type-id-61'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='Update' mangled-name='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' filepath='src/base/elf_mem_image.cc' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi'>
                <parameter type-id='type-id-31' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-1' name='increment' filepath='src/base/elf_mem_image.cc' line='393' column='1'/>
                <return type-id='type-id-60'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator++' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorppEv' filepath='src/base/elf_mem_image.cc' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorppEv'>
                <parameter type-id='type-id-31' name='this' is-artificial='yes'/>
                <return type-id='type-id-29'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='kInvalidBase' type-id='type-id-59' mangled-name='_ZN4base11ElfMemImage12kInvalidBaseE' visibility='default' filepath='./src/base/elf_mem_image.h' line='59' column='1' elf-symbol-id='_ZN4base11ElfMemImage12kInvalidBaseE'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='ehdr_' type-id='type-id-33' visibility='default' filepath='./src/base/elf_mem_image.h' line='120' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='dynsym_' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='121' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='versym_' type-id='type-id-43' visibility='default' filepath='./src/base/elf_mem_image.h' line='122' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='verdef_' type-id='type-id-41' visibility='default' filepath='./src/base/elf_mem_image.h' line='123' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='hash_' type-id='type-id-45' visibility='default' filepath='./src/base/elf_mem_image.h' line='124' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='dynstr_' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='125' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='strsize_' type-id='type-id-62' visibility='default' filepath='./src/base/elf_mem_image.h' line='126' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <var-decl name='verdefnum_' type-id='type-id-62' visibility='default' filepath='./src/base/elf_mem_image.h' line='127' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='512'>
          <var-decl name='link_base_' type-id='type-id-13' visibility='default' filepath='./src/base/elf_mem_image.h' line='128' column='1'/>
        </data-member>
        <member-function access='private' constructor='yes'>
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='./src/base/elf_mem_image.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv'>
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <parameter type-id='type-id-58'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='src/base/elf_mem_image.cc' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='src/base/elf_mem_image.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-41' name='verdef' filepath='src/base/elf_mem_image.cc' line='173' column='1'/>
            <return type-id='type-id-39'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='src/base/elf_mem_image.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='src/base/elf_mem_image.cc' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-10' name='offset' filepath='src/base/elf_mem_image.cc' line='177' column='1'/>
            <return type-id='type-id-57'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='src/base/elf_mem_image.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='159' column='1'/>
            <return type-id='type-id-41'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='src/base/elf_mem_image.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-37' name='sym' filepath='src/base/elf_mem_image.cc' line='150' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='src/base/elf_mem_image.cc' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-10' name='offset' filepath='src/base/elf_mem_image.cc' line='177' column='1'/>
            <return type-id='type-id-57'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='src/base/elf_mem_image.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='137' column='1'/>
            <return type-id='type-id-35'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='src/base/elf_mem_image.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv'>
            <parameter type-id='type-id-25' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-58' name='base' filepath='src/base/elf_mem_image.cc' line='182' column='1'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='src/base/elf_mem_image.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='132' column='1'/>
            <return type-id='type-id-43'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='src/base/elf_mem_image.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='127' column='1'/>
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='src/base/elf_mem_image.cc' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-58' name='address' filepath='src/base/elf_mem_image.cc' line='332' column='1'/>
            <parameter type-id='type-id-27' name='info_out' filepath='src/base/elf_mem_image.cc' line='333' column='1'/>
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE'>
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-57' name='name' filepath='src/base/elf_mem_image.cc' line='316' column='1'/>
            <parameter type-id='type-id-57' name='version' filepath='src/base/elf_mem_image.cc' line='317' column='1'/>
            <parameter type-id='type-id-1' name='type' filepath='src/base/elf_mem_image.cc' line='318' column='1'/>
            <parameter type-id='type-id-27' name='info' filepath='src/base/elf_mem_image.cc' line='319' column='1'/>
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-5'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-22'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/linuxthreads.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <typedef-decl name='ListAllProcessThreadsCallBack' type-id='type-id-63' filepath='./src/base/thread_lister.h' line='48' column='1' id='type-id-64'/>
    <typedef-decl name='__pid_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='143' column='1' id='type-id-65'/>
    <typedef-decl name='pid_t' type-id='type-id-65' filepath='/usr/include/sched.h' line='37' column='1' id='type-id-66'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-68'/>
    <function-decl name='TCMalloc_ListAllProcessThreads' mangled-name='TCMalloc_ListAllProcessThreads' filepath='src/base/linuxthreads.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ListAllProcessThreads'>
      <parameter type-id='type-id-58' name='parameter' filepath='src/base/linuxthreads.cc' line='551' column='1'/>
      <parameter type-id='type-id-64' name='callback' filepath='src/base/linuxthreads.cc' line='552' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='TCMalloc_ResumeAllProcessThreads' mangled-name='TCMalloc_ResumeAllProcessThreads' filepath='src/base/linuxthreads.cc' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ResumeAllProcessThreads'>
      <parameter type-id='type-id-1' name='num_threads' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <parameter type-id='type-id-68' name='thread_pids' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-67'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/logging.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead'>
      <var-decl name='FLAGS_verbose' type-id='type-id-70' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE' visibility='default' filepath='./src/base/logging.h' line='76' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE'/>
      <var-decl name='FLAGS_noverbose' type-id='type-id-71' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE' visibility='default' filepath='src/base/logging.cc' line='40' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE'/>
    </namespace-decl>
    <function-decl name='RawOpenForWriting' mangled-name='_Z17RawOpenForWritingPKc' filepath='src/base/logging.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17RawOpenForWritingPKc'>
      <parameter type-id='type-id-57' name='filename' filepath='src/base/logging.cc' line='90' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='RawWrite' mangled-name='_Z8RawWriteiPKcm' filepath='src/base/logging.cc' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawWriteiPKcm'>
      <parameter type-id='type-id-72' name='fd' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='type-id-57' name='buf' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='type-id-62' name='len' filepath='src/base/logging.cc' line='94' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='RawClose' mangled-name='_Z8RawClosei' filepath='src/base/logging.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawClosei'>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/low_level_alloc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-73' size-in-bits='1920' id='type-id-74'>
      <subrange length='30' type-id='type-id-5' id='type-id-75'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-73'/>
    <namespace-decl name='low_level_alloc_internal'>
      <class-decl name='AllocList' size-in-bits='2240' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='67' column='1' id='type-id-76'>
        <member-type access='public'>
          <class-decl name='Header' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='68' column='1' id='type-id-77'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='type-id-78' visibility='default' filepath='src/base/low_level_alloc.cc' line='69' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='magic' type-id='type-id-78' visibility='default' filepath='src/base/low_level_alloc.cc' line='71' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='arena' type-id='type-id-79' visibility='default' filepath='src/base/low_level_alloc.cc' line='72' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='dummy_for_alignment' type-id='type-id-58' visibility='default' filepath='src/base/low_level_alloc.cc' line='73' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='header' type-id='type-id-77' visibility='default' filepath='src/base/low_level_alloc.cc' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='levels' type-id='type-id-1' visibility='default' filepath='src/base/low_level_alloc.cc' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='next' type-id='type-id-74' visibility='default' filepath='src/base/low_level_alloc.cc' line='79' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='CycleClock' size-in-bits='8' is-struct='yes' visibility='default' filepath='./src/base/cycleclock.h' line='79' column='1' id='type-id-80'/>
    <namespace-decl name='base'>
      <function-decl name='SubmitSpinLockProfileData' mangled-name='_ZN4base25SubmitSpinLockProfileDataEPKvl' filepath='./src/base/synchronization_profiling.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base25SubmitSpinLockProfileDataEPKvl'>
        <parameter type-id='type-id-58'/>
        <parameter type-id='type-id-81'/>
        <return type-id='type-id-60'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock_internal.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-83'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-84'/>
    <namespace-decl name='base'>
      <namespace-decl name='subtle'>
        <function-decl name='Acquire_Load' filepath='./src/base/atomicops-internals-x86.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85'/>
          <return type-id='type-id-86'/>
        </function-decl>
      </namespace-decl>
      <namespace-decl name='internal'>
        <class-decl name='SpinLockWaitTransition' size-in-bits='96' is-struct='yes' visibility='default' filepath='./src/base/spinlock_internal.h' line='48' column='1' id='type-id-82'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='from' type-id='type-id-70' visibility='default' filepath='./src/base/spinlock_internal.h' line='49' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='to' type-id='type-id-70' visibility='default' filepath='./src/base/spinlock_internal.h' line='50' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='done' type-id='type-id-61' visibility='default' filepath='./src/base/spinlock_internal.h' line='51' column='1'/>
          </data-member>
        </class-decl>
        <function-decl name='SpinLockDelay' mangled-name='_ZN4base8internal13SpinLockDelayEPViii' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal13SpinLockDelayEPViii'>
          <parameter type-id='type-id-87'/>
          <parameter type-id='type-id-70'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-60'/>
        </function-decl>
        <function-decl name='SpinLockWake' mangled-name='_ZN4base8internal12SpinLockWakeEPVib' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWakeEPVib'>
          <parameter type-id='type-id-87'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-60'/>
        </function-decl>
        <function-decl name='SpinLockWait' mangled-name='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' filepath='src/base/spinlock_internal.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE'>
          <parameter type-id='type-id-87'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-84'/>
          <return type-id='type-id-70'/>
        </function-decl>
      </namespace-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/sysinfo.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='80' id='type-id-88'>
      <subrange length='10' type-id='type-id-5' id='type-id-89'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='40960' id='type-id-90'>
      <subrange length='5120' type-id='type-id-5' id='type-id-91'/>
    </array-type-def>
    <class-decl name='ProcMapsIterator' size-in-bits='640' visibility='default' filepath='./src/base/sysinfo.h' line='102' column='1' id='type-id-92'>
      <member-type access='private'>
        <class-decl name='Buffer' size-in-bits='40960' is-struct='yes' visibility='default' filepath='./src/base/sysinfo.h' line='104' column='1' id='type-id-93'>
          <data-member access='public' static='yes'>
            <var-decl name='kBufSize' type-id='type-id-94' visibility='default' filepath='./src/base/sysinfo.h' line='110' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf_' type-id='type-id-90' visibility='default' filepath='./src/base/sysinfo.h' line='112' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='ibuf_' type-id='type-id-95' visibility='default' filepath='./src/base/sysinfo.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='stext_' type-id='type-id-95' visibility='default' filepath='./src/base/sysinfo.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='etext_' type-id='type-id-95' visibility='default' filepath='./src/base/sysinfo.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='nextline_' type-id='type-id-95' visibility='default' filepath='./src/base/sysinfo.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='ebuf_' type-id='type-id-95' visibility='default' filepath='./src/base/sysinfo.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='fd_' type-id='type-id-1' visibility='default' filepath='./src/base/sysinfo.h' line='219' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='pid_' type-id='type-id-66' visibility='default' filepath='./src/base/sysinfo.h' line='221' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='flags_' type-id='type-id-88' visibility='default' filepath='./src/base/sysinfo.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='dynamic_buffer_' type-id='type-id-96' visibility='default' filepath='./src/base/sysinfo.h' line='223' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='using_maps_backing_' type-id='type-id-61' visibility='default' filepath='./src/base/sysinfo.h' line='224' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1Ei' filepath='./src/base/sysinfo.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1Ei'>
          <parameter type-id='type-id-97' is-artificial='yes'/>
          <parameter type-id='type-id-66'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' filepath='./src/base/sysinfo.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC2EiPNS_6BufferE'>
          <parameter type-id='type-id-97' is-artificial='yes'/>
          <parameter type-id='type-id-66'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' filepath='./src/base/sysinfo.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb'>
          <parameter type-id='type-id-97' is-artificial='yes'/>
          <parameter type-id='type-id-66'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorD1Ev' filepath='./src/base/sysinfo.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorD1Ev'>
          <parameter type-id='type-id-97' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Valid' mangled-name='_ZNK16ProcMapsIterator5ValidEv' filepath='src/base/sysinfo.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16ProcMapsIterator5ValidEv'>
          <parameter type-id='type-id-98' name='this' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FormatLine' mangled-name='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' filepath='src/base/sysinfo.cc' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m'>
          <parameter type-id='type-id-95'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-99'/>
          <parameter type-id='type-id-99'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-99'/>
          <parameter type-id='type-id-81'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-100'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Init' mangled-name='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' filepath='src/base/sysinfo.cc' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb'>
          <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-66' name='pid' filepath='src/base/sysinfo.cc' line='741' column='1'/>
          <parameter type-id='type-id-96' name='buffer' filepath='src/base/sysinfo.cc' line='741' column='1'/>
          <parameter type-id='type-id-61' name='use_maps_backing' filepath='src/base/sysinfo.cc' line='742' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NextExt' mangled-name='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' filepath='src/base/sysinfo.cc' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_'>
          <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-102' name='start' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <parameter type-id='type-id-102' name='end' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <parameter type-id='type-id-103' name='flags' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <parameter type-id='type-id-102' name='offset' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <parameter type-id='type-id-104' name='inode' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <parameter type-id='type-id-103' name='filename' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <parameter type-id='type-id-102' name='file_mapping' filepath='src/base/sysinfo.cc' line='836' column='1'/>
          <parameter type-id='type-id-102' name='file_pages' filepath='src/base/sysinfo.cc' line='836' column='1'/>
          <parameter type-id='type-id-102' name='anon_mapping' filepath='src/base/sysinfo.cc' line='837' column='1'/>
          <parameter type-id='type-id-102' name='anon_pages' filepath='src/base/sysinfo.cc' line='837' column='1'/>
          <parameter type-id='type-id-105' name='dev' filepath='src/base/sysinfo.cc' line='838' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Next' mangled-name='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' filepath='src/base/sysinfo.cc' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_'>
          <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-102' name='start' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <parameter type-id='type-id-102' name='end' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <parameter type-id='type-id-103' name='flags' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <parameter type-id='type-id-102' name='offset' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <parameter type-id='type-id-104' name='inode' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <parameter type-id='type-id-103' name='filename' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-5' filepath='/usr/include/bits/types.h' line='134' column='1' id='type-id-106'/>
    <typedef-decl name='dev_t' type-id='type-id-106' filepath='/usr/include/sys/types.h' line='61' column='1' id='type-id-100'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-97'/>
    <qualified-type-def type-id='type-id-97' const='yes' id='type-id-101'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-96'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-107'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-108'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-98'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-102'/>
    <namespace-decl name='tcmalloc'>
      <function-decl name='FillProcSelfMaps' mangled-name='_ZN8tcmalloc16FillProcSelfMapsEPciPb' filepath='src/base/sysinfo.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16FillProcSelfMapsEPciPb'>
        <parameter type-id='type-id-95'/>
        <parameter type-id='type-id-1'/>
        <parameter type-id='type-id-109'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='DumpProcSelfMaps' mangled-name='_ZN8tcmalloc16DumpProcSelfMapsEi' filepath='src/base/sysinfo.cc' line='1137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16DumpProcSelfMapsEi'>
        <parameter type-id='type-id-72'/>
        <return type-id='type-id-60'/>
      </function-decl>
    </namespace-decl>
    <function-decl name='GetenvBeforeMain' mangled-name='_Z16GetenvBeforeMainPKc' filepath='src/base/sysinfo.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16GetenvBeforeMainPKc'>
      <parameter type-id='type-id-57' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='TCMallocGetenvSafe' mangled-name='TCMallocGetenvSafe' filepath='src/base/sysinfo.cc' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMallocGetenvSafe'>
      <parameter type-id='type-id-57' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='GetUniquePathFromEnv' mangled-name='_Z20GetUniquePathFromEnvPKcPc' filepath='src/base/sysinfo.cc' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20GetUniquePathFromEnvPKcPc'>
      <parameter type-id='type-id-57' name='env_name' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <parameter type-id='type-id-95' name='path' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='SleepForMilliseconds' mangled-name='_Z20SleepForMillisecondsi' filepath='src/base/sysinfo.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20SleepForMillisecondsi'>
      <parameter type-id='type-id-1' name='milliseconds' filepath='src/base/sysinfo.cc' line='226' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='CyclesPerSecond' mangled-name='_Z15CyclesPerSecondv' filepath='src/base/sysinfo.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15CyclesPerSecondv'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='NumCPUs' mangled-name='_Z7NumCPUsv' filepath='src/base/sysinfo.cc' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7NumCPUsv'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='HasPosixThreads' mangled-name='_Z15HasPosixThreadsv' filepath='src/base/sysinfo.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15HasPosixThreadsv'>
      <return type-id='type-id-61'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/vdso_support.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-113'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-114'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-117'/>
    <reference-type-def kind='lvalue' type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-119'/>
    <qualified-type-def type-id='type-id-119' const='yes' id='type-id-120'/>
    <namespace-decl name='base'>
      <class-decl name='VDSOSupport' size-in-bits='576' visibility='default' filepath='./src/base/vdso_support.h' line='72' column='1' id='type-id-112'>
        <member-type access='private'>
          <typedef-decl name='SymbolInfo' type-id='type-id-26' filepath='./src/base/vdso_support.h' line='76' column='1' id='type-id-115'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='SymbolIterator' type-id='type-id-28' filepath='./src/base/vdso_support.h' line='77' column='1' id='type-id-121'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='image_' type-id='type-id-23' visibility='default' filepath='./src/base/vdso_support.h' line='112' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='vdso_base_' type-id='type-id-58' mangled-name='_ZN4base11VDSOSupport10vdso_base_E' visibility='default' filepath='./src/base/vdso_support.h' line='123' column='1' elf-symbol-id='_ZN4base11VDSOSupport10vdso_base_E'/>
        </data-member>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOSupport' mangled-name='_ZN4base11VDSOSupportC1Ev' filepath='./src/base/vdso_support.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupportC1Ev'>
            <parameter type-id='type-id-113' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOSupport' filepath='./src/base/vdso_support.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-113' is-artificial='yes'/>
            <parameter type-id='type-id-118'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE'>
            <parameter type-id='type-id-120' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-58' name='address' filepath='src/base/vdso_support.cc' line='124' column='1'/>
            <parameter type-id='type-id-116' name='info_out' filepath='src/base/vdso_support.cc' line='125' column='1'/>
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE'>
            <parameter type-id='type-id-120' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-57' name='name' filepath='src/base/vdso_support.cc' line='117' column='1'/>
            <parameter type-id='type-id-57' name='version' filepath='src/base/vdso_support.cc' line='118' column='1'/>
            <parameter type-id='type-id-1' name='type' filepath='src/base/vdso_support.cc' line='119' column='1'/>
            <parameter type-id='type-id-116' name='info' filepath='src/base/vdso_support.cc' line='120' column='1'/>
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='SetBase' mangled-name='_ZN4base11VDSOSupport7SetBaseEPKv' filepath='src/base/vdso_support.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport7SetBaseEPKv'>
            <parameter type-id='type-id-114' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-58' name='base' filepath='src/base/vdso_support.cc' line='109' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='Init' mangled-name='_ZN4base11VDSOSupport4InitEv' filepath='src/base/vdso_support.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport4InitEv'>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='VDSOInitHelper' size-in-bits='8' visibility='default' filepath='src/base/vdso_support.cc' line='137' column='1' id='type-id-110'>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOInitHelper' filepath='src/base/vdso_support.cc' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-111' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/central_freelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <reference-type-def kind='lvalue' type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-125'/>
    <reference-type-def kind='lvalue' type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <qualified-type-def type-id='type-id-127' const='yes' id='type-id-128'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <namespace-decl name='std'>
      <function-decl name='min&lt;int32_t&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-126'/>
        <parameter type-id='type-id-126'/>
        <return type-id='type-id-126'/>
      </function-decl>
      <function-decl name='max&lt;int&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-123'/>
        <parameter type-id='type-id-123'/>
        <return type-id='type-id-123'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='tcmalloc'>
      <function-decl name='SLL_PushRange' filepath='src/linked_list.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-130'/>
        <parameter type-id='type-id-58'/>
        <parameter type-id='type-id-58'/>
        <return type-id='type-id-60'/>
      </function-decl>
      <function-decl name='DLL_IsEmpty' filepath='src/span.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-129'/>
        <return type-id='type-id-61'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='tcmalloc'>
      <function-decl name='AlignmentForSize' mangled-name='_ZN8tcmalloc16AlignmentForSizeEm' filepath='src/common.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16AlignmentForSizeEm'>
        <parameter type-id='type-id-62'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='MetaDataAlloc' mangled-name='_ZN8tcmalloc13MetaDataAllocEm' filepath='src/common.cc' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc13MetaDataAllocEm'>
        <parameter type-id='type-id-62'/>
        <return type-id='type-id-58'/>
      </function-decl>
      <function-decl name='metadata_system_bytes' mangled-name='_ZN8tcmalloc21metadata_system_bytesEv' filepath='src/common.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc21metadata_system_bytesEv'>
        <return type-id='type-id-11'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker-bcad.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='HeapLeakCheckerGlobalPrePost' size-in-bits='8' visibility='default' filepath='src/heap-checker-bcad.cc' line='60' column='1' id='type-id-131'>
      <data-member access='private' static='yes'>
        <var-decl name='count_' type-id='type-id-1' mangled-name='_ZN28HeapLeakCheckerGlobalPrePost6count_E' visibility='default' filepath='src/heap-checker-bcad.cc' line='87' column='1' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePost6count_E'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakCheckerGlobalPrePost' filepath='src/heap-checker-bcad.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-132' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakCheckerGlobalPrePost' mangled-name='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' filepath='src/heap-checker-bcad.cc' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePostD1Ev'>
          <parameter type-id='type-id-132' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <var-decl name='heap_leak_checker_bcad_variable' type-id='type-id-61' mangled-name='heap_leak_checker_bcad_variable' visibility='default' filepath='src/heap-checker-bcad.cc' line='53' column='1' elf-symbol-id='heap_leak_checker_bcad_variable'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='infinite' id='type-id-133'>
      <subrange length='infinite' id='type-id-134'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-62' size-in-bits='256' id='type-id-135'>
      <subrange length='4' type-id='type-id-5' id='type-id-136'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='2048' id='type-id-137'>
      <subrange length='32' type-id='type-id-5' id='type-id-138'/>
    </array-type-def>
    <typedef-decl name='RawFD' type-id='type-id-1' filepath='./src/base/logging.h' line='251' column='1' id='type-id-72'/>
    <class-decl name='HeapCleaner' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='403' column='1' id='type-id-139'>
      <member-type access='private'>
        <typedef-decl name='void_function' type-id='type-id-141' filepath='./src/gperftools/heap-checker.h' line='405' column='1' id='type-id-140'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='heap_cleanups_' type-id='type-id-142' mangled-name='_ZN11HeapCleaner14heap_cleanups_E' visibility='default' filepath='./src/gperftools/heap-checker.h' line='409' column='1' elf-symbol-id='_ZN11HeapCleaner14heap_cleanups_E'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapCleaner' mangled-name='_ZN11HeapCleanerC1EPFvvE' filepath='./src/gperftools/heap-checker.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleanerC1EPFvvE'>
          <parameter type-id='type-id-143' is-artificial='yes'/>
          <parameter type-id='type-id-140'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RunHeapCleanups' mangled-name='_ZN11HeapCleaner15RunHeapCleanupsEv' filepath='src/heap-checker.cc' line='1917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleaner15RunHeapCleanupsEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='MallocHook_NewHook' type-id='type-id-144' filepath='./src/gperftools/malloc_hook_c.h' line='70' column='1' id='type-id-145'/>
    <typedef-decl name='MallocHook_DeleteHook' type-id='type-id-146' filepath='./src/gperftools/malloc_hook_c.h' line='76' column='1' id='type-id-147'/>
    <typedef-decl name='MallocHook_MmapHook' type-id='type-id-148' filepath='./src/gperftools/malloc_hook_c.h' line='99' column='1' id='type-id-149'/>
    <typedef-decl name='MallocHook_SbrkHook' type-id='type-id-150' filepath='./src/gperftools/malloc_hook_c.h' line='144' column='1' id='type-id-151'/>
    <typedef-decl name='__intptr_t' type-id='type-id-152' filepath='/usr/include/bits/types.h' line='189' column='1' id='type-id-153'/>
    <typedef-decl name='off_t' type-id='type-id-154' filepath='/usr/include/sys/types.h' line='87' column='1' id='type-id-155'/>
    <typedef-decl name='_Atomic_word' type-id='type-id-1' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/x86_64-redhat-linux/bits/atomic_word.h' line='32' column='1' id='type-id-156'/>
    <class-decl name='AddressMap&lt;HeapProfileTable::AllocValue&gt;' size-in-bits='320' visibility='default' filepath='src/addressmap-inl.h' line='104' column='1' id='type-id-157'>
      <member-type access='private'>
        <class-decl name='Cluster' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-158'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-159'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Object' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-160'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kBlockBits' type-id='type-id-122' visibility='default' filepath='src/addressmap-inl.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kBlockSize' type-id='type-id-122' visibility='default' filepath='src/addressmap-inl.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterBits' type-id='type-id-122' visibility='default' filepath='src/addressmap-inl.h' line='172' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterSize' type-id='type-id-161' visibility='default' filepath='src/addressmap-inl.h' line='173' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterBlocks' type-id='type-id-122' visibility='default' filepath='src/addressmap-inl.h' line='174' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashBits' type-id='type-id-122' visibility='default' filepath='src/addressmap-inl.h' line='187' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashSize' type-id='type-id-122' visibility='default' filepath='src/addressmap-inl.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_COUNT' type-id='type-id-122' visibility='default' filepath='src/addressmap-inl.h' line='191' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='hashtable_' type-id='type-id-162' visibility='default' filepath='src/addressmap-inl.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='free_' type-id='type-id-163' visibility='default' filepath='src/addressmap-inl.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashMultiplier' type-id='type-id-164' visibility='default' filepath='src/addressmap-inl.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='alloc_' type-id='type-id-165' visibility='default' filepath='src/addressmap-inl.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='dealloc_' type-id='type-id-146' visibility='default' filepath='src/addressmap-inl.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='allocated_' type-id='type-id-166' visibility='default' filepath='src/addressmap-inl.h' line='253' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='AddressMap' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' filepath='src/addressmap-inl.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-165'/>
          <parameter type-id='type-id-146'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~AddressMap' filepath='src/addressmap-inl.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;void (*)(const void*, const HeapProfileTable::AllocInfo&amp;)&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' is-artificial='yes'/>
          <parameter type-id='type-id-169'/>
          <parameter type-id='type-id-170'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;char*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' is-artificial='yes'/>
          <parameter type-id='type-id-171'/>
          <parameter type-id='type-id-95'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Cluster*&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-162'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::AddNonLiveArgs*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' is-artificial='yes'/>
          <parameter type-id='type-id-172'/>
          <parameter type-id='type-id-173'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::Snapshot*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' is-artificial='yes'/>
          <parameter type-id='type-id-174'/>
          <parameter type-id='type-id-175'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Cluster&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-176'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Entry&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-163'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;const HeapProfileTable::DumpArgs&amp;&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' is-artificial='yes'/>
          <parameter type-id='type-id-177'/>
          <parameter type-id='type-id-178'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::Snapshot::ReportState*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' is-artificial='yes'/>
          <parameter type-id='type-id-179'/>
          <parameter type-id='type-id-180'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Insert' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' filepath='src/addressmap-inl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_'>
          <parameter type-id='type-id-181' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-58' name='key' filepath='src/addressmap-inl.h' line='309' column='1'/>
          <parameter type-id='type-id-182' name='value' filepath='src/addressmap-inl.h' line='309' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='GoogleInitializer' size-in-bits='128' visibility='default' filepath='src/base/googleinit.h' line='39' column='1' id='type-id-183'>
      <member-type access='private'>
        <typedef-decl name='VoidFunction' type-id='type-id-141' filepath='src/base/googleinit.h' line='41' column='1' id='type-id-184'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='name_' type-id='type-id-185' visibility='default' filepath='src/base/googleinit.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='destructor_' type-id='type-id-186' visibility='default' filepath='src/base/googleinit.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='GoogleInitializer' filepath='src/base/googleinit.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-187' is-artificial='yes'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-184'/>
          <parameter type-id='type-id-184'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-187' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='LowLevelAlloc' size-in-bits='8' visibility='default' filepath='src/base/low_level_alloc.h' line='44' column='1' id='type-id-188'>
      <member-type access='private'>
        <class-decl name='Arena' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='184' column='1' is-declaration-only='yes' id='type-id-189'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='mu' type-id='type-id-190' visibility='default' filepath='src/base/low_level_alloc.cc' line='189' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='freelist' type-id='type-id-76' visibility='default' filepath='src/base/low_level_alloc.cc' line='191' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2304'>
            <var-decl name='allocation_count' type-id='type-id-70' visibility='default' filepath='src/base/low_level_alloc.cc' line='192' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2336'>
            <var-decl name='flags' type-id='type-id-70' visibility='default' filepath='src/base/low_level_alloc.cc' line='193' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2368'>
            <var-decl name='pagesize' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='194' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2432'>
            <var-decl name='roundup' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='195' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2496'>
            <var-decl name='min_size' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='197' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-79' is-artificial='yes'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-79' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-function access='private' static='yes'>
        <function-decl name='DefaultArena' mangled-name='_ZN13LowLevelAlloc12DefaultArenaEv' filepath='src/base/low_level_alloc.cc' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc12DefaultArenaEv'>
          <return type-id='type-id-79'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocWithArena' mangled-name='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE'>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NewArena' mangled-name='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE'>
          <parameter type-id='type-id-70'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-79'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Alloc' mangled-name='_ZN13LowLevelAlloc5AllocEm' filepath='src/base/low_level_alloc.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc5AllocEm'>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Free' mangled-name='_ZN13LowLevelAlloc4FreeEPv' filepath='src/base/low_level_alloc.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc4FreeEPv'>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DeleteArena' mangled-name='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE'>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-191'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-192' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-192' is-artificial='yes'/>
          <parameter type-id='type-id-193'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-192' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-194'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <parameter type-id='type-id-196'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-197'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <parameter type-id='type-id-199'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <parameter type-id='type-id-200'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-201'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-202' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-202' is-artificial='yes'/>
          <parameter type-id='type-id-200'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-202' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-203'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <parameter type-id='type-id-205'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-206'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <parameter type-id='type-id-208'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-209'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-210' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-210' is-artificial='yes'/>
          <parameter type-id='type-id-211'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-210' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-212'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-213' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-213' is-artificial='yes'/>
          <parameter type-id='type-id-214'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-213' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-213' is-artificial='yes'/>
          <parameter type-id='type-id-205'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-215'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <parameter type-id='type-id-217'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <parameter type-id='type-id-208'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-218'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-219' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-219' is-artificial='yes'/>
          <parameter type-id='type-id-220'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-219' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-219' is-artificial='yes'/>
          <parameter type-id='type-id-211'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;void*, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-221'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapLeakChecker' size-in-bits='448' visibility='default' filepath='src/gperftools/heap-checker.h' line='78' column='1' id='type-id-224'>
      <member-type access='private'>
        <class-decl name='Disabler' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='175' column='1' id='type-id-225'>
          <member-function access='private' constructor='yes'>
            <function-decl name='Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerC1Ev' filepath='./src/gperftools/heap-checker.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerC1Ev'>
              <parameter type-id='type-id-226' is-artificial='yes'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerD1Ev' filepath='./src/gperftools/heap-checker.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerD1Ev'>
              <parameter type-id='type-id-226' is-artificial='yes'/>
              <parameter type-id='type-id-1' is-artificial='yes'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='Disabler' filepath='./src/gperftools/heap-checker.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-226' is-artificial='yes'/>
              <parameter type-id='type-id-227'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ShouldSymbolize' filepath='./src/gperftools/heap-checker.h' line='225' column='1' id='type-id-228'>
          <underlying-type type-id='type-id-229'/>
          <enumerator name='SYMBOLIZE' value='0'/>
          <enumerator name='DO_NOT_SYMBOLIZE' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsTask' filepath='./src/gperftools/heap-checker.h' line='295' column='1' id='type-id-230'>
          <underlying-type type-id='type-id-229'/>
          <enumerator name='RECORD_GLOBAL_DATA' value='0'/>
          <enumerator name='DISABLE_LIBRARY_ALLOCS' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsResult' filepath='./src/gperftools/heap-checker.h' line='301' column='1' id='type-id-231'>
          <underlying-type type-id='type-id-229'/>
          <enumerator name='PROC_MAPS_USED' value='0'/>
          <enumerator name='CANT_OPEN_PROC_MAPS' value='1'/>
          <enumerator name='NO_SHARED_LIBS_IN_PROC_MAPS' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Allocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='292' column='1' id='type-id-232'>
          <data-member access='private' static='yes'>
            <var-decl name='arena_' type-id='type-id-79' mangled-name='_ZN15HeapLeakChecker9Allocator6arena_E' visibility='default' filepath='src/heap-checker.cc' line='333' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator6arena_E'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='alloc_count_' type-id='type-id-1' mangled-name='_ZN15HeapLeakChecker9Allocator12alloc_count_E' visibility='default' filepath='src/heap-checker.cc' line='334' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator12alloc_count_E'/>
          </data-member>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;DisabledRangeMap&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-233'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;GlobalRegionCallerRangeMap&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-234'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;HeapProfileTable&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-235'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNullIfNot&lt;DisabledRangeMap&gt;' filepath='src/heap-checker.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-233'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;LibraryLiveObjectsStacks&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-236'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;LiveObjectsStack&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-237'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;StackTopSet&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-238'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNullIfNot&lt;GlobalRegionCallerRangeMap&gt;' filepath='src/heap-checker.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-234'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Allocate' mangled-name='_ZN15HeapLeakChecker9Allocator8AllocateEm' filepath='src/heap-checker.cc' line='309' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator8AllocateEm'>
              <parameter type-id='type-id-62'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPv' filepath='src/heap-checker.cc' line='315' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator4FreeEPv'>
              <parameter type-id='type-id-58'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RangeValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='404' column='1' id='type-id-239'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_address' type-id='type-id-240' visibility='default' filepath='src/heap-checker.cc' line='405' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='max_depth' type-id='type-id-1' visibility='default' filepath='src/heap-checker.cc' line='406' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='lock_' type-id='type-id-241' visibility='default' filepath='./src/gperftools/heap-checker.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='name_' type-id='type-id-57' visibility='default' filepath='./src/gperftools/heap-checker.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='start_snapshot_' type-id='type-id-58' visibility='default' filepath='./src/gperftools/heap-checker.h' line='365' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='has_checked_' type-id='type-id-61' visibility='default' filepath='./src/gperftools/heap-checker.h' line='367' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='inuse_bytes_increase_' type-id='type-id-242' visibility='default' filepath='./src/gperftools/heap-checker.h' line='368' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='inuse_allocs_increase_' type-id='type-id-242' visibility='default' filepath='./src/gperftools/heap-checker.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='keep_profiles_' type-id='type-id-61' visibility='default' filepath='./src/gperftools/heap-checker.h' line='371' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1EPKc' filepath='./src/gperftools/heap-checker.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1EPKc'>
          <parameter type-id='type-id-243' is-artificial='yes'/>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerD1Ev' filepath='./src/gperftools/heap-checker.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerD1Ev'>
          <parameter type-id='type-id-243' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1Ev' filepath='./src/gperftools/heap-checker.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1Ev'>
          <parameter type-id='type-id-243' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' filepath='./src/gperftools/heap-checker.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-243' is-artificial='yes'/>
          <parameter type-id='type-id-244'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreObject&lt;char&gt;' filepath='./src/gperftools/heap-checker.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-95'/>
          <return type-id='type-id-95'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksIn' mangled-name='_ZN15HeapLeakChecker15DisableChecksInEPKc' filepath='src/heap-checker.cc' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DisableChecksInEPKc'>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeforeConstructorsLocked' mangled-name='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' filepath='src/heap-checker.cc' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeProfileNameLocked' mangled-name='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' filepath='src/heap-checker.cc' line='1564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker21MakeProfileNameLockedEv'>
          <parameter type-id='type-id-245' name='this' is-artificial='yes'/>
          <return type-id='type-id-95'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksFromToLocked' mangled-name='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' filepath='src/heap-checker.cc' line='2336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableLibraryAllocsLocked' mangled-name='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' filepath='src/heap-checker.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm'>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-240'/>
          <parameter type-id='type-id-240'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='TurnItselfOffLocked' mangled-name='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' filepath='src/heap-checker.cc' line='2229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker19TurnItselfOffLockedEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' filepath='src/heap-checker.cc' line='1392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_'>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetAllocCaller' mangled-name='_ZN15HeapLeakChecker14GetAllocCallerEPv' filepath='src/heap-checker.cc' line='2380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14GetAllocCallerEPv'>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CancelGlobalCheck' mangled-name='_ZN15HeapLeakChecker17CancelGlobalCheckEv' filepath='src/heap-checker.cc' line='2193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17CancelGlobalCheckEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GlobalChecker' mangled-name='_ZN15HeapLeakChecker13GlobalCheckerEv' filepath='src/heap-checker.cc' line='2181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13GlobalCheckerEv'>
          <return type-id='type-id-243'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsActive' mangled-name='_ZN15HeapLeakChecker8IsActiveEv' filepath='src/heap-checker.cc' line='1901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8IsActiveEv'>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ObjectsLeaked' mangled-name='_ZNK15HeapLeakChecker13ObjectsLeakedEv' filepath='src/heap-checker.cc' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker13ObjectsLeakedEv'>
          <parameter type-id='type-id-246' name='this' is-artificial='yes'/>
          <return type-id='type-id-242'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='BytesLeaked' mangled-name='_ZNK15HeapLeakChecker11BytesLeakedEv' filepath='src/heap-checker.cc' line='1637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker11BytesLeakedEv'>
          <parameter type-id='type-id-246' name='this' is-artificial='yes'/>
          <return type-id='type-id-242'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnIgnoreObject' mangled-name='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv'>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreNonThreadLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' filepath='src/heap-checker.cc' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoIgnoreObject' mangled-name='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv'>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Create' mangled-name='_ZN15HeapLeakChecker6CreateEPKcb' filepath='src/heap-checker.cc' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker6CreateEPKcb'>
          <parameter type-id='type-id-245' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-57' name='name' filepath='src/heap-checker.cc' line='1576' column='1'/>
          <parameter type-id='type-id-61' name='make_start_snapshot' filepath='src/heap-checker.cc' line='1576' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UseProcMapsLocked' mangled-name='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' filepath='src/heap-checker.cc' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE'>
          <parameter type-id='type-id-230'/>
          <return type-id='type-id-231'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveThreadsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' filepath='src/heap-checker.cc' line='1021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-68'/>
          <parameter type-id='type-id-69'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreAllLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' filepath='src/heap-checker.cc' line='1261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv'>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoNoLeaks' mangled-name='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='1712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE'>
          <parameter type-id='type-id-245' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-228' name='should_symbolize' filepath='src/heap-checker.cc' line='1712' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaksMaybeSymbolize' mangled-name='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='2141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE'>
          <parameter type-id='type-id-228'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaks' mangled-name='_ZN15HeapLeakChecker13NoGlobalLeaksEv' filepath='src/heap-checker.cc' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13NoGlobalLeaksEv'>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoMainHeapCheck' mangled-name='_ZN15HeapLeakChecker15DoMainHeapCheckEv' filepath='src/heap-checker.cc' line='2153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DoMainHeapCheckEv'>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreObject&lt;MallocExtension&gt;' filepath='src/gperftools/heap-checker.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247'/>
          <return type-id='type-id-247'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='ObjectPlacement' filepath='src/heap-checker.cc' line='345' column='1' id='type-id-248'>
      <underlying-type type-id='type-id-229'/>
      <enumerator name='MUST_BE_ON_HEAP' value='0'/>
      <enumerator name='IGNORED_ON_HEAP' value='1'/>
      <enumerator name='MAYBE_LIVE' value='2'/>
      <enumerator name='IN_GLOBAL_DATA' value='3'/>
      <enumerator name='THREAD_DATA' value='4'/>
      <enumerator name='THREAD_REGISTERS' value='5'/>
    </enum-decl>
    <class-decl name='AllocObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='356' column='1' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-58' visibility='default' filepath='src/heap-checker.cc' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-240' visibility='default' filepath='src/heap-checker.cc' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='place' type-id='type-id-248' visibility='default' filepath='src/heap-checker.cc' line='359' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AllocObject' filepath='src/heap-checker.cc' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-248'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='LiveObjectsStack' type-id='type-id-251' filepath='src/heap-checker.cc' line='384' column='1' id='type-id-252'/>
    <typedef-decl name='LibraryLiveObjectsStacks' type-id='type-id-253' filepath='src/heap-checker.cc' line='397' column='1' id='type-id-254'/>
    <typedef-decl name='DisabledRangeMap' type-id='type-id-255' filepath='src/heap-checker.cc' line='411' column='1' id='type-id-256'/>
    <typedef-decl name='StackTopSet' type-id='type-id-257' filepath='src/heap-checker.cc' line='422' column='1' id='type-id-258'/>
    <typedef-decl name='GlobalRegionCallerRangeMap' type-id='type-id-259' filepath='src/heap-checker.cc' line='432' column='1' id='type-id-260'/>
    <class-decl name='HeapProfileStats' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='54' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocs' type-id='type-id-70' visibility='default' filepath='src/heap-profile-stats.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='frees' type-id='type-id-70' visibility='default' filepath='src/heap-profile-stats.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alloc_size' type-id='type-id-81' visibility='default' filepath='src/heap-profile-stats.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='free_size' type-id='type-id-81' visibility='default' filepath='src/heap-profile-stats.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileBucket' size-in-bits='448' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='68' column='1' id='type-id-262'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-261'/>
      <data-member access='public' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='type-id-122' visibility='default' filepath='src/heap-profile-stats.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-240' visibility='default' filepath='src/heap-profile-stats.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-stats.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stack' type-id='type-id-130' visibility='default' filepath='src/heap-profile-stats.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='next' type-id='type-id-263' visibility='default' filepath='src/heap-profile-stats.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileTable' size-in-bits='832' visibility='default' filepath='src/heap-profile-table.h' line='51' column='1' id='type-id-264'>
      <member-type access='private'>
        <class-decl name='AllocInfo' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='66' column='1' id='type-id-265'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='object_size' type-id='type-id-62' visibility='default' filepath='src/heap-profile-table.h' line='67' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='call_stack' type-id='type-id-266' visibility='default' filepath='src/heap-profile-table.h' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='69' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='live' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='70' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='168'>
            <var-decl name='ignored' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='71' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocContextInfo' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='77' column='1' id='type-id-267'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-261'/>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='78' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='call_stack' type-id='type-id-266' visibility='default' filepath='src/heap-profile-table.h' line='79' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='Allocator' type-id='type-id-269' filepath='src/heap-profile-table.h' line='83' column='1' id='type-id-268'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='DeAllocator' type-id='type-id-146' filepath='src/heap-profile-table.h' line='84' column='1' id='type-id-270'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocIterator' type-id='type-id-170' filepath='src/heap-profile-table.h' line='138' column='1' id='type-id-271'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocContextIterator' type-id='type-id-273' filepath='src/heap-profile-table.h' line='147' column='1' id='type-id-272'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='190' column='1' id='type-id-182'>
          <member-type access='private'>
            <typedef-decl name='Bucket' type-id='type-id-262' filepath='src/heap-profile-table.h' line='187' column='1' id='type-id-274'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='bytes' type-id='type-id-62' visibility='default' filepath='src/heap-profile-table.h' line='197' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kLive' type-id='type-id-122' visibility='default' filepath='src/heap-profile-table.h' line='214' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kIgnore' type-id='type-id-122' visibility='default' filepath='src/heap-profile-table.h' line='215' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kMask' type-id='type-id-122' visibility='default' filepath='src/heap-profile-table.h' line='216' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='bucket_rep' type-id='type-id-240' visibility='default' filepath='src/heap-profile-table.h' line='218' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocationMap' type-id='type-id-157' filepath='src/heap-profile-table.h' line='224' column='1' id='type-id-275'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='BufferArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='227' column='1' id='type-id-276'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf' type-id='type-id-95' visibility='default' filepath='src/heap-profile-table.h' line='234' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='buflen' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='bufsize' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='236' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='BufferArgs' filepath='src/heap-profile-table.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-277' is-artificial='yes'/>
              <parameter type-id='type-id-95'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='BufferArgs' filepath='src/heap-profile-table.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-277' is-artificial='yes'/>
              <parameter type-id='type-id-278'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='DumpArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='242' column='1' id='type-id-279'>
          <member-type access='public'>
            <typedef-decl name='Stats' type-id='type-id-261' filepath='src/heap-profile-table.h' line='63' column='1' id='type-id-280'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='fd' type-id='type-id-72' visibility='default' filepath='src/heap-profile-table.h' line='248' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='profile_stats' type-id='type-id-281' visibility='default' filepath='src/heap-profile-table.h' line='249' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='DumpArgs' filepath='src/heap-profile-table.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-282' is-artificial='yes'/>
              <parameter type-id='type-id-72'/>
              <parameter type-id='type-id-281'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AddNonLiveArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='305' column='1' id='type-id-283'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='dest' type-id='type-id-175' visibility='default' filepath='src/heap-profile-table.h' line='306' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='base' type-id='type-id-175' visibility='default' filepath='src/heap-profile-table.h' line='307' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Snapshot' size-in-bits='768' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='347' column='1' id='type-id-284'>
          <member-type access='private'>
            <class-decl name='Entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='514' column='1' id='type-id-285'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='count' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='515' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='bytes' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='516' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='bucket' type-id='type-id-286' visibility='default' filepath='src/heap-profile-table.cc' line='517' column='1'/>
              </data-member>
              <member-function access='public' constructor='yes'>
                <function-decl name='Entry' filepath='src/heap-profile-table.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
                  <parameter type-id='type-id-287' is-artificial='yes'/>
                  <return type-id='type-id-60'/>
                </function-decl>
              </member-function>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='ReportState' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='528' column='1' id='type-id-288'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='buckets_' type-id='type-id-289' visibility='default' filepath='src/heap-profile-table.cc' line='529' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='total_' type-id='type-id-274' visibility='default' filepath='src/heap-profile-table.h' line='372' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='map_' type-id='type-id-275' visibility='default' filepath='src/heap-profile-table.h' line='376' column='1'/>
          </data-member>
          <member-function access='private' constructor='yes'>
            <function-decl name='Snapshot' filepath='src/heap-profile-table.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-175' is-artificial='yes'/>
              <parameter type-id='type-id-268'/>
              <parameter type-id='type-id-270'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='Snapshot' filepath='src/heap-profile-table.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-175' is-artificial='yes'/>
              <parameter type-id='type-id-290'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='ReportObject' mangled-name='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' filepath='src/heap-profile-table.cc' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc'>
              <parameter type-id='type-id-58'/>
              <parameter type-id='type-id-291'/>
              <parameter type-id='type-id-95'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportIndividualObjects' mangled-name='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' filepath='src/heap-profile-table.cc' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv'>
              <parameter type-id='type-id-292' name='this' is-artificial='yes'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='ReportCallback' mangled-name='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' filepath='src/heap-profile-table.cc' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE'>
              <parameter type-id='type-id-58'/>
              <parameter type-id='type-id-291'/>
              <parameter type-id='type-id-180'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportLeaks' mangled-name='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' filepath='src/heap-profile-table.cc' line='542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b'>
              <parameter type-id='type-id-292' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-57' name='checker_name' filepath='src/heap-profile-table.cc' line='542' column='1'/>
              <parameter type-id='type-id-57' name='filename' filepath='src/heap-profile-table.cc' line='543' column='1'/>
              <parameter type-id='type-id-61' name='should_symbolize' filepath='src/heap-profile-table.cc' line='544' column='1'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kFileExt' type-id='type-id-133' mangled-name='_ZN16HeapProfileTable8kFileExtE' visibility='default' filepath='src/heap-profile-table.h' line='55' column='1' elf-symbol-id='_ZN16HeapProfileTable8kFileExtE'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='type-id-122' mangled-name='_ZN16HeapProfileTable14kMaxStackDepthE' visibility='default' filepath='src/heap-profile-table.h' line='58' column='1' elf-symbol-id='_ZN16HeapProfileTable14kMaxStackDepthE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='alloc_' type-id='type-id-268' visibility='default' filepath='src/heap-profile-table.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='dealloc_' type-id='type-id-270' visibility='default' filepath='src/heap-profile-table.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='total_' type-id='type-id-274' visibility='default' filepath='src/heap-profile-table.h' line='330' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='profile_mmap_' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='bucket_table_' type-id='type-id-293' visibility='default' filepath='src/heap-profile-table.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='num_buckets_' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='address_map_' type-id='type-id-294' visibility='default' filepath='src/heap-profile-table.h' line='342' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapProfileTable' mangled-name='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' filepath='src/heap-profile-table.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb'>
          <parameter type-id='type-id-295' is-artificial='yes'/>
          <parameter type-id='type-id-268'/>
          <parameter type-id='type-id-270'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapProfileTable' mangled-name='_ZN16HeapProfileTableD1Ev' filepath='src/heap-profile-table.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableD1Ev'>
          <parameter type-id='type-id-295' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapProfileTable' filepath='src/heap-profile-table.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-295' is-artificial='yes'/>
          <parameter type-id='type-id-296'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MapArgsAllocIterator' mangled-name='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='276' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-291'/>
          <parameter type-id='type-id-271'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocValueSize' mangled-name='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='222' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE'>
          <parameter type-id='type-id-297' name='v' filepath='src/heap-profile-table.h' line='222' column='1'/>
          <return type-id='type-id-62'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ReleaseSnapshot' mangled-name='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-175' name='s' filepath='src/heap-profile-table.cc' line='485' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnparseBucket' mangled-name='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' filepath='src/heap-profile-table.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats'>
          <parameter type-id='type-id-299' name='b' filepath='src/heap-profile-table.cc' line='280' column='1'/>
          <parameter type-id='type-id-95' name='buf' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <parameter type-id='type-id-1' name='buflen' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <parameter type-id='type-id-1' name='bufsize' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <parameter type-id='type-id-57' name='extra' filepath='src/heap-profile-table.cc' line='282' column='1'/>
          <parameter type-id='type-id-281' name='profile_stats' filepath='src/heap-profile-table.cc' line='283' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpNonLiveIterator' mangled-name='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' filepath='src/heap-profile-table.cc' line='397' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE'>
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='397' column='1'/>
          <parameter type-id='type-id-291' name='v' filepath='src/heap-profile-table.cc' line='397' column='1'/>
          <parameter type-id='type-id-300' name='args' filepath='src/heap-profile-table.cc' line='398' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpBucketIterator' mangled-name='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' filepath='src/heap-profile-table.cc' line='390' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE'>
          <parameter type-id='type-id-301'/>
          <parameter type-id='type-id-277'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='GetBucket' mangled-name='_ZN16HeapProfileTable9GetBucketEiPKPKv' filepath='src/heap-profile-table.cc' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable9GetBucketEiPKPKv'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-1' name='depth' filepath='src/heap-profile-table.cc' line='167' column='1'/>
          <parameter type-id='type-id-266' name='key' filepath='src/heap-profile-table.cc' line='168' column='1'/>
          <return type-id='type-id-286'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetCallerStackTrace' mangled-name='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' filepath='src/heap-profile-table.cc' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-130'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeSortedBucketList' mangled-name='_ZNK16HeapProfileTable20MakeSortedBucketListEv' filepath='src/heap-profile-table.cc' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable20MakeSortedBucketListEv'>
          <parameter type-id='type-id-302' name='this' is-artificial='yes'/>
          <return type-id='type-id-293'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='IterateOrderedAllocContexts' mangled-name='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' filepath='src/heap-profile-table.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE'>
          <parameter type-id='type-id-302' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-272' name='callback' filepath='src/heap-profile-table.cc' line='330' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FillOrderedProfile' mangled-name='_ZNK16HeapProfileTable18FillOrderedProfileEPci' filepath='src/heap-profile-table.cc' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable18FillOrderedProfileEPci'>
          <parameter type-id='type-id-302' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-95' name='buf' filepath='src/heap-profile-table.cc' line='342' column='1'/>
          <parameter type-id='type-id-1' name='size' filepath='src/heap-profile-table.cc' line='342' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsIgnored' mangled-name='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' filepath='src/heap-profile-table.cc' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13MarkAsIgnoredEPKv'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='272' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='WriteProfile' mangled-name='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' filepath='src/heap-profile-table.cc' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE'>
          <parameter type-id='type-id-57' name='file_name' filepath='src/heap-profile-table.cc' line='432' column='1'/>
          <parameter type-id='type-id-299' name='total' filepath='src/heap-profile-table.cc' line='433' column='1'/>
          <parameter type-id='type-id-294' name='allocations' filepath='src/heap-profile-table.cc' line='434' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindInsideAlloc' mangled-name='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' filepath='src/heap-profile-table.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm'>
          <parameter type-id='type-id-302' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='253' column='1'/>
          <parameter type-id='type-id-62' name='max_size' filepath='src/heap-profile-table.cc' line='254' column='1'/>
          <parameter type-id='type-id-130' name='object_ptr' filepath='src/heap-profile-table.cc' line='255' column='1'/>
          <parameter type-id='type-id-303' name='object_size' filepath='src/heap-profile-table.cc' line='256' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddToSnapshot' mangled-name='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-291'/>
          <parameter type-id='type-id-175'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TakeSnapshot' mangled-name='_ZN16HeapProfileTable12TakeSnapshotEv' filepath='src/heap-profile-table.cc' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12TakeSnapshotEv'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <return type-id='type-id-175'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordAlloc' mangled-name='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' filepath='src/heap-profile-table.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <parameter type-id='type-id-62' name='bytes' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <parameter type-id='type-id-1' name='stack_depth' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <parameter type-id='type-id-266' name='call_stack' filepath='src/heap-profile-table.cc' line='212' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordFree' mangled-name='_ZN16HeapProfileTable10RecordFreeEPKv' filepath='src/heap-profile-table.cc' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10RecordFreeEPKv'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='272' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddIfNonLive' mangled-name='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' filepath='src/heap-profile-table.cc' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-291'/>
          <parameter type-id='type-id-173'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NonLiveSnapshot' mangled-name='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-175' name='base' filepath='src/heap-profile-table.cc' line='497' column='1'/>
          <return type-id='type-id-175'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsLive' mangled-name='_ZN16HeapProfileTable10MarkAsLiveEPKv' filepath='src/heap-profile-table.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10MarkAsLiveEPKv'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='263' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CleanupOldProfiles' mangled-name='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' filepath='src/heap-profile-table.cc' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18CleanupOldProfilesEPKc'>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAllocDetails' mangled-name='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' filepath='src/heap-profile-table.cc' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE'>
          <parameter type-id='type-id-302' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='242' column='1'/>
          <parameter type-id='type-id-304' name='info' filepath='src/heap-profile-table.cc' line='243' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAlloc' mangled-name='_ZNK16HeapProfileTable9FindAllocEPKvPm' filepath='src/heap-profile-table.cc' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable9FindAllocEPKvPm'>
          <parameter type-id='type-id-302' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='236' column='1'/>
          <parameter type-id='type-id-303' name='object_size' filepath='src/heap-profile-table.cc' line='236' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MemoryRegionMap' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='69' column='1' id='type-id-305'>
      <member-type access='private'>
        <union-decl name='RegionSetRep' size-in-bits='384' visibility='default' filepath='src/memory_region_map.cc' line='177' column='1' id='type-id-306'>
          <data-member access='public'>
            <var-decl name='rep' type-id='type-id-307' visibility='default' filepath='src/memory_region_map.cc' line='178' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='align_it' type-id='type-id-58' visibility='default' filepath='src/memory_region_map.cc' line='179' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='LockHolder' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='126' column='1' id='type-id-308'>
          <member-function access='private' constructor='yes'>
            <function-decl name='LockHolder' filepath='src/memory_region_map.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-309' is-artificial='yes'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~LockHolder' filepath='src/memory_region_map.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-309' is-artificial='yes'/>
              <parameter type-id='type-id-1' is-artificial='yes'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='LockHolder' filepath='src/memory_region_map.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-309' is-artificial='yes'/>
              <parameter type-id='type-id-310'/>
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Region' size-in-bits='2304' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='137' column='1' id='type-id-311'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_addr' type-id='type-id-240' visibility='default' filepath='src/memory_region_map.h' line='138' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='end_addr' type-id='type-id-240' visibility='default' filepath='src/memory_region_map.h' line='139' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='call_stack_depth' type-id='type-id-1' visibility='default' filepath='src/memory_region_map.h' line='140' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='call_stack' type-id='type-id-137' visibility='default' filepath='src/memory_region_map.h' line='141' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2240'>
            <var-decl name='is_stack' type-id='type-id-61' visibility='default' filepath='src/memory_region_map.h' line='143' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RegionCmp' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='245' column='1' id='type-id-312'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='MyAllocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='252' column='1' id='type-id-313'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionSet' type-id='type-id-315' filepath='src/memory_region_map.h' line='263' column='1' id='type-id-314'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionIterator' type-id='type-id-317' filepath='src/memory_region_map.h' line='268' column='1' id='type-id-316'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='client_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap13client_count_E' visibility='default' filepath='src/memory_region_map.h' line='292' column='1' elf-symbol-id='_ZN15MemoryRegionMap13client_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='max_stack_depth_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16max_stack_depth_E' visibility='default' filepath='src/memory_region_map.h' line='295' column='1' elf-symbol-id='_ZN15MemoryRegionMap16max_stack_depth_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='arena_' type-id='type-id-79' mangled-name='_ZN15MemoryRegionMap6arena_E' visibility='default' filepath='src/memory_region_map.h' line='298' column='1' elf-symbol-id='_ZN15MemoryRegionMap6arena_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='regions_' type-id='type-id-318' mangled-name='_ZN15MemoryRegionMap8regions_E' visibility='default' filepath='src/memory_region_map.h' line='306' column='1' elf-symbol-id='_ZN15MemoryRegionMap8regions_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='lock_' type-id='type-id-190' mangled-name='_ZN15MemoryRegionMap5lock_E' visibility='default' filepath='src/memory_region_map.h' line='309' column='1' elf-symbol-id='_ZN15MemoryRegionMap5lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='owner_lock_' type-id='type-id-190' mangled-name='_ZN15MemoryRegionMap11owner_lock_E' visibility='default' filepath='src/memory_region_map.h' line='311' column='1' elf-symbol-id='_ZN15MemoryRegionMap11owner_lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='recursion_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16recursion_count_E' visibility='default' filepath='src/memory_region_map.h' line='314' column='1' elf-symbol-id='_ZN15MemoryRegionMap16recursion_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='lock_owner_tid_' type-id='type-id-319' mangled-name='_ZN15MemoryRegionMap15lock_owner_tid_E' visibility='default' filepath='src/memory_region_map.h' line='316' column='1' elf-symbol-id='_ZN15MemoryRegionMap15lock_owner_tid_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='map_size_' type-id='type-id-81' mangled-name='_ZN15MemoryRegionMap9map_size_E' visibility='default' filepath='src/memory_region_map.h' line='319' column='1' elf-symbol-id='_ZN15MemoryRegionMap9map_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='unmap_size_' type-id='type-id-81' mangled-name='_ZN15MemoryRegionMap11unmap_size_E' visibility='default' filepath='src/memory_region_map.h' line='321' column='1' elf-symbol-id='_ZN15MemoryRegionMap11unmap_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='bucket_table_' type-id='type-id-320' mangled-name='_ZN15MemoryRegionMap13bucket_table_E' visibility='default' filepath='src/memory_region_map.h' line='324' column='1' elf-symbol-id='_ZN15MemoryRegionMap13bucket_table_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='num_buckets_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap12num_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='325' column='1' elf-symbol-id='_ZN15MemoryRegionMap12num_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap20saved_buckets_count_E' visibility='default' filepath='src/memory_region_map.h' line='337' column='1' elf-symbol-id='_ZN15MemoryRegionMap20saved_buckets_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_' type-id='type-id-321' mangled-name='_ZN15MemoryRegionMap14saved_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='343' column='1' elf-symbol-id='_ZN15MemoryRegionMap14saved_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_keys_' type-id='type-id-322' mangled-name='_ZN15MemoryRegionMap19saved_buckets_keys_E' visibility='default' filepath='src/memory_region_map.h' line='345' column='1' elf-symbol-id='_ZN15MemoryRegionMap19saved_buckets_keys_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='IterateBuckets&lt;HeapProfileTable::BufferArgs*&gt;' filepath='src/memory_region_map.h' line='402' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-323'/>
          <parameter type-id='type-id-277'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='HandleSavedRegionsLocked' mangled-name='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' filepath='src/memory_region_map.cc' line='487' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE'>
          <parameter type-id='type-id-324'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Unlock' mangled-name='_ZN15MemoryRegionMap6UnlockEv' filepath='src/memory_region_map.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap6UnlockEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LockIsHeld' mangled-name='_ZN15MemoryRegionMap10LockIsHeldEv' filepath='src/memory_region_map.cc' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10LockIsHeldEv'>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LogAllLocked' mangled-name='_ZN15MemoryRegionMap12LogAllLockedEv' filepath='src/memory_region_map.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap12LogAllLockedEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoInsertRegionLocked' mangled-name='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='443' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE'>
          <parameter type-id='type-id-325' name='region' filepath='src/memory_region_map.cc' line='443' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='EndRegionLocked' mangled-name='_ZN15MemoryRegionMap15EndRegionLockedEv' filepath='src/memory_region_map.cc' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap15EndRegionLockedEv'>
          <return type-id='type-id-316'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeginRegionLocked' mangled-name='_ZN15MemoryRegionMap17BeginRegionLockedEv' filepath='src/memory_region_map.cc' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17BeginRegionLockedEv'>
          <return type-id='type-id-316'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoFindRegionLocked' mangled-name='_ZN15MemoryRegionMap18DoFindRegionLockedEm' filepath='src/memory_region_map.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18DoFindRegionLockedEm'>
          <parameter type-id='type-id-240'/>
          <return type-id='type-id-326'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsRecordingLocked' mangled-name='_ZN15MemoryRegionMap17IsRecordingLockedEv' filepath='src/memory_region_map.cc' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17IsRecordingLockedEv'>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Lock' mangled-name='_ZN15MemoryRegionMap4LockEv' filepath='src/memory_region_map.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4LockEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindAndMarkStackRegion' mangled-name='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE'>
          <parameter type-id='type-id-240'/>
          <parameter type-id='type-id-327'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindRegion' mangled-name='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE'>
          <parameter type-id='type-id-240'/>
          <parameter type-id='type-id-327'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Shutdown' mangled-name='_ZN15MemoryRegionMap8ShutdownEv' filepath='src/memory_region_map.cc' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8ShutdownEv'>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Init' mangled-name='_ZN15MemoryRegionMap4InitEib' filepath='src/memory_region_map.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4InitEib'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RestoreSavedBucketsLocked' mangled-name='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv' filepath='src/memory_region_map.cc' line='499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv'>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetBucket' mangled-name='_ZN15MemoryRegionMap9GetBucketEiPKPKv' filepath='src/memory_region_map.cc' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap9GetBucketEiPKPKv'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-266'/>
          <return type-id='type-id-263'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemovalInBucket' mangled-name='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm' filepath='src/memory_region_map.cc' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-266'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='InsertRegionLocked' mangled-name='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='537' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE'>
          <parameter type-id='type-id-325' name='region' filepath='src/memory_region_map.cc' line='443' column='1'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionAddition' mangled-name='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm' filepath='src/memory_region_map.cc' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MmapHook' mangled-name='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil' filepath='src/memory_region_map.cc' line='762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-155'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemoval' mangled-name='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm' filepath='src/memory_region_map.cc' line='634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MunmapHook' mangled-name='_ZN15MemoryRegionMap10MunmapHookEPKvm' filepath='src/memory_region_map.cc' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MunmapHookEPKvm'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='SbrkHook' mangled-name='_ZN15MemoryRegionMap8SbrkHookEPKvl' filepath='src/memory_region_map.cc' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8SbrkHookEPKvl'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-328'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MremapHook' mangled-name='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_' filepath='src/memory_region_map.cc' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_'>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-58'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-166'/>
    <reference-type-def kind='lvalue' type-id='type-id-249' size-in-bits='64' id='type-id-329'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-330'/>
    <reference-type-def kind='lvalue' type-id='type-id-330' size-in-bits='64' id='type-id-331'/>
    <reference-type-def kind='lvalue' type-id='type-id-250' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-334'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-243'/>
    <qualified-type-def type-id='type-id-243' const='yes' id='type-id-245'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <reference-type-def kind='lvalue' type-id='type-id-239' size-in-bits='64' id='type-id-335'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-294'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-337'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-327'/>
    <qualified-type-def type-id='type-id-338' id='type-id-339'/>
    <reference-type-def kind='lvalue' type-id='type-id-191' size-in-bits='64' id='type-id-338'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <qualified-type-def type-id='type-id-192' const='yes' id='type-id-340'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <qualified-type-def type-id='type-id-195' const='yes' id='type-id-341'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-342'/>
    <reference-type-def kind='lvalue' type-id='type-id-201' size-in-bits='64' id='type-id-343'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <qualified-type-def type-id='type-id-202' const='yes' id='type-id-344'/>
    <reference-type-def kind='lvalue' type-id='type-id-203' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <qualified-type-def type-id='type-id-204' const='yes' id='type-id-346'/>
    <reference-type-def kind='lvalue' type-id='type-id-206' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-348'/>
    <reference-type-def kind='lvalue' type-id='type-id-209' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-210'/>
    <qualified-type-def type-id='type-id-210' const='yes' id='type-id-350'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <qualified-type-def type-id='type-id-213' const='yes' id='type-id-351'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-352'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-353'/>
    <reference-type-def kind='lvalue' type-id='type-id-221' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-222'/>
    <qualified-type-def type-id='type-id-222' const='yes' id='type-id-355'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-356'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-238'/>
    <reference-type-def kind='lvalue' type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-359'/>
    <qualified-type-def type-id='type-id-359' const='yes' id='type-id-360'/>
    <reference-type-def kind='lvalue' type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-363'/>
    <qualified-type-def type-id='type-id-363' const='yes' id='type-id-364'/>
    <reference-type-def kind='lvalue' type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-367'/>
    <reference-type-def kind='lvalue' type-id='type-id-368' size-in-bits='64' id='type-id-369'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-372'/>
    <qualified-type-def type-id='type-id-372' const='yes' id='type-id-373'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-377'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-378'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-168'/>
    <qualified-type-def type-id='type-id-249' const='yes' id='type-id-379'/>
    <qualified-type-def type-id='type-id-380' id='type-id-381'/>
    <reference-type-def kind='lvalue' type-id='type-id-379' size-in-bits='64' id='type-id-380'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-382'/>
    <qualified-type-def type-id='type-id-382' const='yes' id='type-id-383'/>
    <reference-type-def kind='lvalue' type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-186'/>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-385'/>
    <reference-type-def kind='lvalue' type-id='type-id-385' size-in-bits='64' id='type-id-244'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <qualified-type-def type-id='type-id-386' const='yes' id='type-id-246'/>
    <qualified-type-def type-id='type-id-225' const='yes' id='type-id-387'/>
    <reference-type-def kind='lvalue' type-id='type-id-387' size-in-bits='64' id='type-id-227'/>
    <qualified-type-def type-id='type-id-239' const='yes' id='type-id-388'/>
    <reference-type-def kind='lvalue' type-id='type-id-388' size-in-bits='64' id='type-id-389'/>
    <qualified-type-def type-id='type-id-261' const='yes' id='type-id-390'/>
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' id='type-id-391'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-392'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-393'/>
    <reference-type-def kind='lvalue' type-id='type-id-393' size-in-bits='64' id='type-id-296'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <qualified-type-def type-id='type-id-394' const='yes' id='type-id-302'/>
    <qualified-type-def type-id='type-id-267' const='yes' id='type-id-395'/>
    <reference-type-def kind='lvalue' type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <qualified-type-def type-id='type-id-265' const='yes' id='type-id-397'/>
    <reference-type-def kind='lvalue' type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <qualified-type-def type-id='type-id-182' const='yes' id='type-id-399'/>
    <reference-type-def kind='lvalue' type-id='type-id-399' size-in-bits='64' id='type-id-400'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-401'/>
    <qualified-type-def type-id='type-id-401' const='yes' id='type-id-402'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-403'/>
    <reference-type-def kind='lvalue' type-id='type-id-403' size-in-bits='64' id='type-id-404'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-301'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-405'/>
    <reference-type-def kind='lvalue' type-id='type-id-405' size-in-bits='64' id='type-id-278'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-406'/>
    <reference-type-def kind='lvalue' type-id='type-id-406' size-in-bits='64' id='type-id-178'/>
    <qualified-type-def type-id='type-id-280' const='yes' id='type-id-407'/>
    <reference-type-def kind='lvalue' type-id='type-id-407' size-in-bits='64' id='type-id-408'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-409'/>
    <reference-type-def kind='lvalue' type-id='type-id-409' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-410'/>
    <qualified-type-def type-id='type-id-410' const='yes' id='type-id-411'/>
    <qualified-type-def type-id='type-id-308' const='yes' id='type-id-412'/>
    <reference-type-def kind='lvalue' type-id='type-id-412' size-in-bits='64' id='type-id-310'/>
    <qualified-type-def type-id='type-id-311' const='yes' id='type-id-413'/>
    <reference-type-def kind='lvalue' type-id='type-id-413' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-326'/>
    <qualified-type-def type-id='type-id-326' const='yes' id='type-id-415'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-416'/>
    <reference-type-def kind='lvalue' type-id='type-id-416' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-417'/>
    <qualified-type-def type-id='type-id-417' const='yes' id='type-id-418'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-419'/>
    <qualified-type-def type-id='type-id-196' id='type-id-420'/>
    <reference-type-def kind='lvalue' type-id='type-id-419' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-421'/>
    <qualified-type-def type-id='type-id-421' const='yes' id='type-id-422'/>
    <qualified-type-def type-id='type-id-197' const='yes' id='type-id-423'/>
    <reference-type-def kind='lvalue' type-id='type-id-423' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-424'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-425'/>
    <reference-type-def kind='lvalue' type-id='type-id-425' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-426'/>
    <qualified-type-def type-id='type-id-203' const='yes' id='type-id-427'/>
    <reference-type-def kind='lvalue' type-id='type-id-427' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-429'/>
    <reference-type-def kind='lvalue' type-id='type-id-429' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-430'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-431'/>
    <reference-type-def kind='lvalue' type-id='type-id-431' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <qualified-type-def type-id='type-id-212' const='yes' id='type-id-433'/>
    <reference-type-def kind='lvalue' type-id='type-id-433' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-434'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-435'/>
    <reference-type-def kind='lvalue' type-id='type-id-435' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-436'/>
    <qualified-type-def type-id='type-id-218' const='yes' id='type-id-437'/>
    <reference-type-def kind='lvalue' type-id='type-id-437' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-438'/>
    <qualified-type-def type-id='type-id-221' const='yes' id='type-id-439'/>
    <reference-type-def kind='lvalue' type-id='type-id-439' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-440'/>
    <qualified-type-def type-id='type-id-440' const='yes' id='type-id-441'/>
    <qualified-type-def type-id='type-id-357' const='yes' id='type-id-442'/>
    <reference-type-def kind='lvalue' type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-444'/>
    <qualified-type-def type-id='type-id-444' const='yes' id='type-id-445'/>
    <qualified-type-def type-id='type-id-361' const='yes' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-448'/>
    <qualified-type-def type-id='type-id-448' const='yes' id='type-id-449'/>
    <qualified-type-def type-id='type-id-365' const='yes' id='type-id-450'/>
    <reference-type-def kind='lvalue' type-id='type-id-450' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-452'/>
    <qualified-type-def type-id='type-id-452' const='yes' id='type-id-453'/>
    <qualified-type-def type-id='type-id-368' const='yes' id='type-id-454'/>
    <reference-type-def kind='lvalue' type-id='type-id-454' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-454' size-in-bits='64' id='type-id-456'/>
    <qualified-type-def type-id='type-id-456' const='yes' id='type-id-457'/>
    <qualified-type-def type-id='type-id-371' const='yes' id='type-id-458'/>
    <reference-type-def kind='lvalue' type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-460'/>
    <qualified-type-def type-id='type-id-460' const='yes' id='type-id-461'/>
    <qualified-type-def type-id='type-id-374' const='yes' id='type-id-462'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-463'/>
    <qualified-type-def type-id='type-id-463' const='yes' id='type-id-464'/>
    <qualified-type-def type-id='type-id-376' const='yes' id='type-id-465'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-466'/>
    <qualified-type-def type-id='type-id-466' const='yes' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-468' size-in-bits='64' id='type-id-469'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-185'/>
    <reference-type-def kind='lvalue' type-id='type-id-185' size-in-bits='64' id='type-id-470'/>
    <qualified-type-def type-id='type-id-471' id='type-id-472'/>
    <reference-type-def kind='lvalue' type-id='type-id-94' size-in-bits='64' id='type-id-473'/>
    <qualified-type-def type-id='type-id-474' const='yes' id='type-id-475'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-476'/>
    <qualified-type-def type-id='type-id-476' const='yes' id='type-id-477'/>
    <qualified-type-def type-id='type-id-478' const='yes' id='type-id-479'/>
    <reference-type-def kind='lvalue' type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-481'/>
    <qualified-type-def type-id='type-id-481' const='yes' id='type-id-482'/>
    <qualified-type-def type-id='type-id-483' const='yes' id='type-id-484'/>
    <reference-type-def kind='lvalue' type-id='type-id-484' size-in-bits='64' id='type-id-485'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-486' const='yes' id='type-id-487'/>
    <qualified-type-def type-id='type-id-488' const='yes' id='type-id-489'/>
    <reference-type-def kind='lvalue' type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-491'/>
    <qualified-type-def type-id='type-id-491' const='yes' id='type-id-492'/>
    <qualified-type-def type-id='type-id-493' const='yes' id='type-id-494'/>
    <reference-type-def kind='lvalue' type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-496'/>
    <qualified-type-def type-id='type-id-496' const='yes' id='type-id-497'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-498'/>
    <qualified-type-def type-id='type-id-499' id='type-id-500'/>
    <reference-type-def kind='lvalue' type-id='type-id-498' size-in-bits='64' id='type-id-499'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-501'/>
    <qualified-type-def type-id='type-id-501' const='yes' id='type-id-502'/>
    <qualified-type-def type-id='type-id-503' const='yes' id='type-id-504'/>
    <qualified-type-def type-id='type-id-505' id='type-id-506'/>
    <reference-type-def kind='lvalue' type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-507'/>
    <qualified-type-def type-id='type-id-507' const='yes' id='type-id-508'/>
    <qualified-type-def type-id='type-id-509' const='yes' id='type-id-510'/>
    <qualified-type-def type-id='type-id-511' id='type-id-512'/>
    <reference-type-def kind='lvalue' type-id='type-id-510' size-in-bits='64' id='type-id-511'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' id='type-id-513'/>
    <qualified-type-def type-id='type-id-513' const='yes' id='type-id-514'/>
    <qualified-type-def type-id='type-id-515' const='yes' id='type-id-516'/>
    <qualified-type-def type-id='type-id-517' id='type-id-518'/>
    <reference-type-def kind='lvalue' type-id='type-id-516' size-in-bits='64' id='type-id-517'/>
    <pointer-type-def type-id='type-id-516' size-in-bits='64' id='type-id-519'/>
    <qualified-type-def type-id='type-id-519' const='yes' id='type-id-520'/>
    <qualified-type-def type-id='type-id-521' const='yes' id='type-id-522'/>
    <reference-type-def kind='lvalue' type-id='type-id-522' size-in-bits='64' id='type-id-523'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-524'/>
    <qualified-type-def type-id='type-id-525' const='yes' id='type-id-526'/>
    <reference-type-def kind='lvalue' type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <qualified-type-def type-id='type-id-528' const='yes' id='type-id-529'/>
    <qualified-type-def type-id='type-id-530' id='type-id-531'/>
    <reference-type-def kind='lvalue' type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-532' const='yes' id='type-id-533'/>
    <qualified-type-def type-id='type-id-534' const='yes' id='type-id-535'/>
    <qualified-type-def type-id='type-id-536' id='type-id-537'/>
    <reference-type-def kind='lvalue' type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-538'/>
    <qualified-type-def type-id='type-id-538' const='yes' id='type-id-539'/>
    <qualified-type-def type-id='type-id-540' const='yes' id='type-id-541'/>
    <qualified-type-def type-id='type-id-542' id='type-id-543'/>
    <reference-type-def kind='lvalue' type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-544'/>
    <qualified-type-def type-id='type-id-544' const='yes' id='type-id-545'/>
    <qualified-type-def type-id='type-id-546' const='yes' id='type-id-547'/>
    <qualified-type-def type-id='type-id-548' id='type-id-549'/>
    <reference-type-def kind='lvalue' type-id='type-id-547' size-in-bits='64' id='type-id-548'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-550'/>
    <qualified-type-def type-id='type-id-550' const='yes' id='type-id-551'/>
    <qualified-type-def type-id='type-id-552' const='yes' id='type-id-553'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-558'/>
    <qualified-type-def type-id='type-id-559' const='yes' id='type-id-560'/>
    <reference-type-def kind='lvalue' type-id='type-id-560' size-in-bits='64' id='type-id-561'/>
    <pointer-type-def type-id='type-id-560' size-in-bits='64' id='type-id-562'/>
    <qualified-type-def type-id='type-id-563' const='yes' id='type-id-564'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-565'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' id='type-id-566'/>
    <qualified-type-def type-id='type-id-567' const='yes' id='type-id-568'/>
    <reference-type-def kind='lvalue' type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-570'/>
    <qualified-type-def type-id='type-id-571' const='yes' id='type-id-572'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <qualified-type-def type-id='type-id-574' const='yes' id='type-id-575'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-576'/>
    <qualified-type-def type-id='type-id-576' const='yes' id='type-id-577'/>
    <qualified-type-def type-id='type-id-578' const='yes' id='type-id-579'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' id='type-id-580'/>
    <qualified-type-def type-id='type-id-580' const='yes' id='type-id-581'/>
    <qualified-type-def type-id='type-id-582' const='yes' id='type-id-583'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' id='type-id-584'/>
    <qualified-type-def type-id='type-id-584' const='yes' id='type-id-585'/>
    <qualified-type-def type-id='type-id-586' const='yes' id='type-id-587'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' id='type-id-588'/>
    <qualified-type-def type-id='type-id-588' const='yes' id='type-id-589'/>
    <qualified-type-def type-id='type-id-590' const='yes' id='type-id-591'/>
    <pointer-type-def type-id='type-id-591' size-in-bits='64' id='type-id-592'/>
    <qualified-type-def type-id='type-id-592' const='yes' id='type-id-593'/>
    <qualified-type-def type-id='type-id-594' const='yes' id='type-id-595'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' id='type-id-596'/>
    <qualified-type-def type-id='type-id-596' const='yes' id='type-id-597'/>
    <qualified-type-def type-id='type-id-598' id='type-id-599'/>
    <qualified-type-def type-id='type-id-600' const='yes' id='type-id-601'/>
    <reference-type-def kind='lvalue' type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <qualified-type-def type-id='type-id-603' const='yes' id='type-id-604'/>
    <qualified-type-def type-id='type-id-605' id='type-id-606'/>
    <reference-type-def kind='lvalue' type-id='type-id-604' size-in-bits='64' id='type-id-605'/>
    <pointer-type-def type-id='type-id-604' size-in-bits='64' id='type-id-607'/>
    <qualified-type-def type-id='type-id-607' const='yes' id='type-id-608'/>
    <qualified-type-def type-id='type-id-609' const='yes' id='type-id-610'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <qualified-type-def type-id='type-id-611' const='yes' id='type-id-612'/>
    <qualified-type-def type-id='type-id-613' id='type-id-614'/>
    <qualified-type-def type-id='type-id-615' const='yes' id='type-id-616'/>
    <qualified-type-def type-id='type-id-617' const='yes' id='type-id-618'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' id='type-id-619'/>
    <qualified-type-def type-id='type-id-620' const='yes' id='type-id-621'/>
    <qualified-type-def type-id='type-id-622' id='type-id-623'/>
    <reference-type-def kind='lvalue' type-id='type-id-621' size-in-bits='64' id='type-id-622'/>
    <pointer-type-def type-id='type-id-621' size-in-bits='64' id='type-id-624'/>
    <qualified-type-def type-id='type-id-625' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <qualified-type-def type-id='type-id-628' const='yes' id='type-id-629'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' id='type-id-630'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' id='type-id-631'/>
    <qualified-type-def type-id='type-id-631' const='yes' id='type-id-632'/>
    <qualified-type-def type-id='type-id-633' const='yes' id='type-id-634'/>
    <reference-type-def kind='lvalue' type-id='type-id-634' size-in-bits='64' id='type-id-635'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-636'/>
    <qualified-type-def type-id='type-id-636' const='yes' id='type-id-637'/>
    <qualified-type-def type-id='type-id-255' const='yes' id='type-id-638'/>
    <reference-type-def kind='lvalue' type-id='type-id-638' size-in-bits='64' id='type-id-639'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' id='type-id-640'/>
    <qualified-type-def type-id='type-id-259' const='yes' id='type-id-641'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-643'/>
    <qualified-type-def type-id='type-id-253' const='yes' id='type-id-644'/>
    <reference-type-def kind='lvalue' type-id='type-id-644' size-in-bits='64' id='type-id-645'/>
    <pointer-type-def type-id='type-id-644' size-in-bits='64' id='type-id-646'/>
    <qualified-type-def type-id='type-id-646' const='yes' id='type-id-647'/>
    <qualified-type-def type-id='type-id-648' const='yes' id='type-id-649'/>
    <qualified-type-def type-id='type-id-650' id='type-id-651'/>
    <reference-type-def kind='lvalue' type-id='type-id-649' size-in-bits='64' id='type-id-650'/>
    <pointer-type-def type-id='type-id-649' size-in-bits='64' id='type-id-652'/>
    <qualified-type-def type-id='type-id-653' const='yes' id='type-id-654'/>
    <qualified-type-def type-id='type-id-655' id='type-id-656'/>
    <reference-type-def kind='lvalue' type-id='type-id-654' size-in-bits='64' id='type-id-655'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-657'/>
    <qualified-type-def type-id='type-id-658' const='yes' id='type-id-659'/>
    <qualified-type-def type-id='type-id-660' id='type-id-661'/>
    <reference-type-def kind='lvalue' type-id='type-id-659' size-in-bits='64' id='type-id-660'/>
    <pointer-type-def type-id='type-id-659' size-in-bits='64' id='type-id-662'/>
    <qualified-type-def type-id='type-id-663' const='yes' id='type-id-664'/>
    <reference-type-def kind='lvalue' type-id='type-id-664' size-in-bits='64' id='type-id-665'/>
    <qualified-type-def type-id='type-id-666' const='yes' id='type-id-667'/>
    <reference-type-def kind='lvalue' type-id='type-id-667' size-in-bits='64' id='type-id-668'/>
    <qualified-type-def type-id='type-id-257' const='yes' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-669' size-in-bits='64' id='type-id-670'/>
    <pointer-type-def type-id='type-id-669' size-in-bits='64' id='type-id-671'/>
    <qualified-type-def type-id='type-id-671' const='yes' id='type-id-672'/>
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-673'/>
    <reference-type-def kind='lvalue' type-id='type-id-673' size-in-bits='64' id='type-id-674'/>
    <pointer-type-def type-id='type-id-673' size-in-bits='64' id='type-id-675'/>
    <qualified-type-def type-id='type-id-675' const='yes' id='type-id-676'/>
    <qualified-type-def type-id='type-id-677' const='yes' id='type-id-678'/>
    <reference-type-def kind='lvalue' type-id='type-id-678' size-in-bits='64' id='type-id-679'/>
    <pointer-type-def type-id='type-id-678' size-in-bits='64' id='type-id-680'/>
    <qualified-type-def type-id='type-id-680' const='yes' id='type-id-681'/>
    <qualified-type-def type-id='type-id-682' const='yes' id='type-id-683'/>
    <reference-type-def kind='lvalue' type-id='type-id-683' size-in-bits='64' id='type-id-684'/>
    <pointer-type-def type-id='type-id-683' size-in-bits='64' id='type-id-685'/>
    <qualified-type-def type-id='type-id-685' const='yes' id='type-id-686'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-164'/>
    <qualified-type-def type-id='type-id-687' id='type-id-688'/>
    <pointer-type-def type-id='type-id-689' size-in-bits='64' id='type-id-690'/>
    <reference-type-def kind='lvalue' type-id='type-id-478' size-in-bits='64' id='type-id-691'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-692'/>
    <qualified-type-def type-id='type-id-692' const='yes' id='type-id-693'/>
    <pointer-type-def type-id='type-id-694' size-in-bits='64' id='type-id-695'/>
    <qualified-type-def type-id='type-id-695' const='yes' id='type-id-696'/>
    <reference-type-def kind='lvalue' type-id='type-id-483' size-in-bits='64' id='type-id-697'/>
    <pointer-type-def type-id='type-id-483' size-in-bits='64' id='type-id-698'/>
    <qualified-type-def type-id='type-id-698' const='yes' id='type-id-699'/>
    <pointer-type-def type-id='type-id-700' size-in-bits='64' id='type-id-701'/>
    <qualified-type-def type-id='type-id-701' const='yes' id='type-id-702'/>
    <reference-type-def kind='lvalue' type-id='type-id-488' size-in-bits='64' id='type-id-703'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-704'/>
    <qualified-type-def type-id='type-id-704' const='yes' id='type-id-705'/>
    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-707'/>
    <qualified-type-def type-id='type-id-707' const='yes' id='type-id-708'/>
    <reference-type-def kind='lvalue' type-id='type-id-493' size-in-bits='64' id='type-id-709'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-710'/>
    <qualified-type-def type-id='type-id-710' const='yes' id='type-id-711'/>
    <pointer-type-def type-id='type-id-712' size-in-bits='64' id='type-id-713'/>
    <qualified-type-def type-id='type-id-713' const='yes' id='type-id-714'/>
    <reference-type-def kind='lvalue' type-id='type-id-317' size-in-bits='64' id='type-id-715'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-716'/>
    <qualified-type-def type-id='type-id-716' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-503' size-in-bits='64' id='type-id-718'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-719'/>
    <reference-type-def kind='lvalue' type-id='type-id-509' size-in-bits='64' id='type-id-720'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-721'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' id='type-id-722'/>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' id='type-id-723'/>
    <qualified-type-def type-id='type-id-723' const='yes' id='type-id-724'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' id='type-id-725'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-726'/>
    <qualified-type-def type-id='type-id-726' const='yes' id='type-id-727'/>
    <reference-type-def kind='lvalue' type-id='type-id-528' size-in-bits='64' id='type-id-728'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-729'/>
    <qualified-type-def type-id='type-id-729' const='yes' id='type-id-730'/>
    <reference-type-def kind='lvalue' type-id='type-id-534' size-in-bits='64' id='type-id-731'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-732'/>
    <qualified-type-def type-id='type-id-732' const='yes' id='type-id-733'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-734'/>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' id='type-id-735'/>
    <qualified-type-def type-id='type-id-735' const='yes' id='type-id-736'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-737'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-738'/>
    <qualified-type-def type-id='type-id-738' const='yes' id='type-id-739'/>
    <reference-type-def kind='lvalue' type-id='type-id-555' size-in-bits='64' id='type-id-740'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-741'/>
    <reference-type-def kind='lvalue' type-id='type-id-559' size-in-bits='64' id='type-id-742'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' id='type-id-743'/>
    <reference-type-def kind='lvalue' type-id='type-id-563' size-in-bits='64' id='type-id-744'/>
    <pointer-type-def type-id='type-id-563' size-in-bits='64' id='type-id-745'/>
    <reference-type-def kind='lvalue' type-id='type-id-567' size-in-bits='64' id='type-id-746'/>
    <pointer-type-def type-id='type-id-567' size-in-bits='64' id='type-id-747'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-748'/>
    <reference-type-def kind='lvalue' type-id='type-id-748' size-in-bits='64' id='type-id-749'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-750'/>
    <qualified-type-def type-id='type-id-750' const='yes' id='type-id-751'/>
    <pointer-type-def type-id='type-id-752' size-in-bits='64' id='type-id-753'/>
    <pointer-type-def type-id='type-id-590' size-in-bits='64' id='type-id-754'/>
    <qualified-type-def type-id='type-id-754' const='yes' id='type-id-755'/>
    <pointer-type-def type-id='type-id-756' size-in-bits='64' id='type-id-757'/>
    <pointer-type-def type-id='type-id-594' size-in-bits='64' id='type-id-758'/>
    <qualified-type-def type-id='type-id-758' const='yes' id='type-id-759'/>
    <pointer-type-def type-id='type-id-760' size-in-bits='64' id='type-id-761'/>
    <reference-type-def kind='lvalue' type-id='type-id-600' size-in-bits='64' id='type-id-762'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-763'/>
    <reference-type-def kind='lvalue' type-id='type-id-603' size-in-bits='64' id='type-id-764'/>
    <pointer-type-def type-id='type-id-603' size-in-bits='64' id='type-id-765'/>
    <pointer-type-def type-id='type-id-766' size-in-bits='64' id='type-id-767'/>
    <reference-type-def kind='lvalue' type-id='type-id-609' size-in-bits='64' id='type-id-768'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' id='type-id-769'/>
    <qualified-type-def type-id='type-id-769' const='yes' id='type-id-770'/>
    <qualified-type-def type-id='type-id-771' const='yes' id='type-id-772'/>
    <qualified-type-def type-id='type-id-773' const='yes' id='type-id-774'/>
    <qualified-type-def type-id='type-id-775' id='type-id-776'/>
    <reference-type-def kind='lvalue' type-id='type-id-620' size-in-bits='64' id='type-id-775'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' id='type-id-777'/>
    <reference-type-def kind='lvalue' type-id='type-id-255' size-in-bits='64' id='type-id-778'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-779'/>
    <qualified-type-def type-id='type-id-779' const='yes' id='type-id-780'/>
    <reference-type-def kind='lvalue' type-id='type-id-259' size-in-bits='64' id='type-id-781'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-782'/>
    <qualified-type-def type-id='type-id-782' const='yes' id='type-id-783'/>
    <reference-type-def kind='lvalue' type-id='type-id-253' size-in-bits='64' id='type-id-784'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-785'/>
    <qualified-type-def type-id='type-id-785' const='yes' id='type-id-786'/>
    <reference-type-def kind='lvalue' type-id='type-id-648' size-in-bits='64' id='type-id-787'/>
    <pointer-type-def type-id='type-id-648' size-in-bits='64' id='type-id-788'/>
    <reference-type-def kind='lvalue' type-id='type-id-653' size-in-bits='64' id='type-id-789'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-790'/>
    <reference-type-def kind='lvalue' type-id='type-id-658' size-in-bits='64' id='type-id-791'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' id='type-id-792'/>
    <pointer-type-def type-id='type-id-663' size-in-bits='64' id='type-id-793'/>
    <pointer-type-def type-id='type-id-666' size-in-bits='64' id='type-id-794'/>
    <pointer-type-def type-id='type-id-795' size-in-bits='64' id='type-id-796'/>
    <pointer-type-def type-id='type-id-797' size-in-bits='64' id='type-id-798'/>
    <pointer-type-def type-id='type-id-799' size-in-bits='64' id='type-id-800'/>
    <pointer-type-def type-id='type-id-801' size-in-bits='64' id='type-id-802'/>
    <pointer-type-def type-id='type-id-803' size-in-bits='64' id='type-id-804'/>
    <reference-type-def kind='lvalue' type-id='type-id-257' size-in-bits='64' id='type-id-805'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-806'/>
    <qualified-type-def type-id='type-id-806' const='yes' id='type-id-807'/>
    <qualified-type-def type-id='type-id-808' id='type-id-809'/>
    <reference-type-def kind='lvalue' type-id='type-id-251' size-in-bits='64' id='type-id-808'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-810'/>
    <qualified-type-def type-id='type-id-810' const='yes' id='type-id-811'/>
    <reference-type-def kind='lvalue' type-id='type-id-677' size-in-bits='64' id='type-id-812'/>
    <pointer-type-def type-id='type-id-677' size-in-bits='64' id='type-id-142'/>
    <qualified-type-def type-id='type-id-142' const='yes' id='type-id-813'/>
    <reference-type-def kind='lvalue' type-id='type-id-682' size-in-bits='64' id='type-id-814'/>
    <pointer-type-def type-id='type-id-682' size-in-bits='64' id='type-id-815'/>
    <qualified-type-def type-id='type-id-815' const='yes' id='type-id-816'/>
    <pointer-type-def type-id='type-id-817' size-in-bits='64' id='type-id-818'/>
    <reference-type-def kind='lvalue' type-id='type-id-5' size-in-bits='64' id='type-id-819'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-820'/>
    <qualified-type-def type-id='type-id-141' const='yes' id='type-id-821'/>
    <qualified-type-def type-id='type-id-822' id='type-id-823'/>
    <reference-type-def kind='lvalue' type-id='type-id-821' size-in-bits='64' id='type-id-822'/>
    <pointer-type-def type-id='type-id-821' size-in-bits='64' id='type-id-824'/>
    <reference-type-def kind='lvalue' type-id='type-id-141' size-in-bits='64' id='type-id-825'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-826'/>
    <qualified-type-def type-id='type-id-826' const='yes' id='type-id-827'/>
    <reference-type-def kind='lvalue' type-id='type-id-827' size-in-bits='64' id='type-id-828'/>
    <pointer-type-def type-id='type-id-829' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-830' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-831' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-832' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-833'/>
    <pointer-type-def type-id='type-id-834' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-835'/>
    <pointer-type-def type-id='type-id-836' size-in-bits='64' id='type-id-269'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-59'/>
    <qualified-type-def type-id='type-id-837' id='type-id-838'/>
    <reference-type-def kind='lvalue' type-id='type-id-59' size-in-bits='64' id='type-id-837'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-266'/>
    <reference-type-def kind='lvalue' type-id='type-id-58' size-in-bits='64' id='type-id-839'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-840'/>
    <reference-type-def kind='lvalue' type-id='type-id-840' size-in-bits='64' id='type-id-841'/>
    <namespace-decl name='std'>
      <class-decl name='allocator&lt;void (*)()&gt;' size-in-bits='8' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='87' column='1' id='type-id-600'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-371'/>
        <member-function access='private'>
          <function-decl name='allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-763' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-763' is-artificial='yes'/>
            <parameter type-id='type-id-602'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-763' is-artificial='yes'/>
            <parameter type-id='type-id-1' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__alloc_swap&lt;STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='148' column='1' id='type-id-842'/>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='105' column='1' id='type-id-603'>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='141' column='1' id='type-id-843'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-62' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='142' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-62' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='143' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-156' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='144' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='148' column='1' id='type-id-609'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-843'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-94' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='51' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-844' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep11_S_terminalE' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='56' column='1' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep11_S_terminalE'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='type-id-135' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep20_S_empty_rep_storageE' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='68' column='1' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep20_S_empty_rep_storageE'/>
            </data-member>
            <member-function access='public'>
              <function-decl name='_M_destroy' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_destroyERKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_destroyERKS4_'>
                <parameter type-id='type-id-770' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-420' name='__a' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='229' column='1'/>
                <return type-id='type-id-60'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_S_create' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep9_S_createEmmRKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep9_S_createEmmRKS4_'>
                <parameter type-id='type-id-62' name='__capacity' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='547' column='1'/>
                <parameter type-id='type-id-62' name='__old_capacity' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='547' column='1'/>
                <parameter type-id='type-id-420' name='__alloc' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='548' column='1'/>
                <return type-id='type-id-769'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='258' column='1' id='type-id-766'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-194'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-95' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='262' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Alloc_hider' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-767' is-artificial='yes'/>
                <parameter type-id='type-id-95'/>
                <parameter type-id='type-id-196'/>
                <return type-id='type-id-60'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='npos' type-id='type-id-94' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='270' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-766' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='274' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='2144' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <parameter type-id='type-id-196'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC1ERKS5_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC1ERKS5_'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <parameter type-id='type-id-605'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <parameter type-id='type-id-605'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-5'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <parameter type-id='type-id-605'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-196'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <parameter type-id='type-id-57'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-196'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC2EPKcRKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC2EPKcRKS4_'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <parameter type-id='type-id-57'/>
            <parameter type-id='type-id-196'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='220' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-71'/>
            <parameter type-id='type-id-196'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEED1Ev' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEED1Ev'>
            <parameter type-id='type-id-765' is-artificial='yes'/>
            <parameter type-id='type-id-1' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-57'/>
            <parameter type-id='type-id-57'/>
            <parameter type-id='type-id-196'/>
            <parameter type-id='type-id-845'/>
            <return type-id='type-id-95'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct_aux&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1539' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-57'/>
            <parameter type-id='type-id-57'/>
            <parameter type-id='type-id-196'/>
            <parameter type-id='type-id-846'/>
            <return type-id='type-id-95'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1556' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-57'/>
            <parameter type-id='type-id-57'/>
            <parameter type-id='type-id-196'/>
            <return type-id='type-id-95'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='char_traits&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='238' column='1' id='type-id-847'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-71' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='239' column='1' id='type-id-620'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-1' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='240' column='1' id='type-id-625'/>
        </member-type>
      </class-decl>
      <class-decl name='__false_type' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/cpp_type_traits.h' line='79' column='1' id='type-id-846'/>
      <class-decl name='__niter_base&lt;AllocObject*, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-848'/>
      <class-decl name='__niter_base&lt;__gnu_cxx::__normal_iterator&lt;AllocObject*, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-849'/>
      <class-decl name='__niter_base&lt;void (**)(), false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-850'/>
      <class-decl name='__niter_base&lt;void**, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-851'/>
      <class-decl name='__miter_base&lt;AllocObject*, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-852'/>
      <class-decl name='__miter_base&lt;__gnu_cxx::__normal_iterator&lt;AllocObject*, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-853'/>
      <class-decl name='__miter_base&lt;void (**)(), false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-854'/>
      <class-decl name='__miter_base&lt;void**, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-855'/>
      <class-decl name='__copy_move&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='335' column='1' id='type-id-856'>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_m&lt;AllocObject*, AllocObject*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-250'/>
            <parameter type-id='type-id-250'/>
            <parameter type-id='type-id-250'/>
            <return type-id='type-id-250'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__copy_move_backward&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='539' column='1' id='type-id-857'>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_move_b&lt;AllocObject*, AllocObject*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-250'/>
            <parameter type-id='type-id-250'/>
            <parameter type-id='type-id-250'/>
            <return type-id='type-id-250'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_move_b&lt;HeapProfileTable::Snapshot::Entry*, HeapProfileTable::Snapshot::Entry*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-287'/>
            <parameter type-id='type-id-287'/>
            <parameter type-id='type-id-287'/>
            <return type-id='type-id-287'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='unary_function&lt;long unsigned int, long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='type-id-858'/>
      <class-decl name='unary_function&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, const long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='type-id-859'/>
      <class-decl name='unary_function&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, const long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='type-id-860'/>
      <class-decl name='unary_function&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='type-id-861'/>
      <class-decl name='binary_function&lt;long unsigned int, long unsigned int, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='113' column='1' id='type-id-862'/>
      <class-decl name='binary_function&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='113' column='1' id='type-id-863'/>
      <class-decl name='less&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='227' column='1' id='type-id-628'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-862'/>
      </class-decl>
      <class-decl name='less&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='227' column='1' id='type-id-633'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-863'/>
      </class-decl>
      <class-decl name='_Identity&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='469' column='1' id='type-id-474'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-858'/>
      </class-decl>
      <class-decl name='_Select1st&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='482' column='1' id='type-id-574'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-859'/>
      </class-decl>
      <class-decl name='_Select1st&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='482' column='1' id='type-id-578'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-860'/>
      </class-decl>
      <class-decl name='_Select1st&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='482' column='1' id='type-id-582'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-861'/>
      </class-decl>
      <class-decl name='input_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_iterator_base_types.h' line='79' column='1' id='type-id-864'/>
      <class-decl name='forward_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_iterator_base_types.h' line='83' column='1' id='type-id-845'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-864'/>
      </class-decl>
      <class-decl name='bidirectional_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_iterator_base_types.h' line='86' column='1' id='type-id-865'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-845'/>
      </class-decl>
      <class-decl name='random_access_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_iterator_base_types.h' line='89' column='1' id='type-id-866'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-865'/>
      </class-decl>
      <class-decl name='map&lt;long unsigned int, HeapLeakChecker::RangeValue, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='87' column='1' id='type-id-255'>
        <member-type access='private'>
          <class-decl name='value_compare' visibility='default' is-declaration-only='yes' id='type-id-867'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-483' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='128' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-779' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-779' is-artificial='yes'/>
            <parameter type-id='type-id-630'/>
            <parameter type-id='type-id-214'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-779' is-artificial='yes'/>
            <parameter type-id='type-id-639'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='map&lt;long unsigned int, long unsigned int, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='87' column='1' id='type-id-259'>
        <member-type access='private'>
          <class-decl name='value_compare' visibility='default' is-declaration-only='yes' id='type-id-868'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-488' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='128' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-782' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-782' is-artificial='yes'/>
            <parameter type-id='type-id-630'/>
            <parameter type-id='type-id-217'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-782' is-artificial='yes'/>
            <parameter type-id='type-id-642'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='map&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt;, std::less&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;, STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='87' column='1' id='type-id-253'>
        <member-type access='private'>
          <class-decl name='value_compare' visibility='default' is-declaration-only='yes' id='type-id-869'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-493' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='128' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-785' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-785' is-artificial='yes'/>
            <parameter type-id='type-id-635'/>
            <parameter type-id='type-id-220'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='map' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-785' is-artificial='yes'/>
            <parameter type-id='type-id-645'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-648'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-689' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-239' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-788' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-788' is-artificial='yes'/>
            <parameter type-id='type-id-687'/>
            <parameter type-id='type-id-389'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair&lt;long unsigned int, HeapLeakChecker::RangeValue&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-788' is-artificial='yes'/>
            <parameter type-id='type-id-665'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;const long unsigned int, long unsigned int&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-653'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-689' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-5' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-790' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-790' is-artificial='yes'/>
            <parameter type-id='type-id-687'/>
            <parameter type-id='type-id-687'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair&lt;long unsigned int, long unsigned int&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-790' is-artificial='yes'/>
            <parameter type-id='type-id-668'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-658'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-604' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-251' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-792' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-792' is-artificial='yes'/>
            <parameter type-id='type-id-605'/>
            <parameter type-id='type-id-674'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;long unsigned int, HeapLeakChecker::RangeValue&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-663'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-5' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-239' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-793' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-793' is-artificial='yes'/>
            <parameter type-id='type-id-687'/>
            <parameter type-id='type-id-389'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;long unsigned int, long unsigned int&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-666'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-5' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-5' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-794' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-794' is-artificial='yes'/>
            <parameter type-id='type-id-687'/>
            <parameter type-id='type-id-687'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_const_iterator&lt;long unsigned int&gt;, bool&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-795'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-503' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-796' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-796' is-artificial='yes'/>
            <parameter type-id='type-id-505'/>
            <parameter type-id='type-id-469'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_iterator&lt;long unsigned int&gt;, bool&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-797'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-528' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-798' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-798' is-artificial='yes'/>
            <parameter type-id='type-id-530'/>
            <parameter type-id='type-id-469'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_iterator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, bool&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-799'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-534' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-800' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-800' is-artificial='yes'/>
            <parameter type-id='type-id-536'/>
            <parameter type-id='type-id-469'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_iterator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, bool&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-801'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-540' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-802' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-802' is-artificial='yes'/>
            <parameter type-id='type-id-542'/>
            <parameter type-id='type-id-469'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_iterator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;, bool&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-803'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-546' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-804' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='pair' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-804' is-artificial='yes'/>
            <parameter type-id='type-id-548'/>
            <parameter type-id='type-id-469'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='set&lt;long unsigned int, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_set.h' line='88' column='1' id='type-id-257'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-478' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_set.h' line='112' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='set' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_set.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-806' is-artificial='yes'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='set' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_set.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-806' is-artificial='yes'/>
            <parameter type-id='type-id-630'/>
            <parameter type-id='type-id-199'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
