<abi-corpus version='2.1'>
  <elf-needed>
    <dependency name='build/debug/third_party/boost-1.56.0/libboost_system.so'/>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN5boost10filesystem10is_symlinkENS0_11file_statusE' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost10filesystem11file_statusC1ENS0_9file_typeENS0_5permsE' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost10filesystem11file_statusC1Ev' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost10filesystem11file_statusC2ENS0_9file_typeENS0_5permsE' type='func-type' binding='weak-binding' visibility='default-visibility' alias='_ZN5boost10filesystem11file_statusC1ENS0_9file_typeENS0_5permsE' is-defined='yes'/>
    <elf-symbol name='_ZN5boost10filesystem11file_statusC2Ev' type='func-type' binding='weak-binding' visibility='default-visibility' alias='_ZN5boost10filesystem11file_statusC1Ev' is-defined='yes'/>

    <elf-symbol name='_ZSteqIcEbRKSaIT_ES3_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZSteqIcSt11char_traitsIcESaIcEEbRKSbIT_T0_T1_EPKS3_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZStltIcSt11char_traitsIcESaIcEEbRKSbIT_T0_T1_ES8_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZStneIcSt11char_traitsIcESaIcEEbRKSbIT_T0_T1_EPKS3_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZTIN5boost10filesystem16filesystem_errorE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost10filesystem6detail18utf8_codecvt_facetE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost12noncopyable_11noncopyableE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail15sp_counted_baseE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail17sp_counted_impl_pINS_10filesystem16filesystem_error5m_impEEE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail17sp_counted_impl_pINS_10filesystem6detail11dir_itr_impEEE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6system12system_errorE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6system14error_categoryE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost10filesystem16filesystem_errorE' size='39' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost10filesystem6detail18utf8_codecvt_facetE' size='48' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost12noncopyable_11noncopyableE' size='36' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail15sp_counted_baseE' size='33' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail17sp_counted_impl_pINS_10filesystem16filesystem_error5m_impEEE' size='77' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail17sp_counted_impl_pINS_10filesystem6detail11dir_itr_impEEE' size='73' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6system12system_errorE' size='30' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6system14error_categoryE' size='32' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN5boost10filesystem16filesystem_errorE' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN5boost10filesystem6detail18utf8_codecvt_facetE' size='88' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN5boost6detail15sp_counted_baseE' size='64' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN5boost6detail17sp_counted_impl_pINS_10filesystem16filesystem_error5m_impEEE' size='64' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN5boost6detail17sp_counted_impl_pINS_10filesystem6detail11dir_itr_impEEE' size='64' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN5boost6system12system_errorE' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN5boost6system14error_categoryE' size='72' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/third_party/boost-1.56.0/libs/filesystem/src/codecvt_error_category.cpp' comp-dir-path='/home/andrew/Documents/10gen/dev/src/mongodb' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' id='type-id-3'>
      <subrange length='1' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='160' id='type-id-6'>
      <subrange length='20' type-id='type-id-4' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32' id='type-id-8'>
      <subrange length='4' type-id='type-id-4' id='type-id-9'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-13'/>
    <type-decl name='float' size-in-bits='32' id='type-id-14'/>
    <type-decl name='int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-16'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-17'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-18'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-19'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-20'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-21'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-4'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-11'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-22'/>
    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='infinite' id='type-id-23'>
      <subrange length='infinite' id='type-id-24'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-25'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-26'/>
    <class-decl name='_G_fpos_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-27' visibility='default' filepath='/usr/include/_G_config.h' line='22' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-29' visibility='default' filepath='/usr/include/_G_config.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-30' visibility='default' filepath='/usr/include/_G_config.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_G_fpos_t' type-id='type-id-28' filepath='/usr/include/_G_config.h' line='25' column='1' id='type-id-27'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-31' filepath='/usr/include/libio.h' line='154' column='1' id='type-id-32'/>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='160' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-34' visibility='default' filepath='/usr/include/libio.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-35' visibility='default' filepath='/usr/include/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-15' visibility='default' filepath='/usr/include/libio.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='245' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-15' visibility='default' filepath='/usr/include/libio.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-37' visibility='default' filepath='/usr/include/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-34' visibility='default' filepath='/usr/include/libio.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-35' visibility='default' filepath='/usr/include/libio.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-15' visibility='default' filepath='/usr/include/libio.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-15' visibility='default' filepath='/usr/include/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-29' visibility='default' filepath='/usr/include/libio.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-25' visibility='default' filepath='/usr/include/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-21' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-39' visibility='default' filepath='/usr/include/libio.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-12' visibility='default' filepath='/usr/include/libio.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-12' visibility='default' filepath='/usr/include/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-12' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-12' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-40' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-15' visibility='default' filepath='/usr/include/libio.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-6' visibility='default' filepath='/usr/include/libio.h' line='310' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='53' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-37' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-36' filepath='/usr/include/stdio.h' line='48' column='1' id='type-id-42'/>
    <typedef-decl name='__FILE' type-id='type-id-36' filepath='/usr/include/stdio.h' line='64' column='1' id='type-id-43'/>
    <typedef-decl name='fpos_t' type-id='type-id-27' filepath='/usr/include/stdio.h' line='110' column='1' id='type-id-44'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-45' visibility='default' filepath='/usr/include/stdlib.h' line='98' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-15' visibility='default' filepath='/usr/include/stdlib.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-15' visibility='default' filepath='/usr/include/stdlib.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-46' filepath='/usr/include/stdlib.h' line='101' column='1' id='type-id-45'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-47' visibility='default' filepath='/usr/include/stdlib.h' line='106' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-17' visibility='default' filepath='/usr/include/stdlib.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-17' visibility='default' filepath='/usr/include/stdlib.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-48' filepath='/usr/include/stdlib.h' line='109' column='1' id='type-id-47'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-49' visibility='default' filepath='/usr/include/stdlib.h' line='118' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-18' visibility='default' filepath='/usr/include/stdlib.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-18' visibility='default' filepath='/usr/include/stdlib.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-50' filepath='/usr/include/stdlib.h' line='121' column='1' id='type-id-49'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-51' filepath='/usr/include/stdlib.h' line='741' column='1' id='type-id-52'/>
    <typedef-decl name='clock_t' type-id='type-id-53' filepath='/usr/include/time.h' line='59' column='1' id='type-id-54'/>
    <typedef-decl name='time_t' type-id='type-id-55' filepath='/usr/include/time.h' line='75' column='1' id='type-id-56'/>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-17' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-58' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-30' visibility='default' filepath='/usr/include/wchar.h' line='83' column='1' id='type-id-59'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/wchar.h' line='86' column='1' id='type-id-60'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-11' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-8' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-15' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-60' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-59' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-30'/>
    <typedef-decl name='mbstate_t' type-id='type-id-30' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-61'/>
    <typedef-decl name='wctype_t' type-id='type-id-22' filepath='/usr/include/wctype.h' line='52' column='1' id='type-id-62'/>
    <typedef-decl name='wctrans_t' type-id='type-id-63' filepath='/usr/include/wctype.h' line='186' column='1' id='type-id-64'/>
    <typedef-decl name='__int32_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-65'/>
    <typedef-decl name='__off_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='131' column='1' id='type-id-29'/>
    <typedef-decl name='__off64_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='132' column='1' id='type-id-39'/>
    <typedef-decl name='__clock_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' id='type-id-53'/>
    <typedef-decl name='__time_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='139' column='1' id='type-id-55'/>
    <typedef-decl name='_Atomic_word' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/c++/4.9/bits/atomic_word.h' line='32' column='1' id='type-id-66'/>
    <typedef-decl name='size_t' type-id='type-id-22' filepath='/usr/lib/gcc/x86_64-linux-gnu/4.9/include/stddef.h' line='212' column='1' id='type-id-40'/>
    <typedef-decl name='wint_t' type-id='type-id-11' filepath='/usr/lib/gcc/x86_64-linux-gnu/4.9/include/stddef.h' line='353' column='1' id='type-id-67'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-69'/>
    <reference-type-def kind='lvalue' type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-72'/>
    <reference-type-def kind='lvalue' type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <reference-type-def kind='lvalue' type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <reference-type-def kind='lvalue' type-id='type-id-2' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-37' const='yes' id='type-id-88'/>
    <reference-type-def kind='lvalue' type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-90'/>
    <qualified-type-def type-id='type-id-70' const='yes' id='type-id-91'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-92'/>
    <qualified-type-def type-id='type-id-73' const='yes' id='type-id-93'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-95'/>
    <reference-type-def kind='lvalue' type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-97'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-98'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-63'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-99'/>
    <qualified-type-def type-id='type-id-78' const='yes' id='type-id-100'/>
    <reference-type-def kind='lvalue' type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-102'/>
    <reference-type-def kind='lvalue' type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-104'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-105'/>
    <reference-type-def kind='lvalue' type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-107'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-108'/>
    <reference-type-def kind='lvalue' type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-110'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-111'/>
    <reference-type-def kind='lvalue' type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-58'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-113'/>
    <reference-type-def kind='lvalue' type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-115'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-116'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-118'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-119'/>
    <qualified-type-def type-id='type-id-61' const='yes' id='type-id-120'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <qualified-type-def type-id='type-id-122' const='yes' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <qualified-type-def type-id='type-id-125' const='yes' id='type-id-126'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-127'/>
    <qualified-type-def type-id='type-id-128' const='yes' id='type-id-129'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-131'/>
    <qualified-type-def type-id='type-id-132' const='yes' id='type-id-133'/>
    <reference-type-def kind='lvalue' type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <qualified-type-def type-id='type-id-135' const='yes' id='type-id-136'/>
    <reference-type-def kind='lvalue' type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-138'/>
    <qualified-type-def type-id='type-id-139' const='yes' id='type-id-140'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
    <qualified-type-def type-id='type-id-142' const='yes' id='type-id-143'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-145'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-148'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-149'/>
    <qualified-type-def type-id='type-id-150' const='yes' id='type-id-151'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-153'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-155'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-157'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-165'/>
    <reference-type-def kind='lvalue' type-id='type-id-135' size-in-bits='64' id='type-id-166'/>
    <reference-type-def kind='rvalue' type-id='type-id-135' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <reference-type-def kind='lvalue' type-id='type-id-139' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <namespace-decl name='std'>
      <class-decl name='allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/4.9/bits/allocator.h' line='92' column='1' id='type-id-132'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-76'/>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-182' filepath='/usr/include/c++/4.9/bits/allocator.h' line='95' column='1' id='type-id-181'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-87' filepath='/usr/include/c++/4.9/bits/allocator.h' line='99' column='1' id='type-id-183'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-112' filepath='/usr/include/c++/4.9/bits/allocator.h' line='100' column='1' id='type-id-184'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='allocator' filepath='/usr/include/c++/4.9/bits/allocator.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-165' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator' filepath='/usr/include/c++/4.9/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-165' is-artificial='yes'/>
            <parameter type-id='type-id-134'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' filepath='/usr/include/c++/4.9/bits/allocator.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-165' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='112' column='1' id='type-id-135'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-132' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='120' column='1' id='type-id-185'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-181' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='121' column='1' id='type-id-142'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-183' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='123' column='1' id='type-id-186'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-184' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='124' column='1' id='type-id-187'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-73' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='127' column='1' id='type-id-188'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-70' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='129' column='1' id='type-id-189'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-191' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='130' column='1' id='type-id-190'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-193' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='131' column='1' id='type-id-192'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='148' column='1' id='type-id-194'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-142' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='150' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-142' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='151' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-66' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='152' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='155' column='1' id='type-id-139'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-194'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-143' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.tcc' line='50' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-111' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.tcc' line='55' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='type-id-23' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.tcc' line='66' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='272' column='1' id='type-id-169'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-132'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-37' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='277' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Alloc_hider' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-170' is-artificial='yes'/>
                <parameter type-id='type-id-37'/>
                <parameter type-id='type-id-134'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-143' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='285' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-169' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='289' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-134'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-137'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-137'/>
            <parameter type-id='type-id-142'/>
            <parameter type-id='type-id-142'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='476' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-137'/>
            <parameter type-id='type-id-142'/>
            <parameter type-id='type-id-142'/>
            <parameter type-id='type-id-134'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-58'/>
            <parameter type-id='type-id-142'/>
            <parameter type-id='type-id-134'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='495' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-58'/>
            <parameter type-id='type-id-134'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-142'/>
            <parameter type-id='type-id-2'/>
            <parameter type-id='type-id-134'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='512' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-167'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='530' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-144'/>
            <parameter type-id='type-id-134'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='546' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='iterator_traits&lt;char*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='175' column='1' id='type-id-195'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-197' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='179' column='1' id='type-id-196'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-37' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='180' column='1' id='type-id-198'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-87' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='181' column='1' id='type-id-199'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;char const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='186' column='1' id='type-id-200'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-197' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='190' column='1' id='type-id-201'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-58' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='191' column='1' id='type-id-202'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-112' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='192' column='1' id='type-id-203'/>
        </member-type>
      </class-decl>
      <typedef-decl name='string' type-id='type-id-135' filepath='/usr/include/c++/4.9/bits/stringfwd.h' line='62' column='1' id='type-id-204'/>
      <class-decl name='initializer_list&lt;char&gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/4.9/initializer_list' line='47' column='1' id='type-id-144'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-182' filepath='/usr/include/c++/4.9/initializer_list' line='53' column='1' id='type-id-205'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-58' filepath='/usr/include/c++/4.9/initializer_list' line='54' column='1' id='type-id-206'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-58' filepath='/usr/include/c++/4.9/initializer_list' line='55' column='1' id='type-id-207'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-206' visibility='default' filepath='/usr/include/c++/4.9/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-205' visibility='default' filepath='/usr/include/c++/4.9/initializer_list' line='59' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='initializer_list' filepath='/usr/include/c++/4.9/initializer_list' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-173' is-artificial='yes'/>
            <parameter type-id='type-id-207'/>
            <parameter type-id='type-id-205'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='initializer_list' filepath='/usr/include/c++/4.9/initializer_list' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-173' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='integral_constant&lt;bool, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/type_traits' line='69' column='1' id='type-id-147'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1' filepath='/usr/include/c++/4.9/type_traits' line='72' column='1' id='type-id-208'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-99' mangled-name='_ZNSt17integral_constantIbLb0EE5valueE' visibility='default' filepath='/usr/include/c++/4.9/type_traits' line='71' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='integral_constant&lt;bool, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/type_traits' line='69' column='1' id='type-id-150'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1' filepath='/usr/include/c++/4.9/type_traits' line='72' column='1' id='type-id-209'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-99' mangled-name='_ZNSt17integral_constantIbLb1EE5valueE' visibility='default' filepath='/usr/include/c++/4.9/type_traits' line='71' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='size_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/c++/4.9/bits/c++config.h' line='188' column='1' id='type-id-182'/>
      <typedef-decl name='ptrdiff_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/c++/4.9/bits/c++config.h' line='189' column='1' id='type-id-197'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-191'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-193'/>
    </namespace-decl>
    <namespace-decl name='__gnu_cxx'>
      <class-decl name='__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='709' column='1' id='type-id-70'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-201' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='720' column='1' id='type-id-210'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-203' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='721' column='1' id='type-id-211'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-202' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='722' column='1' id='type-id-212'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-58' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='712' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='__normal_iterator' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='724' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-72' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__normal_iterator' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-72' is-artificial='yes'/>
            <parameter type-id='type-id-114'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator*' mangled-name='_ZNK9__gnu_cxx17__normal_iteratorIPKcSsEdeEv' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9__gnu_cxx17__normal_iteratorIPKcSsEdeEv'>
            <parameter type-id='type-id-92' is-artificial='yes'/>
            <return type-id='type-id-211'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator-' mangled-name='_ZNK9__gnu_cxx17__normal_iteratorIPKcSsEmiEl' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9__gnu_cxx17__normal_iteratorIPKcSsEmiEl'>
            <parameter type-id='type-id-92' is-artificial='yes'/>
            <parameter type-id='type-id-210'/>
            <return type-id='type-id-70'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__normal_iterator' mangled-name='_ZN9__gnu_cxx17__normal_iteratorIPKcSsEC2ERKS2_' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9__gnu_cxx17__normal_iteratorIPKcSsEC2ERKS2_'>
            <parameter type-id='type-id-72' is-artificial='yes'/>
            <parameter type-id='type-id-114'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='709' column='1' id='type-id-73'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-196' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='720' column='1' id='type-id-213'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-199' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='721' column='1' id='type-id-214'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-198' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='722' column='1' id='type-id-215'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-37' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='712' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='__normal_iterator' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='724' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-75' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__normal_iterator' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-75' is-artificial='yes'/>
            <parameter type-id='type-id-89'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator-' mangled-name='_ZNK9__gnu_cxx17__normal_iteratorIPcSsEmiEl' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9__gnu_cxx17__normal_iteratorIPcSsEmiEl'>
            <parameter type-id='type-id-94' is-artificial='yes'/>
            <parameter type-id='type-id-213'/>
            <return type-id='type-id-73'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator*' mangled-name='_ZNK9__gnu_cxx17__normal_iteratorIPcSsEdeEv' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9__gnu_cxx17__normal_iteratorIPcSsEdeEv'>
            <parameter type-id='type-id-94' is-artificial='yes'/>
            <return type-id='type-id-214'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__normal_iterator' mangled-name='_ZN9__gnu_cxx17__normal_iteratorIPcSsEC2ERKS1_' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9__gnu_cxx17__normal_iteratorIPcSsEC2ERKS1_'>
            <parameter type-id='type-id-75' is-artificial='yes'/>
            <parameter type-id='type-id-89'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='new_allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='58' column='1' id='type-id-76'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-182' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='61' column='1' id='type-id-216'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-37' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='63' column='1' id='type-id-217'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-58' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='64' column='1' id='type-id-218'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-87' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='65' column='1' id='type-id-219'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-112' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='66' column='1' id='type-id-220'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='new_allocator' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-77' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='new_allocator' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-77' is-artificial='yes'/>
            <parameter type-id='type-id-96'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~new_allocator' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-77' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='55' column='1' id='type-id-221'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-111' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-111' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIcE5__maxE' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-99' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='55' column='1' id='type-id-222'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-118' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIiE5__minE' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-118' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIiE5__maxE' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-99' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;long int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='55' column='1' id='type-id-223'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-119' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIlE5__minE' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-119' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIlE5__maxE' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-99' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='55' column='1' id='type-id-224'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-157' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-157' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-99' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-118' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerImE8__digitsE' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;short int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='55' column='1' id='type-id-225'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-131' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIsE5__minE' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-131' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIsE5__maxE' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-99' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_floating&lt;double&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='100' column='1' id='type-id-226'>
        <data-member access='public' static='yes'>
          <var-decl name='__max_digits10' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-99' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits10' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max_exponent10' type-id='type-id-118' mangled-name='_ZN9__gnu_cxx25__numeric_traits_floatingIdE16__max_exponent10E' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='108' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_floating&lt;float&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='100' column='1' id='type-id-227'>
        <data-member access='public' static='yes'>
          <var-decl name='__max_digits10' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-99' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits10' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max_exponent10' type-id='type-id-118' mangled-name='_ZN9__gnu_cxx25__numeric_traits_floatingIfE16__max_exponent10E' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='108' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_floating&lt;long double&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='100' column='1' id='type-id-228'>
        <data-member access='public' static='yes'>
          <var-decl name='__max_digits10' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-99' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits10' type-id='type-id-118' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max_exponent10' type-id='type-id-118' mangled-name='_ZN9__gnu_cxx25__numeric_traits_floatingIeE16__max_exponent10E' visibility='default' filepath='/usr/include/c++/4.9/ext/numeric_traits.h' line='108' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <function-decl name='setlocale' filepath='/usr/include/locale.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='localeconv' filepath='/usr/include/locale.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-163'/>
    </function-decl>
    <function-decl name='remove' filepath='/usr/include/stdio.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='tmpfile' filepath='/usr/include/stdio.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='tmpnam' filepath='/usr/include/stdio.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fopen' filepath='/usr/include/stdio.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='freopen' filepath='/usr/include/stdio.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='setbuf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='setvbuf' filepath='/usr/include/stdio.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fgetc' filepath='/usr/include/stdio.h' line='531' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getc' filepath='/usr/include/stdio.h' line='532' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getchar' filepath='/usr/include/stdio.h' line='538' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='gets' filepath='/usr/include/stdio.h' line='638' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='ungetc' filepath='/usr/include/stdio.h' line='702' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='709' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='749' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ftell' filepath='/usr/include/stdio.h' line='754' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='rewind' filepath='/usr/include/stdio.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='fgetpos' filepath='/usr/include/stdio.h' line='798' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-161'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fsetpos' filepath='/usr/include/stdio.h' line='803' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='clearerr' filepath='/usr/include/stdio.h' line='826' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='830' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='perror' filepath='/usr/include/stdio.h' line='846' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atof' filepath='/usr/include/stdlib.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='atol' filepath='/usr/include/stdlib.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atoll' filepath='/usr/include/stdlib.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtod' filepath='/usr/include/stdlib.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='strtof' filepath='/usr/include/stdlib.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='strtold' filepath='/usr/include/stdlib.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strtoll' filepath='/usr/include/stdlib.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rand' filepath='/usr/include/stdlib.h' line='374' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='srand' filepath='/usr/include/stdlib.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atexit' filepath='/usr/include/stdlib.h' line='519' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-178'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='quick_exit' filepath='/usr/include/stdlib.h' line='549' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='564' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='system' filepath='/usr/include/stdlib.h' line='716' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='754' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='qsort' filepath='/usr/include/stdlib.h' line='764' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='div' filepath='/usr/include/stdlib.h' line='788' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='ldiv' filepath='/usr/include/stdlib.h' line='790' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='lldiv' filepath='/usr/include/stdlib.h' line='796' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='mblen' filepath='/usr/include/stdlib.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mbtowc' filepath='/usr/include/stdlib.h' line='865' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wctomb' filepath='/usr/include/stdlib.h' line='869' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='873' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wcstombs' filepath='/usr/include/stdlib.h' line='876' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='clock' filepath='/usr/include/time.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='difftime' filepath='/usr/include/time.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='mktime' filepath='/usr/include/time.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-175'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='gmtime' filepath='/usr/include/time.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='localtime' filepath='/usr/include/time.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='asctime' filepath='/usr/include/time.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='ctime' filepath='/usr/include/time.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='/usr/include/wchar.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='wcsncpy' filepath='/usr/include/wchar.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='wcscat' filepath='/usr/include/wchar.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='wcsncat' filepath='/usr/include/wchar.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='wcscmp' filepath='/usr/include/wchar.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcsncmp' filepath='/usr/include/wchar.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='/usr/include/wchar.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='/usr/include/wchar.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wcscspn' filepath='/usr/include/wchar.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wcsspn' filepath='/usr/include/wchar.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wcstok' filepath='/usr/include/wchar.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='wcslen' filepath='/usr/include/wchar.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wmemcmp' filepath='/usr/include/wchar.h' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wmemcpy' filepath='/usr/include/wchar.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='wmemmove' filepath='/usr/include/wchar.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='wmemset' filepath='/usr/include/wchar.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='btowc' filepath='/usr/include/wchar.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='wctob' filepath='/usr/include/wchar.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mbsinit' filepath='/usr/include/wchar.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mbrtowc' filepath='/usr/include/wchar.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wcrtomb' filepath='/usr/include/wchar.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='mbrlen' filepath='/usr/include/wchar.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='mbsrtowcs' filepath='/usr/include/wchar.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wcsrtombs' filepath='/usr/include/wchar.h' line='414' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wcstod' filepath='/usr/include/wchar.h' line='450' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wcstof' filepath='/usr/include/wchar.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='wcstold' filepath='/usr/include/wchar.h' line='459' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wcstol' filepath='/usr/include/wchar.h' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='wcstoul' filepath='/usr/include/wchar.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='wcstoll' filepath='/usr/include/wchar.h' line='483' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='wcstoull' filepath='/usr/include/wchar.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fwide' filepath='/usr/include/wchar.h' line='587' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fwprintf' filepath='/usr/include/wchar.h' line='594' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-159'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wprintf' filepath='/usr/include/wchar.h' line='601' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='swprintf' filepath='/usr/include/wchar.h' line='604' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-159'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vfwprintf' filepath='/usr/include/wchar.h' line='612' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vwprintf' filepath='/usr/include/wchar.h' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vswprintf' filepath='/usr/include/wchar.h' line='625' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fwscanf' filepath='/usr/include/wchar.h' line='635' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-159'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wscanf' filepath='/usr/include/wchar.h' line='642' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='swscanf' filepath='/usr/include/wchar.h' line='645' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vfwscanf' filepath='/usr/include/wchar.h' line='689' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vwscanf' filepath='/usr/include/wchar.h' line='697' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vswscanf' filepath='/usr/include/wchar.h' line='701' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fgetwc' filepath='/usr/include/wchar.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='getwc' filepath='/usr/include/wchar.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='getwchar' filepath='/usr/include/wchar.h' line='752' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fputwc' filepath='/usr/include/wchar.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='putwc' filepath='/usr/include/wchar.h' line='760' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='putwchar' filepath='/usr/include/wchar.h' line='766' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fgetws' filepath='/usr/include/wchar.h' line='774' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='fputws' filepath='/usr/include/wchar.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ungetwc' filepath='/usr/include/wchar.h' line='789' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='/usr/include/wchar.h' line='855' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='wctype' filepath='/usr/include/wctype.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='iswctype' filepath='/usr/include/wctype.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wctrans' filepath='/usr/include/wctype.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='towctrans' filepath='/usr/include/wctype.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <namespace-decl name='boost'>
      <namespace-decl name='noncopyable_'>
        <class-decl name='noncopyable' size-in-bits='8' visibility='default' filepath='src/third_party/boost-1.56.0/boost/core/noncopyable.hpp' line='23' column='1' id='type-id-78'>
          <member-function access='protected' constructor='yes'>
            <function-decl name='noncopyable' filepath='src/third_party/boost-1.56.0/boost/core/noncopyable.hpp' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-80' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='protected' destructor='yes'>
            <function-decl name='~noncopyable' filepath='src/third_party/boost-1.56.0/boost/core/noncopyable.hpp' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-80' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='protected' constructor='yes'>
            <function-decl name='noncopyable' filepath='src/third_party/boost-1.56.0/boost/core/noncopyable.hpp' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-80' is-artificial='yes'/>
              <parameter type-id='type-id-101'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='protected' constructor='yes'>
            <function-decl name='noncopyable' mangled-name='_ZN5boost12noncopyable_11noncopyableC2Ev' filepath='src/third_party/boost-1.56.0/boost/core/noncopyable.hpp' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost12noncopyable_11noncopyableC2Ev'>
              <parameter type-id='type-id-80' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
      <namespace-decl name='filesystem'>
        <function-decl name='codecvt_error_category' mangled-name='_ZN5boost10filesystem22codecvt_error_categoryEv' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/codecvt_error_category.cpp' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem22codecvt_error_categoryEv'>
          <return type-id='type-id-103'/>
        </function-decl>
      </namespace-decl>
      <namespace-decl name='system'>
        <class-decl name='error_category' size-in-bits='64' visibility='default' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='185' column='1' id='type-id-81'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-78'/>
          <member-function access='public' const='yes'>
            <function-decl name='operator==' mangled-name='_ZNK5boost6system14error_categoryeqERKS1_' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost6system14error_categoryeqERKS1_'>
              <parameter type-id='type-id-104' is-artificial='yes'/>
              <parameter type-id='type-id-103'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~error_category' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-82' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~error_category' mangled-name='_ZN5boost6system14error_categoryD0Ev' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6system14error_categoryD0Ev'>
              <parameter type-id='type-id-82' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~error_category' mangled-name='_ZN5boost6system14error_categoryD2Ev' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6system14error_categoryD2Ev'>
              <parameter type-id='type-id-82' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes' vtable-offset='2'>
            <function-decl name='name' mangled-name='_ZNK5boost6system14error_category4nameEv' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-104' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes' vtable-offset='3'>
            <function-decl name='message' mangled-name='_ZNK5boost6system14error_category7messageEi' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-104' is-artificial='yes'/>
              <parameter type-id='type-id-15'/>
              <return type-id='type-id-204'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes' vtable-offset='4'>
            <function-decl name='default_error_condition' mangled-name='_ZNK5boost6system14error_category23default_error_conditionEi' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='492' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost6system14error_category23default_error_conditionEi'>
              <parameter type-id='type-id-104' is-artificial='yes'/>
              <parameter type-id='type-id-15'/>
              <return type-id='type-id-85'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes' vtable-offset='5'>
            <function-decl name='equivalent' mangled-name='_ZNK5boost6system14error_category10equivalentEiRKNS0_15error_conditionE' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost6system14error_category10equivalentEiRKNS0_15error_conditionE'>
              <parameter type-id='type-id-104' is-artificial='yes'/>
              <parameter type-id='type-id-15'/>
              <parameter type-id='type-id-109'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes' vtable-offset='6'>
            <function-decl name='equivalent' mangled-name='_ZNK5boost6system14error_category10equivalentERKNS0_10error_codeEi' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost6system14error_category10equivalentERKNS0_10error_codeEi'>
              <parameter type-id='type-id-104' is-artificial='yes'/>
              <parameter type-id='type-id-106'/>
              <parameter type-id='type-id-15'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='error_condition' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='230' column='1' id='type-id-85'>
          <member-type access='public'>
            <typedef-decl name='unspecified_bool_type' type-id='type-id-178' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='272' column='1' id='type-id-229'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_val' type-id='type-id-15' visibility='default' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='304' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='m_cat' type-id='type-id-104' visibility='default' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='305' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='error_condition' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-86' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='error_condition' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-86' is-artificial='yes'/>
              <parameter type-id='type-id-15'/>
              <parameter type-id='type-id-103'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='error_condition' mangled-name='_ZN5boost6system15error_conditionC2EiRKNS0_14error_categoryE' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6system15error_conditionC2EiRKNS0_14error_categoryE'>
              <parameter type-id='type-id-86' is-artificial='yes'/>
              <parameter type-id='type-id-15'/>
              <parameter type-id='type-id-103'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='error_code' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='317' column='1' id='type-id-83'>
          <member-type access='public'>
            <typedef-decl name='unspecified_bool_type' type-id='type-id-178' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='359' column='1' id='type-id-230'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_val' type-id='type-id-15' visibility='default' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='391' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='m_cat' type-id='type-id-104' visibility='default' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='392' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='error_code' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='322' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-84' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='error_code' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-84' is-artificial='yes'/>
              <parameter type-id='type-id-15'/>
              <parameter type-id='type-id-103'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='value' mangled-name='_ZNK5boost6system10error_code5valueEv' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost6system10error_code5valueEv'>
              <parameter type-id='type-id-107' is-artificial='yes'/>
              <return type-id='type-id-15'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='category' mangled-name='_ZNK5boost6system10error_code8categoryEv' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost6system10error_code8categoryEv'>
              <parameter type-id='type-id-107' is-artificial='yes'/>
              <return type-id='type-id-103'/>
            </function-decl>
          </member-function>
        </class-decl>
        <function-decl name='operator==' mangled-name='_ZN5boost6systemeqERKNS0_15error_conditionES3_' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6systemeqERKNS0_15error_conditionES3_'>
          <parameter type-id='type-id-109' name='lhs' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='288' column='1'/>
          <parameter type-id='type-id-109' name='rhs' filepath='src/third_party/boost-1.56.0/boost/system/error_code.hpp' line='289' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </namespace-decl>
    </namespace-decl>
    <namespace-decl name='mpl_'>
      <class-decl name='int_&lt;-1&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.56.0/boost/mpl/aux_/integral_wrapper.hpp' line='43' column='1' id='type-id-122'>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-118' mangled-name='_ZN4mpl_4int_ILin1EE5valueE' visibility='default' filepath='src/third_party/boost-1.56.0/boost/mpl/aux_/integral_wrapper.hpp' line='45' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='int_&lt;1&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.56.0/boost/mpl/aux_/integral_wrapper.hpp' line='43' column='1' id='type-id-125'>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-118' mangled-name='_ZN4mpl_4int_ILi1EE5valueE' visibility='default' filepath='src/third_party/boost-1.56.0/boost/mpl/aux_/integral_wrapper.hpp' line='45' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='int_&lt;3&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.56.0/boost/mpl/aux_/integral_wrapper.hpp' line='43' column='1' id='type-id-128'>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-118' mangled-name='_ZN4mpl_4int_ILi3EE5valueE' visibility='default' filepath='src/third_party/boost-1.56.0/boost/mpl/aux_/integral_wrapper.hpp' line='45' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <function-type size-in-bits='64' id='type-id-162'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-177'>
      <return type-id='type-id-31'/>
    </function-type>
    <type-decl name='void' id='type-id-31'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' comp-dir-path='/home/andrew/Documents/10gen/dev/src/mongodb' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-231' size-in-bits='infinite' id='type-id-232'>
      <subrange length='infinite' id='type-id-24'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-233' size-in-bits='infinite' id='type-id-234'>
      <subrange length='infinite' id='type-id-24'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-235'/>
    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='39936' id='type-id-236'>
      <subrange length='624' type-id='type-id-4' id='type-id-237'/>
    </array-type-def>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' filepath='/usr/include/_G_config.h' line='27' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-39' visibility='default' filepath='/usr/include/_G_config.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-30' visibility='default' filepath='/usr/include/_G_config.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_G_fpos64_t' type-id='type-id-239' filepath='/usr/include/_G_config.h' line='30' column='1' id='type-id-238'/>
    <typedef-decl name='uintmax_t' type-id='type-id-22' filepath='/usr/include/stdint.h' line='135' column='1' id='type-id-240'/>
    <typedef-decl name='fpos_t' type-id='type-id-238' filepath='/usr/include/stdio.h' line='112' column='1' id='type-id-241'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/wchar.h' line='83' column='1' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-15' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-60' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pthread_once_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='168' column='1' id='type-id-243'/>
    <typedef-decl name='__mode_t' type-id='type-id-11' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='129' column='1' id='type-id-244'/>
    <typedef-decl name='__gthread_once_t' type-id='type-id-243' filepath='/usr/include/x86_64-linux-gnu/c++/4.9/bits/gthr-default.h' line='49' column='1' id='type-id-245'/>
    <typedef-decl name='mode_t' type-id='type-id-244' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='70' column='1' id='type-id-246'/>
    <reference-type-def kind='lvalue' type-id='type-id-247' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-249'/>
    <reference-type-def kind='lvalue' type-id='type-id-250' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <reference-type-def kind='lvalue' type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-257'/>
    <reference-type-def kind='lvalue' type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <reference-type-def kind='rvalue' type-id='type-id-258' size-in-bits='64' id='type-id-260'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-261'/>
    <reference-type-def kind='lvalue' type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-264'/>
    <reference-type-def kind='lvalue' type-id='type-id-265' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-267'/>
    <reference-type-def kind='lvalue' type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-270'/>
    <reference-type-def kind='lvalue' type-id='type-id-271' size-in-bits='64' id='type-id-272'/>
    <reference-type-def kind='rvalue' type-id='type-id-271' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-274'/>
    <reference-type-def kind='lvalue' type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-277'/>
    <reference-type-def kind='lvalue' type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <reference-type-def kind='lvalue' type-id='type-id-279' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-281'/>
    <reference-type-def kind='lvalue' type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-288'/>
    <reference-type-def kind='lvalue' type-id='type-id-289' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-291'/>
    <reference-type-def kind='lvalue' type-id='type-id-291' size-in-bits='64' id='type-id-292'/>
    <reference-type-def kind='lvalue' type-id='type-id-293' size-in-bits='64' id='type-id-294'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-295'/>
    <reference-type-def kind='lvalue' type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-298'/>
    <reference-type-def kind='lvalue' type-id='type-id-299' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-306'/>
    <reference-type-def kind='lvalue' type-id='type-id-307' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-309'/>
    <reference-type-def kind='lvalue' type-id='type-id-310' size-in-bits='64' id='type-id-311'/>
    <reference-type-def kind='rvalue' type-id='type-id-310' size-in-bits='64' id='type-id-312'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-315'/>
    <reference-type-def kind='lvalue' type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <reference-type-def kind='rvalue' type-id='type-id-316' size-in-bits='64' id='type-id-318'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-319'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <reference-type-def kind='lvalue' type-id='type-id-83' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-324'/>
    <qualified-type-def type-id='type-id-247' const='yes' id='type-id-325'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-327'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <qualified-type-def type-id='type-id-253' const='yes' id='type-id-329'/>
    <reference-type-def kind='lvalue' type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-331'/>
    <qualified-type-def type-id='type-id-255' const='yes' id='type-id-332'/>
    <reference-type-def kind='lvalue' type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-334'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-335'/>
    <reference-type-def kind='lvalue' type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-337'/>
    <qualified-type-def type-id='type-id-262' const='yes' id='type-id-338'/>
    <reference-type-def kind='lvalue' type-id='type-id-338' size-in-bits='64' id='type-id-339'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-340'/>
    <qualified-type-def type-id='type-id-265' const='yes' id='type-id-341'/>
    <reference-type-def kind='lvalue' type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-343'/>
    <reference-type-def kind='lvalue' type-id='type-id-343' size-in-bits='64' id='type-id-344'/>
    <qualified-type-def type-id='type-id-345' const='yes' id='type-id-346'/>
    <reference-type-def kind='lvalue' type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-348'/>
    <reference-type-def kind='lvalue' type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-350'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-351'/>
    <reference-type-def kind='lvalue' type-id='type-id-351' size-in-bits='64' id='type-id-352'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-353'/>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-354'/>
    <reference-type-def kind='lvalue' type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-356'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-357'/>
    <reference-type-def kind='lvalue' type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-359'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-360'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-361'/>
    <qualified-type-def type-id='type-id-293' const='yes' id='type-id-362'/>
    <reference-type-def kind='lvalue' type-id='type-id-362' size-in-bits='64' id='type-id-363'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-364'/>
    <qualified-type-def type-id='type-id-365' const='yes' id='type-id-366'/>
    <reference-type-def kind='lvalue' type-id='type-id-366' size-in-bits='64' id='type-id-367'/>
    <qualified-type-def type-id='type-id-296' const='yes' id='type-id-368'/>
    <reference-type-def kind='lvalue' type-id='type-id-368' size-in-bits='64' id='type-id-369'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-370'/>
    <qualified-type-def type-id='type-id-371' const='yes' id='type-id-372'/>
    <reference-type-def kind='lvalue' type-id='type-id-372' size-in-bits='64' id='type-id-373'/>
    <qualified-type-def type-id='type-id-374' const='yes' id='type-id-375'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-378'/>
    <reference-type-def kind='lvalue' type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <qualified-type-def type-id='type-id-303' const='yes' id='type-id-380'/>
    <reference-type-def kind='lvalue' type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-382'/>
    <qualified-type-def type-id='type-id-305' const='yes' id='type-id-383'/>
    <reference-type-def kind='lvalue' type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-385'/>
    <qualified-type-def type-id='type-id-307' const='yes' id='type-id-386'/>
    <reference-type-def kind='lvalue' type-id='type-id-386' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-388'/>
    <qualified-type-def type-id='type-id-310' const='yes' id='type-id-389'/>
    <reference-type-def kind='lvalue' type-id='type-id-389' size-in-bits='64' id='type-id-390'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-391'/>
    <qualified-type-def type-id='type-id-316' const='yes' id='type-id-392'/>
    <reference-type-def kind='lvalue' type-id='type-id-392' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-394'/>
    <qualified-type-def type-id='type-id-323' const='yes' id='type-id-395'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-397'/>
    <qualified-type-def type-id='type-id-397' const='yes' id='type-id-398'/>
    <qualified-type-def type-id='type-id-241' const='yes' id='type-id-399'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-400'/>
    <qualified-type-def type-id='type-id-401' const='yes' id='type-id-402'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-403'/>
    <qualified-type-def type-id='type-id-404' const='yes' id='type-id-405'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-406'/>
    <qualified-type-def type-id='type-id-407' const='yes' id='type-id-408'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <qualified-type-def type-id='type-id-410' const='yes' id='type-id-411'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-412'/>
    <qualified-type-def type-id='type-id-413' const='yes' id='type-id-414'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <qualified-type-def type-id='type-id-416' const='yes' id='type-id-417'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-418'/>
    <qualified-type-def type-id='type-id-419' const='yes' id='type-id-420'/>
    <reference-type-def kind='lvalue' type-id='type-id-420' size-in-bits='64' id='type-id-421'/>
    <qualified-type-def type-id='type-id-422' const='yes' id='type-id-423'/>
    <reference-type-def kind='lvalue' type-id='type-id-423' size-in-bits='64' id='type-id-424'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-425'/>
    <qualified-type-def type-id='type-id-426' const='yes' id='type-id-427'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <qualified-type-def type-id='type-id-429' const='yes' id='type-id-430'/>
    <qualified-type-def type-id='type-id-431' const='yes' id='type-id-432'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-433'/>
    <qualified-type-def type-id='type-id-434' const='yes' id='type-id-435'/>
    <reference-type-def kind='lvalue' type-id='type-id-435' size-in-bits='64' id='type-id-436'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-437'/>
    <qualified-type-def type-id='type-id-438' const='yes' id='type-id-439'/>
    <reference-type-def kind='lvalue' type-id='type-id-439' size-in-bits='64' id='type-id-440'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-441'/>
    <qualified-type-def type-id='type-id-442' const='yes' id='type-id-443'/>
    <qualified-type-def type-id='type-id-444' const='yes' id='type-id-445'/>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' id='type-id-446'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <qualified-type-def type-id='type-id-448' const='yes' id='type-id-449'/>
    <reference-type-def kind='lvalue' type-id='type-id-449' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-233'/>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-451'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-452' const='yes' id='type-id-453'/>
    <qualified-type-def type-id='type-id-182' const='yes' id='type-id-454'/>
    <qualified-type-def type-id='type-id-204' const='yes' id='type-id-455'/>
    <reference-type-def kind='lvalue' type-id='type-id-455' size-in-bits='64' id='type-id-456'/>
    <qualified-type-def type-id='type-id-457' const='yes' id='type-id-458'/>
    <reference-type-def kind='lvalue' type-id='type-id-158' size-in-bits='64' id='type-id-459'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-460'/>
    <reference-type-def kind='lvalue' type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-463'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-464'/>
    <reference-type-def kind='lvalue' type-id='type-id-422' size-in-bits='64' id='type-id-465'/>
    <reference-type-def kind='rvalue' type-id='type-id-422' size-in-bits='64' id='type-id-466'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-467'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-469'/>
    <reference-type-def kind='lvalue' type-id='type-id-426' size-in-bits='64' id='type-id-470'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-471'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-472'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-473'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-475'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <reference-type-def kind='rvalue' type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <reference-type-def kind='rvalue' type-id='type-id-480' size-in-bits='64' id='type-id-481'/>
    <reference-type-def kind='lvalue' type-id='type-id-204' size-in-bits='64' id='type-id-482'/>
    <reference-type-def kind='lvalue' type-id='type-id-12' size-in-bits='64' id='type-id-483'/>
    <reference-type-def kind='lvalue' type-id='type-id-26' size-in-bits='64' id='type-id-484'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-485'/>
    <reference-type-def kind='lvalue' type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <namespace-decl name='std'>
      <class-decl name='allocator&lt;wchar_t&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/4.9/bits/allocator.h' line='92' column='1' id='type-id-419'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-253'/>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-182' filepath='/usr/include/c++/4.9/bits/allocator.h' line='95' column='1' id='type-id-487'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-484' filepath='/usr/include/c++/4.9/bits/allocator.h' line='99' column='1' id='type-id-488'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-459' filepath='/usr/include/c++/4.9/bits/allocator.h' line='100' column='1' id='type-id-489'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='allocator' filepath='/usr/include/c++/4.9/bits/allocator.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-464' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator' filepath='/usr/include/c++/4.9/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-464' is-artificial='yes'/>
            <parameter type-id='type-id-421'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' filepath='/usr/include/c++/4.9/bits/allocator.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-464' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='112' column='1' id='type-id-422'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-419' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='120' column='1' id='type-id-490'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-487' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='121' column='1' id='type-id-429'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-488' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='123' column='1' id='type-id-491'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-489' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='124' column='1' id='type-id-492'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-250' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='127' column='1' id='type-id-493'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-247' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='129' column='1' id='type-id-494'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-496' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='130' column='1' id='type-id-495'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-498' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='131' column='1' id='type-id-497'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='148' column='1' id='type-id-499'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-429' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='150' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-429' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='151' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-66' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='152' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='155' column='1' id='type-id-426'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-499'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-430' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.tcc' line='50' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-158' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.tcc' line='55' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='type-id-23' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.tcc' line='66' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='272' column='1' id='type-id-468'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-419'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-179' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='277' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Alloc_hider' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-469' is-artificial='yes'/>
                <parameter type-id='type-id-179'/>
                <parameter type-id='type-id-421'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-430' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='285' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-468' visibility='default' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='289' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-421'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-424'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-424'/>
            <parameter type-id='type-id-429'/>
            <parameter type-id='type-id-429'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='476' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-424'/>
            <parameter type-id='type-id-429'/>
            <parameter type-id='type-id-429'/>
            <parameter type-id='type-id-421'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-159'/>
            <parameter type-id='type-id-429'/>
            <parameter type-id='type-id-421'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='495' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-159'/>
            <parameter type-id='type-id-421'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-429'/>
            <parameter type-id='type-id-26'/>
            <parameter type-id='type-id-421'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='512' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-466'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='530' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-431'/>
            <parameter type-id='type-id-421'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~basic_string' filepath='/usr/include/c++/4.9/bits/basic_string.h' line='546' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-467' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__false_type' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/cpp_type_traits.h' line='83' column='1' id='type-id-500'/>
      <class-decl name='locale' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='62' column='1' id='type-id-434'>
        <member-type access='public'>
          <typedef-decl name='category' type-id='type-id-15' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='67' column='1' id='type-id-442'/>
        </member-type>
        <member-type access='public'>
          <class-decl name='id' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='436' column='1' id='type-id-448'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='_M_index' type-id='type-id-182' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='453' column='1'/>
            </data-member>
            <data-member access='private' static='yes'>
              <var-decl name='_S_refcount' type-id='type-id-66' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='456' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <function-decl name='id' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='461' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-475' is-artificial='yes'/>
                <parameter type-id='type-id-450'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='id' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-475' is-artificial='yes'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <class-decl name='_Impl' size-in-bits='320' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='475' column='1' id='type-id-438'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='_M_refcount' type-id='type-id-66' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='495' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='64'>
              <var-decl name='_M_facets' type-id='type-id-447' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='496' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='128'>
              <var-decl name='_M_facets_size' type-id='type-id-182' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='497' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='192'>
              <var-decl name='_M_caches' type-id='type-id-447' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='498' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <var-decl name='_M_names' type-id='type-id-90' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='499' column='1'/>
            </data-member>
            <data-member access='private' static='yes'>
              <var-decl name='_S_id_ctype' type-id='type-id-234' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='500' column='1'/>
            </data-member>
            <data-member access='private' static='yes'>
              <var-decl name='_S_id_numeric' type-id='type-id-234' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='501' column='1'/>
            </data-member>
            <data-member access='private' static='yes'>
              <var-decl name='_S_id_collate' type-id='type-id-234' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='502' column='1'/>
            </data-member>
            <data-member access='private' static='yes'>
              <var-decl name='_S_id_time' type-id='type-id-234' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='503' column='1'/>
            </data-member>
            <data-member access='private' static='yes'>
              <var-decl name='_S_id_monetary' type-id='type-id-234' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='504' column='1'/>
            </data-member>
            <data-member access='private' static='yes'>
              <var-decl name='_S_id_messages' type-id='type-id-234' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='505' column='1'/>
            </data-member>
            <data-member access='private' static='yes'>
              <var-decl name='_S_facet_categories' type-id='type-id-232' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='506' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <function-decl name='_Impl' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-474' is-artificial='yes'/>
                <parameter type-id='type-id-440'/>
                <parameter type-id='type-id-182'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
            <member-function access='private' constructor='yes'>
              <function-decl name='_Impl' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='528' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-474' is-artificial='yes'/>
                <parameter type-id='type-id-58'/>
                <parameter type-id='type-id-182'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
            <member-function access='private' constructor='yes'>
              <function-decl name='_Impl' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='529' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-474' is-artificial='yes'/>
                <parameter type-id='type-id-182'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
            <member-function access='private' destructor='yes'>
              <function-decl name='~_Impl' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='531' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-474' is-artificial='yes'/>
                <parameter type-id='type-id-15' is-artificial='yes'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
            <member-function access='private' constructor='yes'>
              <function-decl name='_Impl' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='533' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-474' is-artificial='yes'/>
                <parameter type-id='type-id-440'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='facet' visibility='default' is-declaration-only='yes' id='type-id-444'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='none' type-id='type-id-443' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='98' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='ctype' type-id='type-id-443' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='numeric' type-id='type-id-443' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='100' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='collate' type-id='type-id-443' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='101' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='time' type-id='type-id-443' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='monetary' type-id='type-id-443' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='messages' type-id='type-id-443' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='all' type-id='type-id-443' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='105' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-474' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='280' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='_S_classic' type-id='type-id-474' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='283' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='_S_global' type-id='type-id-474' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='286' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='_S_categories' type-id='type-id-398' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='292' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='_S_once' type-id='type-id-245' visibility='default' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='307' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='locale' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-473' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='locale' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-473' is-artificial='yes'/>
            <parameter type-id='type-id-436'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='locale' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-473' is-artificial='yes'/>
            <parameter type-id='type-id-58'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='locale' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-473' is-artificial='yes'/>
            <parameter type-id='type-id-436'/>
            <parameter type-id='type-id-58'/>
            <parameter type-id='type-id-442'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='locale' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-473' is-artificial='yes'/>
            <parameter type-id='type-id-436'/>
            <parameter type-id='type-id-436'/>
            <parameter type-id='type-id-442'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~locale' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-473' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='locale' filepath='/usr/include/c++/4.9/bits/locale_classes.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-473' is-artificial='yes'/>
            <parameter type-id='type-id-474'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='mersenne_twister_engine&lt;long unsigned int, 32ul, 624ul, 397ul, 31ul, 2567483615ul, 11ul, 4294967295ul, 7ul, 2636928640ul, 15ul, 4022730752ul, 18ul, 1812433253ul&gt;' size-in-bits='40000' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='451' column='1' id='type-id-476'>
        <member-type access='public'>
          <typedef-decl name='result_type' type-id='type-id-22' filepath='/usr/include/c++/4.9/bits/random.h' line='482' column='1' id='type-id-452'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='word_size' type-id='type-id-454' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='485' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='state_size' type-id='type-id-454' mangled-name='_ZNSt23mersenne_twister_engineImLm32ELm624ELm397ELm31ELm2567483615ELm11ELm4294967295ELm7ELm2636928640ELm15ELm4022730752ELm18ELm1812433253EE10state_sizeE' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='486' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='shift_size' type-id='type-id-454' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='487' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='mask_bits' type-id='type-id-454' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='488' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='xor_mask' type-id='type-id-453' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='489' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='tempering_u' type-id='type-id-454' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='490' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='tempering_d' type-id='type-id-453' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='491' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='tempering_s' type-id='type-id-454' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='492' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='tempering_b' type-id='type-id-453' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='493' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='tempering_t' type-id='type-id-454' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='494' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='tempering_c' type-id='type-id-453' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='495' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='tempering_l' type-id='type-id-454' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='496' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='initialization_multiplier' type-id='type-id-453' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='497' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='default_seed' type-id='type-id-453' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='498' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_x' type-id='type-id-236' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='621' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='39936'>
          <var-decl name='_M_p' type-id='type-id-182' visibility='default' filepath='/usr/include/c++/4.9/bits/random.h' line='622' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='mersenne_twister_engine' filepath='/usr/include/c++/4.9/bits/random.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-477' is-artificial='yes'/>
            <parameter type-id='type-id-452'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='input_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='89' column='1' id='type-id-501'/>
      <class-decl name='forward_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='95' column='1' id='type-id-502'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-501'/>
      </class-decl>
      <class-decl name='bidirectional_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='99' column='1' id='type-id-503'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-502'/>
      </class-decl>
      <class-decl name='random_access_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='103' column='1' id='type-id-504'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-503'/>
      </class-decl>
      <class-decl name='iterator_traits&lt;wchar_t*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='175' column='1' id='type-id-505'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-197' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='179' column='1' id='type-id-506'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-179' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='180' column='1' id='type-id-507'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-484' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='181' column='1' id='type-id-508'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;wchar_t const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='186' column='1' id='type-id-509'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-197' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='190' column='1' id='type-id-510'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-159' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='191' column='1' id='type-id-511'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-459' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='192' column='1' id='type-id-512'/>
        </member-type>
      </class-decl>
      <typedef-decl name='wstring' type-id='type-id-422' filepath='/usr/include/c++/4.9/bits/stringfwd.h' line='68' column='1' id='type-id-457'/>
      <class-decl name='initializer_list&lt;wchar_t&gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/4.9/initializer_list' line='47' column='1' id='type-id-431'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-182' filepath='/usr/include/c++/4.9/initializer_list' line='53' column='1' id='type-id-513'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-159' filepath='/usr/include/c++/4.9/initializer_list' line='54' column='1' id='type-id-514'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-159' filepath='/usr/include/c++/4.9/initializer_list' line='55' column='1' id='type-id-515'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-514' visibility='default' filepath='/usr/include/c++/4.9/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-513' visibility='default' filepath='/usr/include/c++/4.9/initializer_list' line='59' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='initializer_list' filepath='/usr/include/c++/4.9/initializer_list' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-472' is-artificial='yes'/>
            <parameter type-id='type-id-515'/>
            <parameter type-id='type-id-513'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='initializer_list' filepath='/usr/include/c++/4.9/initializer_list' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-472' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='remove_reference&lt;boost::filesystem::detail::dir_itr_imp*&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/type_traits' line='1504' column='1' id='type-id-516'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-277' filepath='/usr/include/c++/4.9/type_traits' line='1505' column='1' id='type-id-478'/>
        </member-type>
      </class-decl>
      <class-decl name='remove_reference&lt;boost::filesystem::filesystem_error::m_imp*&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/4.9/type_traits' line='1504' column='1' id='type-id-517'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-291' filepath='/usr/include/c++/4.9/type_traits' line='1505' column='1' id='type-id-480'/>
        </member-type>
      </class-decl>
      <class-decl name='codecvt&lt;wchar_t, char, __mbstate_t&gt;' visibility='default' is-declaration-only='yes' id='type-id-518'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;wchar_t const*, std::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-496'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;wchar_t*, std::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-498'/>
      <class-decl name='runtime_error' visibility='default' is-declaration-only='yes' id='type-id-519'/>
      <class-decl name='type_info' visibility='default' is-declaration-only='yes' id='type-id-520'/>
      <function-decl name='operator==&lt;char&gt;' mangled-name='_ZSteqIcEbRKSaIT_ES3_' filepath='/usr/include/c++/4.9/bits/allocator.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSteqIcEbRKSaIT_ES3_'>
        <parameter type-id='type-id-134'/>
        <parameter type-id='type-id-134'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='move&lt;boost::filesystem::detail::dir_itr_imp*&amp;&gt;' mangled-name='_ZSt4moveIRPN5boost10filesystem6detail11dir_itr_impEEONSt16remove_referenceIT_E4typeEOS7_' filepath='/usr/include/c++/4.9/bits/move.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt4moveIRPN5boost10filesystem6detail11dir_itr_impEEONSt16remove_referenceIT_E4typeEOS7_'>
        <parameter type-id='type-id-278' name='__t' filepath='/usr/include/c++/4.9/bits/move.h' line='101' column='1'/>
        <return type-id='type-id-479'/>
      </function-decl>
      <function-decl name='move&lt;boost::filesystem::filesystem_error::m_imp*&amp;&gt;' mangled-name='_ZSt4moveIRPN5boost10filesystem16filesystem_error5m_impEEONSt16remove_referenceIT_E4typeEOS7_' filepath='/usr/include/c++/4.9/bits/move.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt4moveIRPN5boost10filesystem16filesystem_error5m_impEEONSt16remove_referenceIT_E4typeEOS7_'>
        <parameter type-id='type-id-292' name='__t' filepath='/usr/include/c++/4.9/bits/move.h' line='101' column='1'/>
        <return type-id='type-id-481'/>
      </function-decl>
      <function-decl name='swap&lt;boost::filesystem::detail::dir_itr_imp*&gt;' mangled-name='_ZSt4swapIPN5boost10filesystem6detail11dir_itr_impEEvRT_S6_' filepath='/usr/include/c++/4.9/bits/move.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt4swapIPN5boost10filesystem6detail11dir_itr_impEEvRT_S6_'>
        <parameter type-id='type-id-278' name='__a' filepath='/usr/include/c++/4.9/bits/move.h' line='166' column='1'/>
        <parameter type-id='type-id-278' name='__b' filepath='/usr/include/c++/4.9/bits/move.h' line='166' column='1'/>
        <return type-id='type-id-31'/>
      </function-decl>
      <function-decl name='swap&lt;boost::filesystem::filesystem_error::m_imp*&gt;' mangled-name='_ZSt4swapIPN5boost10filesystem16filesystem_error5m_impEEvRT_S6_' filepath='/usr/include/c++/4.9/bits/move.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt4swapIPN5boost10filesystem16filesystem_error5m_impEEvRT_S6_'>
        <parameter type-id='type-id-292' name='__a' filepath='/usr/include/c++/4.9/bits/move.h' line='166' column='1'/>
        <parameter type-id='type-id-292' name='__b' filepath='/usr/include/c++/4.9/bits/move.h' line='166' column='1'/>
        <return type-id='type-id-31'/>
      </function-decl>
      <function-decl name='__distance&lt;char*&gt;' mangled-name='_ZSt10__distanceIPcENSt15iterator_traitsIT_E15difference_typeES2_S2_St26random_access_iterator_tag' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_funcs.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt10__distanceIPcENSt15iterator_traitsIT_E15difference_typeES2_S2_St26random_access_iterator_tag'>
        <parameter type-id='type-id-37'/>
        <parameter type-id='type-id-37'/>
        <parameter type-id='type-id-504'/>
        <return type-id='type-id-196'/>
      </function-decl>
      <function-decl name='distance&lt;char*&gt;' mangled-name='_ZSt8distanceIPcENSt15iterator_traitsIT_E15difference_typeES2_S2_' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_funcs.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt8distanceIPcENSt15iterator_traitsIT_E15difference_typeES2_S2_'>
        <parameter type-id='type-id-37'/>
        <parameter type-id='type-id-37'/>
        <return type-id='type-id-196'/>
      </function-decl>
      <function-decl name='__iterator_category&lt;char*&gt;' mangled-name='_ZSt19__iterator_categoryIPcENSt15iterator_traitsIT_E17iterator_categoryERKS2_' filepath='/usr/include/c++/4.9/bits/stl_iterator_base_types.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt19__iterator_categoryIPcENSt15iterator_traitsIT_E17iterator_categoryERKS2_'>
        <parameter type-id='type-id-89'/>
        <return type-id='type-id-521'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='__gnu_cxx'>
      <class-decl name='__normal_iterator&lt;wchar_t const*, std::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='709' column='1' id='type-id-247'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-510' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='720' column='1' id='type-id-522'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-512' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='721' column='1' id='type-id-523'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-511' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='722' column='1' id='type-id-524'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-159' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='712' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='__normal_iterator' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='724' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-249' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__normal_iterator' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-249' is-artificial='yes'/>
            <parameter type-id='type-id-461'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator*' mangled-name='_ZNK9__gnu_cxx17__normal_iteratorIPKwSbIwSt11char_traitsIwESaIwEEEdeEv' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9__gnu_cxx17__normal_iteratorIPKwSbIwSt11char_traitsIwESaIwEEEdeEv'>
            <parameter type-id='type-id-326' is-artificial='yes'/>
            <return type-id='type-id-523'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__normal_iterator&lt;wchar_t*, std::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='709' column='1' id='type-id-250'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-506' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='720' column='1' id='type-id-525'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-508' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='721' column='1' id='type-id-526'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-507' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='722' column='1' id='type-id-527'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-179' visibility='default' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='712' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='__normal_iterator' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='724' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-252' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__normal_iterator' filepath='/usr/include/c++/4.9/bits/stl_iterator.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-252' is-artificial='yes'/>
            <parameter type-id='type-id-486'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='new_allocator&lt;wchar_t&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='58' column='1' id='type-id-253'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-182' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='61' column='1' id='type-id-528'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-179' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='63' column='1' id='type-id-529'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-159' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='64' column='1' id='type-id-530'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-484' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='65' column='1' id='type-id-531'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-459' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='66' column='1' id='type-id-532'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='new_allocator' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-254' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='new_allocator' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-254' is-artificial='yes'/>
            <parameter type-id='type-id-330'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~new_allocator' filepath='/usr/include/c++/4.9/ext/new_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-254' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <function-decl name='__is_null_pointer&lt;char&gt;' mangled-name='_ZN9__gnu_cxx17__is_null_pointerIcEEbPT_' filepath='/usr/include/c++/4.9/ext/type_traits.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9__gnu_cxx17__is_null_pointerIcEEbPT_'>
        <parameter type-id='type-id-37'/>
        <return type-id='type-id-1'/>
      </function-decl>
    </namespace-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strcoll' filepath='/usr/include/string.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strxfrm' filepath='/usr/include/string.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='strtok' filepath='/usr/include/string.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <namespace-decl name='boost'>
      <class-decl name='enable_if_c&lt;true, boost::filesystem::path&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.56.0/boost/core/enable_if.hpp' line='28' column='1' id='type-id-533'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-294' filepath='src/third_party/boost-1.56.0/boost/core/enable_if.hpp' line='29' column='1' id='type-id-534'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_core_access' size-in-bits='8' visibility='default' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='469' column='1' id='type-id-301'>
        <member-function access='private' constructor='yes'>
          <function-decl name='iterator_core_access' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='578' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-302' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='equal&lt;boost::filesystem::directory_iterator, boost::filesystem::directory_iterator&gt;' mangled-name='_ZN5boost20iterator_core_access5equalINS_10filesystem18directory_iteratorES3_EEbRKT_RKT0_N4mpl_5bool_ILb1EEE' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='530' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost20iterator_core_access5equalINS_10filesystem18directory_iteratorES3_EEbRKT_RKT0_N4mpl_5bool_ILb1EEE'>
            <parameter type-id='type-id-355'/>
            <parameter type-id='type-id-355'/>
            <parameter type-id='type-id-535'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='increment&lt;boost::filesystem::directory_iterator&gt;' mangled-name='_ZN5boost20iterator_core_access9incrementINS_10filesystem18directory_iteratorEEEvRT_' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost20iterator_core_access9incrementINS_10filesystem18directory_iteratorEEEvRT_'>
            <parameter type-id='type-id-283'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='dereference&lt;boost::filesystem::directory_iterator&gt;' mangled-name='_ZN5boost20iterator_core_access11dereferenceINS_10filesystem18directory_iteratorEEENT_9referenceERKS4_' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost20iterator_core_access11dereferenceINS_10filesystem18directory_iteratorEEENT_9referenceERKS4_'>
            <parameter type-id='type-id-355'/>
            <return type-id='type-id-536'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='equal&lt;boost::filesystem::path::iterator, boost::filesystem::path::iterator&gt;' mangled-name='_ZN5boost20iterator_core_access5equalINS_10filesystem4path8iteratorES4_EEbRKT_RKT0_N4mpl_5bool_ILb1EEE' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='530' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost20iterator_core_access5equalINS_10filesystem4path8iteratorES4_EEbRKT_RKT0_N4mpl_5bool_ILb1EEE'>
            <parameter type-id='type-id-369'/>
            <parameter type-id='type-id-369'/>
            <parameter type-id='type-id-535'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='increment&lt;boost::filesystem::path::iterator&gt;' mangled-name='_ZN5boost20iterator_core_access9incrementINS_10filesystem4path8iteratorEEEvRT_' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost20iterator_core_access9incrementINS_10filesystem4path8iteratorEEEvRT_'>
            <parameter type-id='type-id-297'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='dereference&lt;boost::filesystem::path::iterator&gt;' mangled-name='_ZN5boost20iterator_core_access11dereferenceINS_10filesystem4path8iteratorEEENT_9referenceERKS5_' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost20iterator_core_access11dereferenceINS_10filesystem4path8iteratorEEENT_9referenceERKS5_'>
            <parameter type-id='type-id-369'/>
            <return type-id='type-id-537'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='iterator_facade&lt;boost::filesystem::directory_iterator, boost::filesystem::directory_entry, boost::single_pass_traversal_tag, boost::filesystem::directory_entry&amp;, long int&gt;' size-in-bits='8' visibility='default' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='592' column='1' id='type-id-303'>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-280' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='630' column='1' id='type-id-536'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-17' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='631' column='1' id='type-id-538'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-540' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='633' column='1' id='type-id-539'/>
        </member-type>
        <member-function access='public' const='yes'>
          <function-decl name='operator-&gt;' mangled-name='_ZNK5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lEptEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lEptEv'>
            <parameter type-id='type-id-382' is-artificial='yes'/>
            <return type-id='type-id-539'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator++' mangled-name='_ZN5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lEppEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lEppEv'>
            <parameter type-id='type-id-304' is-artificial='yes'/>
            <return type-id='type-id-283'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator*' mangled-name='_ZNK5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lEdeEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lEdeEv'>
            <parameter type-id='type-id-382' is-artificial='yes'/>
            <return type-id='type-id-536'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='derived' mangled-name='_ZNK5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lE7derivedEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lE7derivedEv'>
            <parameter type-id='type-id-382' is-artificial='yes'/>
            <return type-id='type-id-355'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='derived' mangled-name='_ZN5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lE7derivedEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost15iterator_facadeINS_10filesystem18directory_iteratorENS1_15directory_entryENS_25single_pass_traversal_tagERS3_lE7derivedEv'>
            <parameter type-id='type-id-304' is-artificial='yes'/>
            <return type-id='type-id-283'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='iterator_facade&lt;boost::filesystem::path::iterator, const boost::filesystem::path, boost::bidirectional_traversal_tag, const boost::filesystem::path&amp;, long int&gt;' size-in-bits='8' visibility='default' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='592' column='1' id='type-id-305'>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-363' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='630' column='1' id='type-id-537'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-17' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='631' column='1' id='type-id-541'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-543' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='633' column='1' id='type-id-542'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='operator++' mangled-name='_ZN5boost15iterator_facadeINS_10filesystem4path8iteratorEKS2_NS_27bidirectional_traversal_tagERS4_lEppEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost15iterator_facadeINS_10filesystem4path8iteratorEKS2_NS_27bidirectional_traversal_tagERS4_lEppEv'>
            <parameter type-id='type-id-306' is-artificial='yes'/>
            <return type-id='type-id-297'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator*' mangled-name='_ZNK5boost15iterator_facadeINS_10filesystem4path8iteratorEKS2_NS_27bidirectional_traversal_tagERS4_lEdeEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost15iterator_facadeINS_10filesystem4path8iteratorEKS2_NS_27bidirectional_traversal_tagERS4_lEdeEv'>
            <parameter type-id='type-id-385' is-artificial='yes'/>
            <return type-id='type-id-537'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='derived' mangled-name='_ZN5boost15iterator_facadeINS_10filesystem4path8iteratorEKS2_NS_27bidirectional_traversal_tagERS4_lE7derivedEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost15iterator_facadeINS_10filesystem4path8iteratorEKS2_NS_27bidirectional_traversal_tagERS4_lE7derivedEv'>
            <parameter type-id='type-id-306' is-artificial='yes'/>
            <return type-id='type-id-297'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='derived' mangled-name='_ZNK5boost15iterator_facadeINS_10filesystem4path8iteratorEKS2_NS_27bidirectional_traversal_tagERS4_lE7derivedEv' filepath='src/third_party/boost-1.56.0/boost/iterator/iterator_facade.hpp' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost15iterator_facadeINS_10filesystem4path8iteratorEKS2_NS_27bidirectional_traversal_tagERS4_lE7derivedEv'>
            <parameter type-id='type-id-385' is-artificial='yes'/>
            <return type-id='type-id-369'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='scoped_array&lt;char&gt;' size-in-bits='64' visibility='default' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='39' column='1' id='type-id-307'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='px' type-id='type-id-37' visibility='default' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='43' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='scoped_array' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-309' is-artificial='yes'/>
            <parameter type-id='type-id-387'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='scoped_array' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-309' is-artificial='yes'/>
            <parameter type-id='type-id-37'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~scoped_array' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-309' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='scoped_array' mangled-name='_ZN5boost12scoped_arrayIcEC2EPc' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost12scoped_arrayIcEC2EPc'>
            <parameter type-id='type-id-309' is-artificial='yes'/>
            <parameter type-id='type-id-37'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~scoped_array' mangled-name='_ZN5boost12scoped_arrayIcED2Ev' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost12scoped_arrayIcED2Ev'>
            <parameter type-id='type-id-309' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='get' mangled-name='_ZNK5boost12scoped_arrayIcE3getEv' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost12scoped_arrayIcE3getEv'>
            <parameter type-id='type-id-388' is-artificial='yes'/>
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='scoped_array' mangled-name='_ZN5boost12scoped_arrayIcEC2EPc' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost12scoped_arrayIcEC2EPc'>
            <parameter type-id='type-id-309' is-artificial='yes'/>
            <parameter type-id='type-id-37'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~scoped_array' mangled-name='_ZN5boost12scoped_arrayIcED2Ev' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/scoped_array.hpp' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost12scoped_arrayIcED2Ev'>
            <parameter type-id='type-id-309' is-artificial='yes'/>
            <parameter type-id='type-id-15' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='shared_ptr&lt;boost::filesystem::detail::dir_itr_imp&gt;' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='323' column='1' id='type-id-310'>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-544' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='332' column='1' id='type-id-314'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='px' type-id='type-id-315' visibility='default' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='723' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='pn' type-id='type-id-258' visibility='default' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='724' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='shared_ptr' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='392' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <parameter type-id='type-id-390'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <parameter type-id='type-id-312'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='shared_ptr&lt;boost::filesystem::detail::dir_itr_imp&gt;' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <parameter type-id='type-id-277'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' mangled-name='_ZN5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEEC2Ev' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEEC2Ev'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='shared_ptr&lt;boost::filesystem::detail::dir_itr_imp&gt;' mangled-name='_ZN5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEEC2IS3_EEPT_' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEEC2IS3_EEPT_'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <parameter type-id='type-id-277'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='get' mangled-name='_ZNK5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEE3getEv' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEE3getEv'>
            <parameter type-id='type-id-391' is-artificial='yes'/>
            <return type-id='type-id-315'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator-&gt;' mangled-name='_ZNK5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEEptEv' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEEptEv'>
            <parameter type-id='type-id-391' is-artificial='yes'/>
            <return type-id='type-id-545'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='reset' mangled-name='_ZN5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEE5resetEv' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEE5resetEv'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='swap' mangled-name='_ZN5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEE4swapERS4_' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem6detail11dir_itr_impEE4swapERS4_'>
            <parameter type-id='type-id-313' is-artificial='yes'/>
            <parameter type-id='type-id-311'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='shared_ptr&lt;boost::filesystem::filesystem_error::m_imp&gt;' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='323' column='1' id='type-id-316'>
        <member-type access='private'>
          <typedef-decl name='this_type' type-id='type-id-316' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='328' column='1' id='type-id-546'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-547' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='332' column='1' id='type-id-320'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='px' type-id='type-id-321' visibility='default' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='723' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='pn' type-id='type-id-258' visibility='default' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='724' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='shared_ptr' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='392' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <parameter type-id='type-id-393'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <parameter type-id='type-id-318'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='shared_ptr&lt;boost::filesystem::filesystem_error::m_imp&gt;' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <parameter type-id='type-id-291'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' mangled-name='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEEC2Ev' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEEC2Ev'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='reset&lt;boost::filesystem::filesystem_error::m_imp&gt;' mangled-name='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEE5resetIS3_EEvPT_' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEE5resetIS3_EEvPT_'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <parameter type-id='type-id-291'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='reset' mangled-name='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEE5resetEv' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEE5resetEv'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator-&gt;' mangled-name='_ZNK5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEEptEv' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEEptEv'>
            <parameter type-id='type-id-394' is-artificial='yes'/>
            <return type-id='type-id-548'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='get' mangled-name='_ZNK5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEE3getEv' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEE3getEv'>
            <parameter type-id='type-id-394' is-artificial='yes'/>
            <return type-id='type-id-321'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='shared_ptr&lt;boost::filesystem::filesystem_error::m_imp&gt;' mangled-name='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEEC2IS3_EEPT_' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEEC2IS3_EEPT_'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <parameter type-id='type-id-291'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='swap' mangled-name='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEE4swapERS4_' filepath='src/third_party/boost-1.56.0/boost/smart_ptr/shared_ptr.hpp' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_10filesystem16filesystem_error5m_impEE4swapERS4_'>
            <parameter type-id='type-id-319' is-artificial='yes'/>
            <parameter type-id='type-id-317'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <function-decl name='addressof&lt;boost::filesystem::directory_entry&gt;' filepath='src/third_party/boost-1.56.0/boost/core/addressof.hpp' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-280'/>
        <return type-id='type-id-281'/>
      </function-decl>
      <function-decl name='checked_delete&lt;boost::filesystem::detail::dir_itr_imp&gt;' mangled-name='_ZN5boost14checked_deleteINS_10filesystem6detail11dir_itr_impEEEvPT_' filepath='src/third_party/boost-1.56.0/boost/core/checked_delete.hpp' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost14checked_deleteINS_10filesystem6detail11dir_itr_impEEEvPT_'>
        <parameter type-id='type-id-277' name='x' filepath='src/third_party/boost-1.56.0/boost/core/checked_delete.hpp' line='29' column='1'/>
        <return type-id='type-id-31'/>
      </function-decl>
      <function-decl name='checked_delete&lt;boost::filesystem::filesystem_error::m_imp&gt;' mangled-name='_ZN5boost14checked_deleteINS_10filesystem16filesystem_error5m_impEEEvPT_' filepath='src/third_party/boost-1.56.0/boost/core/checked_delete.hpp' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost14checked_deleteINS_10filesystem16filesystem_error5m_impEEEvPT_'>
        <parameter type-id='type-id-291' name='x' filepath='src/third_party/boost-1.56.0/boost/core/checked_delete.hpp' line='29' column='1'/>
        <return type-id='type-id-31'/>
      </function-decl>
      <function-decl name='checked_array_delete&lt;char&gt;' mangled-name='_ZN5boost20checked_array_deleteIcEEvPT_' filepath='src/third_party/boost-1.56.0/boost/core/checked_delete.hpp' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost20checked_array_deleteIcEEvPT_'>
        <parameter type-id='type-id-37' name='x' filepath='src/third_party/boost-1.56.0/boost/core/checked_delete.hpp' line='37' column='1'/>
        <return type-id='type-id-31'/>
      </function-decl>
      <namespace-decl name='core'>
        <typedef-decl name='typeinfo' type-id='type-id-520' filepath='src/third_party/boost-1.56.0/boost/core/typeinfo.hpp' line='134' column='1' id='type-id-549'/>
      </namespace-decl>
      <namespace-decl name='filesystem'>
        <class-decl name='filesystem_error' size-in-bits='448' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='64' column='1' id='type-id-287'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-323'/>
          <member-type access='private'>
            <class-decl name='m_imp' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='159' column='1' id='type-id-289'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='m_path1' type-id='type-id-293' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='161' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='m_path2' type-id='type-id-293' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='162' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='128'>
                <var-decl name='m_what' type-id='type-id-204' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='163' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='m_imp_ptr' type-id='type-id-316' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='165' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='filesystem_error' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-456'/>
              <parameter type-id='type-id-83'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='filesystem_error' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-456'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-83'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='filesystem_error' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-456'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-83'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='filesystem_error' mangled-name='_ZN5boost10filesystem16filesystem_errorC2ERKSsNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem16filesystem_errorC2ERKSsNS_6system10error_codeE'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-456'/>
              <parameter type-id='type-id-83'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='filesystem_error' mangled-name='_ZN5boost10filesystem16filesystem_errorC2ERKSsRKNS0_4pathENS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem16filesystem_errorC2ERKSsRKNS0_4pathENS_6system10error_codeE'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-456'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-83'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='filesystem_error' mangled-name='_ZN5boost10filesystem16filesystem_errorC2ERKSsRKNS0_4pathES6_NS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem16filesystem_errorC2ERKSsRKNS0_4pathES6_NS_6system10error_codeE'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-456'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-83'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~filesystem_error' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~filesystem_error' mangled-name='_ZN5boost10filesystem16filesystem_errorD0Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem16filesystem_errorD0Ev'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~filesystem_error' mangled-name='_ZN5boost10filesystem16filesystem_errorD2Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem16filesystem_errorD2Ev'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes' vtable-offset='2'>
            <function-decl name='what' mangled-name='_ZNK5boost10filesystem16filesystem_error4whatEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem16filesystem_error4whatEv'>
              <parameter type-id='type-id-361' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
        <enum-decl name='file_type' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='172' column='1' id='type-id-550'>
          <underlying-type type-id='type-id-235'/>
          <enumerator name='status_error' value='0'/>
          <enumerator name='status_unknown' value='0'/>
          <enumerator name='file_not_found' value='1'/>
          <enumerator name='regular_file' value='2'/>
          <enumerator name='directory_file' value='3'/>
          <enumerator name='symlink_file' value='4'/>
          <enumerator name='block_file' value='5'/>
          <enumerator name='character_file' value='6'/>
          <enumerator name='fifo_file' value='7'/>
          <enumerator name='socket_file' value='8'/>
          <enumerator name='reparse_file' value='9'/>
          <enumerator name='type_unknown' value='10'/>
          <enumerator name='_detail_directory_symlink' value='11'/>
        </enum-decl>
        <enum-decl name='perms' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='198' column='1' id='type-id-299'>
          <underlying-type type-id='type-id-235'/>
          <enumerator name='no_perms' value='0'/>
          <enumerator name='owner_read' value='256'/>
          <enumerator name='owner_write' value='128'/>
          <enumerator name='owner_exe' value='64'/>
          <enumerator name='owner_all' value='448'/>
          <enumerator name='group_read' value='32'/>
          <enumerator name='group_write' value='16'/>
          <enumerator name='group_exe' value='8'/>
          <enumerator name='group_all' value='56'/>
          <enumerator name='others_read' value='4'/>
          <enumerator name='others_write' value='2'/>
          <enumerator name='others_exe' value='1'/>
          <enumerator name='others_all' value='7'/>
          <enumerator name='all_all' value='511'/>
          <enumerator name='set_uid_on_exe' value='2048'/>
          <enumerator name='set_gid_on_exe' value='1024'/>
          <enumerator name='sticky_bit' value='512'/>
          <enumerator name='perms_mask' value='4095'/>
          <enumerator name='perms_not_known' value='65535'/>
          <enumerator name='add_perms' value='4096'/>
          <enumerator name='remove_perms' value='8192'/>
          <enumerator name='symlink_perms' value='16384'/>
        </enum-decl>
        <class-decl name='file_status' size-in-bits='64' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='256' column='1' id='type-id-285'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_value' type-id='type-id-550' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='32'>
            <var-decl name='m_perms' type-id='type-id-299' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='277' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_status' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-286' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_status' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-286' is-artificial='yes'/>
              <parameter type-id='type-id-550'/>
              <parameter type-id='type-id-299'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_status' mangled-name='_ZN5boost10filesystem11file_statusC2Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem11file_statusC2Ev'>
              <parameter type-id='type-id-286' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_status' mangled-name='_ZN5boost10filesystem11file_statusC2ENS0_9file_typeENS0_5permsE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem11file_statusC2ENS0_9file_typeENS0_5permsE'>
              <parameter type-id='type-id-286' is-artificial='yes'/>
              <parameter type-id='type-id-550'/>
              <parameter type-id='type-id-299'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='type' mangled-name='_ZNK5boost10filesystem11file_status4typeEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem11file_status4typeEv'>
              <parameter type-id='type-id-359' is-artificial='yes'/>
              <return type-id='type-id-550'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='permissions' mangled-name='_ZNK5boost10filesystem11file_status11permissionsEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem11file_status11permissionsEv'>
              <parameter type-id='type-id-359' is-artificial='yes'/>
              <return type-id='type-id-299'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='space_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='296' column='1' id='type-id-551'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='capacity' type-id='type-id-240' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='299' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='free' type-id='type-id-240' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='300' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='available' type-id='type-id-240' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='301' column='1'/>
          </data-member>
        </class-decl>
        <enum-decl name='copy_option' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='304' column='1' id='type-id-552'>
          <underlying-type type-id='type-id-235'/>
          <enumerator name='none' value='0'/>
          <enumerator name='fail_if_exists' value='0'/>
          <enumerator name='overwrite_if_exists' value='1'/>
        </enum-decl>
        <class-decl name='directory_entry' size-in-bits='192' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='670' column='1' id='type-id-279'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_path' type-id='type-id-293' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='715' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='m_status' type-id='type-id-285' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='716' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='m_symlink_status' type-id='type-id-285' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='717' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='directory_entry' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='676' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-281' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='directory_entry' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='677' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-281' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-285'/>
              <parameter type-id='type-id-285'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='directory_entry' mangled-name='_ZN5boost10filesystem15directory_entryC2Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem15directory_entryC2Ev'>
              <parameter type-id='type-id-281' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='assign' mangled-name='_ZN5boost10filesystem15directory_entry6assignERKNS0_4pathENS0_11file_statusES5_' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem15directory_entry6assignERKNS0_4pathENS0_11file_statusES5_'>
              <parameter type-id='type-id-281' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-285'/>
              <parameter type-id='type-id-285'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='replace_filename' mangled-name='_ZN5boost10filesystem15directory_entry16replace_filenameERKNS0_4pathENS0_11file_statusES5_' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem15directory_entry16replace_filenameERKNS0_4pathENS0_11file_statusES5_'>
              <parameter type-id='type-id-281' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-285'/>
              <parameter type-id='type-id-285'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='path' mangled-name='_ZNK5boost10filesystem15directory_entry4pathEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem15directory_entry4pathEv'>
              <parameter type-id='type-id-353' is-artificial='yes'/>
              <return type-id='type-id-363'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='m_get_status' mangled-name='_ZNK5boost10filesystem15directory_entry12m_get_statusEPNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='719' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem15directory_entry12m_get_statusEPNS_6system10error_codeE'>
              <parameter type-id='type-id-353' is-artificial='yes'/>
              <parameter type-id='type-id-84'/>
              <return type-id='type-id-285'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='m_get_symlink_status' mangled-name='_ZNK5boost10filesystem15directory_entry20m_get_symlink_statusEPNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem15directory_entry20m_get_symlink_statusEPNS_6system10error_codeE'>
              <parameter type-id='type-id-353' is-artificial='yes'/>
              <parameter type-id='type-id-84'/>
              <return type-id='type-id-285'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='directory_iterator' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='780' column='1' id='type-id-282'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-303'/>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_imp' type-id='type-id-310' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='816' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='directory_iterator' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='787' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='directory_iterator' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='791' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='directory_iterator' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='795' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <parameter type-id='type-id-322'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~directory_iterator' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='799' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='directory_iterator' mangled-name='_ZN5boost10filesystem18directory_iteratorC2Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem18directory_iteratorC2Ev'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='directory_iterator' mangled-name='_ZN5boost10filesystem18directory_iteratorC2ERKNS0_4pathE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem18directory_iteratorC2ERKNS0_4pathE'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~directory_iterator' mangled-name='_ZN5boost10filesystem18directory_iteratorD2Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='799' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem18directory_iteratorD2Ev'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <parameter type-id='type-id-15' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='increment' mangled-name='_ZN5boost10filesystem18directory_iterator9incrementERNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem18directory_iterator9incrementERNS_6system10error_codeE'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <parameter type-id='type-id-322'/>
              <return type-id='type-id-283'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='dereference' mangled-name='_ZNK5boost10filesystem18directory_iterator11dereferenceEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='823' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem18directory_iterator11dereferenceEv'>
              <parameter type-id='type-id-356' is-artificial='yes'/>
              <return type-id='type-id-536'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='increment' mangled-name='_ZN5boost10filesystem18directory_iterator9incrementEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='829' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem18directory_iterator9incrementEv'>
              <parameter type-id='type-id-284' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='equal' mangled-name='_ZNK5boost10filesystem18directory_iterator5equalERKS1_' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem18directory_iterator5equalERKS1_'>
              <parameter type-id='type-id-356' is-artificial='yes'/>
              <parameter type-id='type-id-355'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='path' size-in-bits='64' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='55' column='1' id='type-id-293'>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-2' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='66' column='1' id='type-id-374'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='string_type' type-id='type-id-135' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='69' column='1' id='type-id-371'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='codecvt_type' type-id='type-id-518' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='71' column='1' id='type-id-365'/>
          </member-type>
          <member-type access='public'>
            <class-decl name='iterator' size-in-bits='192' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='569' column='1' id='type-id-296'>
              <base-class access='public' layout-offset-in-bits='0' type-id='type-id-305'/>
              <data-member access='private' layout-offset-in-bits='0'>
                <var-decl name='m_element' type-id='type-id-293' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='593' column='1'/>
              </data-member>
              <data-member access='private' layout-offset-in-bits='64'>
                <var-decl name='m_path_ptr' type-id='type-id-364' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='594' column='1'/>
              </data-member>
              <data-member access='private' layout-offset-in-bits='128'>
                <var-decl name='m_pos' type-id='type-id-142' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='595' column='1'/>
              </data-member>
              <member-function access='private' const='yes'>
                <function-decl name='dereference' mangled-name='_ZNK5boost10filesystem4path8iterator11dereferenceEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem4path8iterator11dereferenceEv'>
                  <parameter type-id='type-id-370' is-artificial='yes'/>
                  <return type-id='type-id-363'/>
                </function-decl>
              </member-function>
              <member-function access='private' const='yes'>
                <function-decl name='equal' mangled-name='_ZNK5boost10filesystem4path8iterator5equalERKS2_' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem4path8iterator5equalERKS2_'>
                  <parameter type-id='type-id-370' is-artificial='yes'/>
                  <parameter type-id='type-id-369'/>
                  <return type-id='type-id-1'/>
                </function-decl>
              </member-function>
              <member-function access='private'>
                <function-decl name='increment' mangled-name='_ZN5boost10filesystem4path8iterator9incrementEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4path8iterator9incrementEv'>
                  <parameter type-id='type-id-298' is-artificial='yes'/>
                  <return type-id='type-id-31'/>
                </function-decl>
              </member-function>
            </class-decl>
          </member-type>
          <data-member access='public' static='yes'>
            <var-decl name='preferred_separator' type-id='type-id-375' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='67' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_pathname' type-id='type-id-371' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='528' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='path' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='path' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='path' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-376'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='path' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-137'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='path' mangled-name='_ZN5boost10filesystem4pathC2Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4pathC2Ev'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='path' mangled-name='_ZN5boost10filesystem4pathC2ERKS1_' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4pathC2ERKS1_'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='path' mangled-name='_ZN5boost10filesystem4pathC2EPKc' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4pathC2EPKc'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-376'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='path' mangled-name='_ZN5boost10filesystem4pathC2ERKSs' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4pathC2ERKSs'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-137'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator=' mangled-name='_ZN5boost10filesystem4pathaSERKS1_' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4pathaSERKS1_'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-363'/>
              <return type-id='type-id-294'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='clear' mangled-name='_ZN5boost10filesystem4path5clearEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4path5clearEv'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='native' mangled-name='_ZNK5boost10filesystem4path6nativeEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem4path6nativeEv'>
              <parameter type-id='type-id-364' is-artificial='yes'/>
              <return type-id='type-id-373'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='c_str' mangled-name='_ZNK5boost10filesystem4path5c_strEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem4path5c_strEv'>
              <parameter type-id='type-id-364' is-artificial='yes'/>
              <return type-id='type-id-376'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='string' mangled-name='_ZNK5boost10filesystem4path6stringEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem4path6stringEv'>
              <parameter type-id='type-id-364' is-artificial='yes'/>
              <return type-id='type-id-456'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='empty' mangled-name='_ZNK5boost10filesystem4path5emptyEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem4path5emptyEv'>
              <parameter type-id='type-id-364' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='has_root_directory' mangled-name='_ZNK5boost10filesystem4path18has_root_directoryEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem4path18has_root_directoryEv'>
              <parameter type-id='type-id-364' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='is_absolute' mangled-name='_ZNK5boost10filesystem4path11is_absoluteEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost10filesystem4path11is_absoluteEv'>
              <parameter type-id='type-id-364' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator=&lt;char*&gt;' mangled-name='_ZN5boost10filesystem4pathaSIPcEENS_9enable_ifINS0_11path_traits11is_pathableINS_5decayIT_E4typeEEERS1_E4typeERKS8_' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4pathaSIPcEENS_9enable_ifINS0_11path_traits11is_pathableINS_5decayIT_E4typeEEERS1_E4typeERKS8_'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-89'/>
              <return type-id='type-id-534'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='assign&lt;char*&gt;' mangled-name='_ZN5boost10filesystem4path6assignIPcEERS1_T_S5_' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4path6assignIPcEERS1_T_S5_'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-37'/>
              <parameter type-id='type-id-37'/>
              <return type-id='type-id-294'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='assign&lt;char*&gt;' mangled-name='_ZN5boost10filesystem4path6assignIPcEERS1_T_S5_RKSt7codecvtIwc11__mbstate_tE' filepath='src/third_party/boost-1.56.0/boost/filesystem/path.hpp' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem4path6assignIPcEERS1_T_S5_RKSt7codecvtIwc11__mbstate_tE'>
              <parameter type-id='type-id-295' is-artificial='yes'/>
              <parameter type-id='type-id-37'/>
              <parameter type-id='type-id-37'/>
              <parameter type-id='type-id-367'/>
              <return type-id='type-id-294'/>
            </function-decl>
          </member-function>
        </class-decl>
        <function-decl name='operator&amp;' mangled-name='_ZN5boost10filesystemanENS0_5permsES1_' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystemanENS0_5permsES1_'>
          <parameter type-id='type-id-299'/>
          <parameter type-id='type-id-299'/>
          <return type-id='type-id-299'/>
        </function-decl>
        <function-decl name='operator|' mangled-name='_ZN5boost10filesystemorENS0_5permsES1_' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystemorENS0_5permsES1_'>
          <parameter type-id='type-id-299'/>
          <parameter type-id='type-id-299'/>
          <return type-id='type-id-299'/>
        </function-decl>
        <function-decl name='operator~' mangled-name='_ZN5boost10filesystemcoENS0_5permsE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystemcoENS0_5permsE'>
          <parameter type-id='type-id-299'/>
          <return type-id='type-id-299'/>
        </function-decl>
        <function-decl name='operator|=' mangled-name='_ZN5boost10filesystemoRERNS0_5permsES1_' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystemoRERNS0_5permsES1_'>
          <parameter type-id='type-id-300' name='x' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='250' column='1'/>
          <parameter type-id='type-id-299' name='y' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='250' column='1'/>
          <return type-id='type-id-300'/>
        </function-decl>
        <function-decl name='type_present' mangled-name='_ZN5boost10filesystem12type_presentENS0_11file_statusE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem12type_presentENS0_11file_statusE'>
          <parameter type-id='type-id-285'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='permissions_present' mangled-name='_ZN5boost10filesystem19permissions_presentENS0_11file_statusE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem19permissions_presentENS0_11file_statusE'>
          <parameter type-id='type-id-285'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='status_known' mangled-name='_ZN5boost10filesystem12status_knownENS0_11file_statusE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem12status_knownENS0_11file_statusE'>
          <parameter type-id='type-id-285'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='is_regular_file' mangled-name='_ZN5boost10filesystem15is_regular_fileENS0_11file_statusE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem15is_regular_fileENS0_11file_statusE'>
          <parameter type-id='type-id-285'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='is_directory' mangled-name='_ZN5boost10filesystem12is_directoryENS0_11file_statusE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem12is_directoryENS0_11file_statusE'>
          <parameter type-id='type-id-285'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='is_symlink' mangled-name='_ZN5boost10filesystem10is_symlinkENS0_11file_statusE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem10is_symlinkENS0_11file_statusE'>
          <parameter type-id='type-id-285'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='status' mangled-name='_ZN5boost10filesystem6statusERKNS0_4pathERNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem6statusERKNS0_4pathERNS_6system10error_codeE'>
          <parameter type-id='type-id-363' name='p' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='392' column='1'/>
          <parameter type-id='type-id-322' name='ec' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='392' column='1'/>
          <return type-id='type-id-285'/>
        </function-decl>
        <function-decl name='symlink_status' mangled-name='_ZN5boost10filesystem14symlink_statusERKNS0_4pathERNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem14symlink_statusERKNS0_4pathERNS_6system10error_codeE'>
          <parameter type-id='type-id-363' name='p' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='397' column='1'/>
          <parameter type-id='type-id-322' name='ec' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='397' column='1'/>
          <return type-id='type-id-285'/>
        </function-decl>
        <function-decl name='is_directory' mangled-name='_ZN5boost10filesystem12is_directoryERKNS0_4pathE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem12is_directoryERKNS0_4pathE'>
          <parameter type-id='type-id-363' name='p' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='405' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='is_directory' mangled-name='_ZN5boost10filesystem12is_directoryERKNS0_4pathERNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem12is_directoryERKNS0_4pathERNS_6system10error_codeE'>
          <parameter type-id='type-id-363' name='p' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='407' column='1'/>
          <parameter type-id='type-id-322' name='ec' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='407' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='copy_directory' mangled-name='_ZN5boost10filesystem14copy_directoryERKNS0_4pathES3_RNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem14copy_directoryERKNS0_4pathES3_RNS_6system10error_codeE'>
          <parameter type-id='type-id-363' name='from' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='487' column='1'/>
          <parameter type-id='type-id-363' name='to' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='487' column='1'/>
          <parameter type-id='type-id-322' name='ec' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='487' column='1'/>
          <return type-id='type-id-31'/>
        </function-decl>
        <function-decl name='copy_file' mangled-name='_ZN5boost10filesystem9copy_fileERKNS0_4pathES3_NS0_11copy_optionERNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem9copy_fileERKNS0_4pathES3_NS0_11copy_optionERNS_6system10error_codeE'>
          <parameter type-id='type-id-363' name='from' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='497' column='1'/>
          <parameter type-id='type-id-363' name='to' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='497' column='1'/>
          <parameter type-id='type-id-552' name='option' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='498' column='1'/>
          <parameter type-id='type-id-322' name='ec' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='498' column='1'/>
          <return type-id='type-id-31'/>
        </function-decl>
        <function-decl name='copy_symlink' mangled-name='_ZN5boost10filesystem12copy_symlinkERKNS0_4pathES3_RNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem12copy_symlinkERKNS0_4pathES3_RNS_6system10error_codeE'>
          <parameter type-id='type-id-363' name='existing_symlink' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='507' column='1'/>
          <parameter type-id='type-id-363' name='new_symlink' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='507' column='1'/>
          <parameter type-id='type-id-322' name='ec' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='507' column='1'/>
          <return type-id='type-id-31'/>
        </function-decl>
        <function-decl name='create_directories' mangled-name='_ZN5boost10filesystem18create_directoriesERKNS0_4pathERNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem18create_directoriesERKNS0_4pathERNS_6system10error_codeE'>
          <parameter type-id='type-id-363' name='p' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='513' column='1'/>
          <parameter type-id='type-id-322' name='ec' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='513' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
        <function-decl name='current_path' mangled-name='_ZN5boost10filesystem12current_pathEv' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem12current_pathEv'>
          <return type-id='type-id-293'/>
        </function-decl>
        <namespace-decl name='detail'>
          <class-decl name='dir_itr_imp' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='741' column='1' id='type-id-275'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='dir_entry' type-id='type-id-279' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='743' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='handle' type-id='type-id-12' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='744' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='buffer' type-id='type-id-12' visibility='default' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='747' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='dir_itr_imp' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='750' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-277' is-artificial='yes'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~dir_itr_imp' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-277' is-artificial='yes'/>
                <parameter type-id='type-id-15' is-artificial='yes'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='dir_itr_imp' mangled-name='_ZN5boost10filesystem6detail11dir_itr_impC2Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='750' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem6detail11dir_itr_impC2Ev'>
                <parameter type-id='type-id-277' is-artificial='yes'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~dir_itr_imp' mangled-name='_ZN5boost10filesystem6detail11dir_itr_impD2Ev' filepath='src/third_party/boost-1.56.0/boost/filesystem/operations.hpp' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem6detail11dir_itr_impD2Ev'>
                <parameter type-id='type-id-277' is-artificial='yes'/>
                <parameter type-id='type-id-15' is-artificial='yes'/>
                <return type-id='type-id-31'/>
              </function-decl>
            </member-function>
          </class-decl>
          <function-decl name='possible_large_file_size_support' mangled-name='_ZN5boost10filesystem6detail32possible_large_file_size_supportEv' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem6detail32possible_large_file_size_supportEv'>
            <return type-id='type-id-1'/>
          </function-decl>
          <function-decl name='canonical' mangled-name='_ZN5boost10filesystem6detail9canonicalERKNS0_4pathES4_PNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem6detail9canonicalERKNS0_4pathES4_PNS_6system10error_codeE'>
            <parameter type-id='type-id-363' name='p' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='775' column='1'/>
            <parameter type-id='type-id-363' name='base' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='775' column='1'/>
            <parameter type-id='type-id-84' name='ec' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='775' column='1'/>
            <return type-id='type-id-293'/>
          </function-decl>
          <function-decl name='copy' mangled-name='_ZN5boost10filesystem6detail4copyERKNS0_4pathES4_PNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='857' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem6detail4copyERKNS0_4pathES4_PNS_6system10error_codeE'>
            <parameter type-id='type-id-363' name='from' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='857' column='1'/>
            <parameter type-id='type-id-363' name='to' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='857' column='1'/>
            <parameter type-id='type-id-84' name='ec' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='857' column='1'/>
            <return type-id='type-id-31'/>
          </function-decl>
          <function-decl name='copy_directory' mangled-name='_ZN5boost10filesystem6detail14copy_directoryERKNS0_4pathES4_PNS_6system10error_codeE' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10filesystem6detail14copy_directoryERKNS0_4pathES4_PNS_6system10error_codeE'>
            <parameter type-id='type-id-363' name='from' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='884' column='1'/>
            <parameter type-id='type-id-363' name='to' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='884' column='1'/>
            <parameter type-id='type-id-84' name='ec' filepath='src/third_party/boost-1.56.0/libs/filesystem/src/operations.cpp' line='884' column='1'/>
            <return type-id='type-id-31'/>
          </function-decl>
