<abi-corpus path='data/test-read-dwarf/test13-pr18894.so' soname='libdbus-1.so.3'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dbus_address_entries_free' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_address_entry_get_method' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_address_entry_get_value' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_address_escape_value' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_address_unescape_value' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_bus_add_match' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_bus_get' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_bus_get_id' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_bus_get_private' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_bus_get_unique_name' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_bus_get_unix_user' type='func-type' binding='global-binding' is-defined='yes'/>

    <elf-symbol name='dbus_server_free_data_slot' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_get_address' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_get_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_get_id' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_get_is_connected' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_listen' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_ref' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_set_auth_mechanisms' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_set_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_set_new_connection_function' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_set_timeout_functions' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_set_watch_functions' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_server_unref' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_set_error' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_set_error_const' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_set_error_from_message' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_setenv' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_shutdown' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_get_current_type' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_get_element_type' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_get_signature' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_init' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_next' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_recurse' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_signature_validate' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_signature_validate_single' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_threads_init' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_threads_init_default' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_get_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_get_enabled' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_get_interval' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_handle' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_set_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_type_is_basic' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_type_is_container' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_type_is_fixed' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_type_is_valid' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_validate_bus_name' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_validate_error_name' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_validate_interface' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_validate_member' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_validate_path' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_validate_utf8' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_enabled' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_fd' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_flags' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_socket' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_unix_fd' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_watch_handle' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='dbus_watch_set_data' type='func-type' binding='global-binding' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='dbus-address.c' language='LANG_C89'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <class-decl name='DBusAddressEntry' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='44' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='method' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='keys' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='values' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusString' size-in-bits='192' is-struct='yes' visibility='default' filepath='../dbus/dbus-string.h' line='43' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-8' visibility='default' filepath='../dbus/dbus-string.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-9' visibility='default' filepath='../dbus/dbus-string.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dummy3' type-id='type-id-9' visibility='default' filepath='../dbus/dbus-string.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy_bit1' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-string.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy_bit2' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-string.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy_bit3' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-string.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy_bits' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-string.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-8'/>
    <type-decl name='int' size-in-bits='32' id='type-id-9'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-10'/>
    <typedef-decl name='DBusString' type-id='type-id-7' filepath='../dbus/dbus-string.h' line='40' column='1' id='type-id-5'/>
    <class-decl name='DBusList' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='35' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusList' type-id='type-id-12' filepath='../dbus/dbus-sysdeps.h' line='74' column='1' id='type-id-13'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-6'/>
    <typedef-decl name='DBusAddressEntry' type-id='type-id-4' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.h' line='41' column='1' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <function-decl name='dbus_address_entry_get_method' mangled-name='dbus_address_entry_get_method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entry_get_method'>
      <parameter type-id='type-id-15' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='227' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <class-decl name='DBusError' size-in-bits='256' is-struct='yes' visibility='default' filepath='../dbus/dbus-errors.h' line='49' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy1' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-errors.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy2' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-errors.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy3' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-errors.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy4' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-errors.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy5' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-errors.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='padding1' type-id='type-id-8' visibility='default' filepath='../dbus/dbus-errors.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusError' type-id='type-id-16' filepath='../dbus/dbus-errors.h' line='43' column='1' id='type-id-17'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-18'/>
    <function-decl name='_dbus_set_bad_address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='65' column='1'/>
      <parameter type-id='type-id-3' name='address_problem_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='66' column='1'/>
      <parameter type-id='type-id-3' name='address_problem_field' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='67' column='1'/>
      <parameter type-id='type-id-3' name='address_problem_other' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='68' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-19'/>
    <function-decl name='dbus_address_unescape_value' mangled-name='dbus_address_unescape_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_unescape_value'>
      <parameter type-id='type-id-3' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='617' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='618' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-20'/>
    <function-decl name='dbus_address_entries_free' mangled-name='dbus_address_entries_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entries_free'>
      <parameter type-id='type-id-20' name='entries' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='189' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <typedef-decl name='dbus_uint32_t' type-id='type-id-10' filepath='../dbus/dbus-arch-deps.h' line='43' column='1' id='type-id-21'/>
    <typedef-decl name='dbus_bool_t' type-id='type-id-21' filepath='../dbus/dbus-types.h' line='35' column='1' id='type-id-22'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-24'/>
    <function-decl name='dbus_parse_address' mangled-name='dbus_parse_address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_parse_address'>
      <parameter type-id='type-id-3' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='363' column='1'/>
      <parameter type-id='type-id-23' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='364' column='1'/>
      <parameter type-id='type-id-24' name='array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='365' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='366' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_address_entry_get_value' mangled-name='dbus_address_entry_get_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entry_get_value'>
      <parameter type-id='type-id-15' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='244' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='245' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-25'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <function-decl name='_dbus_address_append_escaped' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-25' name='escaped' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='104' column='1'/>
      <parameter type-id='type-id-27' name='unescaped' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='105' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_address_escape_value' mangled-name='dbus_address_escape_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_escape_value'>
      <parameter type-id='type-id-3' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='583' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <var-decl name='_dbus_no_memory_message' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='264' column='1'/>
    <var-decl name='_dbus_no_memory_message' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='264' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-auth.c' language='LANG_C89'>
    <class-decl name='DBusAuth' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='154' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='side' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='incoming' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='outgoing' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='state' type-id='type-id-29' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='mech' type-id='type-id-30' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='identity' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='credentials' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='authorized_identity' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='desired_identity' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='context' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='keyring' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='cookie_id' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='challenge' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='allowed_mechs' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='needed_memory' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='already_got_mechanisms' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='already_asked_for_initial_response' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='buffer_outstanding' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='unix_fd_possible' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='unix_fd_negotiated' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='193' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='145' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='handler' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='147' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusAuth' type-id='type-id-28' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.h' line='33' column='1' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-38'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-39'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='DBUS_AUTH_COMMAND_AUTH' value='0'/>
      <enumerator name='DBUS_AUTH_COMMAND_CANCEL' value='1'/>
      <enumerator name='DBUS_AUTH_COMMAND_DATA' value='2'/>
      <enumerator name='DBUS_AUTH_COMMAND_BEGIN' value='3'/>
      <enumerator name='DBUS_AUTH_COMMAND_REJECTED' value='4'/>
      <enumerator name='DBUS_AUTH_COMMAND_OK' value='5'/>
      <enumerator name='DBUS_AUTH_COMMAND_ERROR' value='6'/>
      <enumerator name='DBUS_AUTH_COMMAND_UNKNOWN' value='7'/>
      <enumerator name='DBUS_AUTH_COMMAND_NEGOTIATE_UNIX_FD' value='8'/>
      <enumerator name='DBUS_AUTH_COMMAND_AGREE_UNIX_FD' value='9'/>
    </enum-decl>
    <typedef-decl name='DBusAuthCommand' type-id='type-id-39' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='130' column='1' id='type-id-40'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <typedef-decl name='DBusAuthStateFunction' type-id='type-id-42' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='137' column='1' id='type-id-35'/>
    <typedef-decl name='DBusAuthStateData' type-id='type-id-34' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='148' column='1' id='type-id-43'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-29'/>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='103' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mechanism' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='server_data_func' type-id='type-id-46' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='server_encode_func' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='server_decode_func' type-id='type-id-48' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='server_shutdown_func' type-id='type-id-49' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='client_initial_response_func' type-id='type-id-50' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='client_data_func' type-id='type-id-46' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='client_encode_func' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='client_decode_func' type-id='type-id-48' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='client_shutdown_func' type-id='type-id-49' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='113' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
    <typedef-decl name='DBusAuthDataFunction' type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='77' column='1' id='type-id-46'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <typedef-decl name='DBusAuthEncodeFunction' type-id='type-id-54' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='83' column='1' id='type-id-47'/>
    <typedef-decl name='DBusAuthDecodeFunction' type-id='type-id-54' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='90' column='1' id='type-id-48'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <typedef-decl name='DBusAuthShutdownFunction' type-id='type-id-56' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='97' column='1' id='type-id-49'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <typedef-decl name='DBusInitialResponseFunction' type-id='type-id-58' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='70' column='1' id='type-id-50'/>
    <typedef-decl name='DBusAuthMechanismHandler' type-id='type-id-45' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='114' column='1' id='type-id-59'/>
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-60'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-30'/>
    <class-decl name='DBusCredentials' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-61'/>
    <typedef-decl name='DBusCredentials' type-id='type-id-61' filepath='../dbus/dbus-sysdeps.h' line='77' column='1' id='type-id-62'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-31'/>
    <class-decl name='DBusKeyring' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-63'/>
    <typedef-decl name='DBusKeyring' type-id='type-id-63' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.h' line='33' column='1' id='type-id-64'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-33'/>
    <function-decl name='_dbus_auth_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2331' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2331' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-65'/>
    <function-decl name='_dbus_auth_get_bytes_to_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2475' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2475' column='1'/>
      <parameter type-id='type-id-65' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2476' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-66'/>
    <function-decl name='_dbus_auth_get_buffer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2520' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2520' column='1'/>
      <parameter type-id='type-id-66' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2521' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_auth_return_buffer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2538' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2538' column='1'/>
      <parameter type-id='type-id-25' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2539' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_auth_get_unused_bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2557' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2557' column='1'/>
      <parameter type-id='type-id-65' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2558' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_auth_needs_encoding' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2591' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2591' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_auth_needs_decoding' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2650' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2650' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_auth_get_identity' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2731' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2731' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='_dbus_auth_get_guid_from_server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2755' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_dbus_auth_set_unix_fd_possible' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2789' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2789' column='1'/>
      <parameter type-id='type-id-22' name='b' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2789' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_auth_get_unix_fd_negotiated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2801' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2801' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_auth_set_context' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2774' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2774' column='1'/>
      <parameter type-id='type-id-27' name='context' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2775' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_auth_set_credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2713' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2713' column='1'/>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2714' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_auth_decode_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2681' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2681' column='1'/>
      <parameter type-id='type-id-27' name='encoded' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2682' column='1'/>
      <parameter type-id='type-id-25' name='plaintext' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2683' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_auth_encode_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2618' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2618' column='1'/>
      <parameter type-id='type-id-27' name='plaintext' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2619' column='1'/>
      <parameter type-id='type-id-25' name='encoded' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2620' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_auth_delete_unused_bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2574' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2574' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_auth_bytes_sent' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2500' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2500' column='1'/>
      <parameter type-id='type-id-9' name='bytes_sent' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2501' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-67'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='DBUS_AUTH_STATE_WAITING_FOR_INPUT' value='0'/>
      <enumerator name='DBUS_AUTH_STATE_WAITING_FOR_MEMORY' value='1'/>
      <enumerator name='DBUS_AUTH_STATE_HAVE_BYTES_TO_SEND' value='2'/>
      <enumerator name='DBUS_AUTH_STATE_NEED_DISCONNECT' value='3'/>
      <enumerator name='DBUS_AUTH_STATE_AUTHENTICATED' value='4'/>
    </enum-decl>
    <typedef-decl name='DBusAuthState' type-id='type-id-67' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.h' line='42' column='1' id='type-id-68'/>
    <function-decl name='_dbus_auth_do_work' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2431' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2431' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-69'/>
    <function-decl name='_dbus_auth_set_mechanisms' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2396' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2396' column='1'/>
      <parameter type-id='type-id-69' name='mechanisms' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2397' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_auth_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2346' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37' name='auth' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2346' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_auth_server_new' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='guid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2247' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='_dbus_auth_client_new' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-auth.c' line='2293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-41'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-51'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-53'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-55'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-57'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-bus.c' language='LANG_C89'>
    <class-decl name='DBusConnection' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-70'/>
    <typedef-decl name='DBusConnection' type-id='type-id-70' filepath='../dbus/dbus-connection.h' line='51' column='1' id='type-id-71'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-72'/>
    <function-decl name='dbus_bus_remove_match' mangled-name='dbus_bus_remove_match' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_remove_match'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1576' column='1'/>
      <parameter type-id='type-id-3' name='rule' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1577' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1578' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_bus_add_match' mangled-name='dbus_bus_add_match' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_add_match'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1526' column='1'/>
      <parameter type-id='type-id-3' name='rule' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1527' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1528' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-73'/>
    <function-decl name='dbus_bus_start_service_by_name' mangled-name='dbus_bus_start_service_by_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_start_service_by_name'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1356' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1357' column='1'/>
      <parameter type-id='type-id-21' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1358' column='1'/>
      <parameter type-id='type-id-73' name='result' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1359' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1360' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_bus_name_has_owner' mangled-name='dbus_bus_name_has_owner' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_name_has_owner'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1280' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1281' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1282' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_bus_release_name' mangled-name='dbus_bus_release_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_release_name'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1198' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1199' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1200' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='dbus_bus_request_name' mangled-name='dbus_bus_request_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_request_name'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1112' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1113' column='1'/>
      <parameter type-id='type-id-10' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1114' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1115' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-74'/>
    <function-decl name='dbus_bus_get_unix_user' mangled-name='dbus_bus_get_unix_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_unix_user'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='865' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='866' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='867' column='1'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='dbus_bus_get_id' mangled-name='dbus_bus_get_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_id'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='949' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='_dbus_bus_notify_shared_connection_disconnected_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='387' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_bus_get_unique_name' mangled-name='dbus_bus_get_unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_unique_name'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='815' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_bus_set_unique_name' mangled-name='dbus_bus_set_unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_set_unique_name'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='766' column='1'/>
      <parameter type-id='type-id-3' name='unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='767' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_bus_register' mangled-name='dbus_bus_register' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_register'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='646' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='647' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-75'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='DBUS_BUS_SESSION' value='0'/>
      <enumerator name='DBUS_BUS_SYSTEM' value='1'/>
      <enumerator name='DBUS_BUS_STARTER' value='2'/>
    </enum-decl>
    <typedef-decl name='DBusBusType' type-id='type-id-75' filepath='../dbus/dbus-shared.h' line='61' column='1' id='type-id-76'/>
    <function-decl name='dbus_bus_get_private' mangled-name='dbus_bus_get_private' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_private'>
      <parameter type-id='type-id-76' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='590' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='591' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='dbus_bus_get' mangled-name='dbus_bus_get' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get'>
      <parameter type-id='type-id-76' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='558' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='559' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <var-decl name='_dbus_return_if_fail_warning_format' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='154' column='1'/>
    <var-decl name='_dbus_no_memory_message' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='264' column='1'/>
    <var-decl name='_dbus_return_if_fail_warning_format' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='154' column='1'/>
    <var-decl name='_dbus_no_memory_message' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='264' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-connection.c' language='LANG_C89'>
    <class-decl name='DBusConnection' size-in-bits='2112' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='257' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mutex' type-id='type-id-78' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dispatch_mutex' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dispatch_cond' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='io_path_mutex' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='io_path_cond' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='outgoing_messages' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='incoming_messages' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='expired_messages' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='message_borrowed' type-id='type-id-81' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='n_outgoing' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_incoming' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='outgoing_counter' type-id='type-id-82' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='transport' type-id='type-id-83' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='watches' type-id='type-id-84' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='timeouts' type-id='type-id-85' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='filter_list' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='slot_mutex' type-id='type-id-78' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='slot_list' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='pending_replies' type-id='type-id-87' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='client_serial' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='disconnect_message_link' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='wakeup_main_function' type-id='type-id-88' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='wakeup_main_data' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='free_wakeup_main_data' type-id='type-id-89' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='dispatch_status_function' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='dispatch_status_data' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='free_dispatch_status_data' type-id='type-id-89' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='last_dispatch_status' type-id='type-id-91' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='objects' type-id='type-id-92' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='server_guid' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='dispatch_acquired' type-id='type-id-22' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='io_path_acquired' type-id='type-id-22' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='shareable' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='exit_on_disconnect' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='route_peer_messages' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='disconnected_message_arrived' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='disconnected_message_processed' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='have_connection_lock' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='generation' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='334' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusAtomic' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='228' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-94' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dbus_int32_t' type-id='type-id-9' filepath='../dbus/dbus-arch-deps.h' line='42' column='1' id='type-id-95'/>
    <qualified-type-def type-id='type-id-95' volatile='yes' id='type-id-94'/>
    <typedef-decl name='DBusAtomic' type-id='type-id-93' filepath='../dbus/dbus-sysdeps.h' line='222' column='1' id='type-id-77'/>
    <class-decl name='DBusRMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-96'/>
    <typedef-decl name='DBusRMutex' type-id='type-id-96' filepath='../dbus/dbus-threads-internal.h' line='39' column='1' id='type-id-97'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-78'/>
    <class-decl name='DBusCMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-98'/>
    <typedef-decl name='DBusCMutex' type-id='type-id-98' filepath='../dbus/dbus-threads-internal.h' line='45' column='1' id='type-id-99'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-79'/>
    <class-decl name='DBusCondVar' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-100'/>
    <typedef-decl name='DBusCondVar' type-id='type-id-100' filepath='../dbus/dbus-threads.h' line='43' column='1' id='type-id-101'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-80'/>
    <class-decl name='DBusMessage' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='100' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='header' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='body' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='locked' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='in_cache' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='counters' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='size_counter_delta' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='changed_stamp' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='slot_list' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='generation' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='unix_fds' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='n_unix_fds' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='n_unix_fds_allocated' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='unix_fd_counter_delta' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusHeader' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='48' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-5' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fields' type-id='type-id-106' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='padding' type-id='type-id-21' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='byte_order' type-id='type-id-21' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusHeaderField' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='40' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_pos' type-id='type-id-9' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusHeaderField' type-id='type-id-107' filepath='../dbus/dbus-marshal-header.h' line='31' column='1' id='type-id-108'/>
    <array-type-def dimensions='1' type-id='type-id-108' size-in-bits='320' id='type-id-106'>
      <subrange length='10'/>
    </array-type-def>
    <typedef-decl name='DBusHeader' type-id='type-id-105' filepath='../dbus/dbus-marshal-header.h' line='30' column='1' id='type-id-103'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-104'/>
    <class-decl name='DBusDataSlotList' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='70' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slots' type-id='type-id-110' visibility='default' filepath='../dbus/dbus-dataslot.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_slots' type-id='type-id-9' visibility='default' filepath='../dbus/dbus-dataslot.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusDataSlot' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='37' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-8' visibility='default' filepath='../dbus/dbus-dataslot.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_data_func' type-id='type-id-89' visibility='default' filepath='../dbus/dbus-dataslot.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-113'/>
    <typedef-decl name='DBusFreeFunction' type-id='type-id-113' filepath='../dbus/dbus-memory.h' line='64' column='1' id='type-id-89'/>
    <typedef-decl name='DBusDataSlot' type-id='type-id-111' filepath='../dbus/dbus-dataslot.h' line='34' column='1' id='type-id-114'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-110'/>
    <typedef-decl name='DBusDataSlotList' type-id='type-id-109' filepath='../dbus/dbus-dataslot.h' line='31' column='1' id='type-id-86'/>
    <typedef-decl name='DBusMessage' type-id='type-id-102' filepath='../dbus/dbus-message.h' line='44' column='1' id='type-id-115'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-81'/>
    <class-decl name='DBusCounter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-116'/>
    <typedef-decl name='DBusCounter' type-id='type-id-116' filepath='../dbus/dbus-resources.h' line='32' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-82'/>
    <class-decl name='DBusTransport' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <typedef-decl name='DBusTransport' type-id='type-id-118' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-transport.h' line='33' column='1' id='type-id-119'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-83'/>
    <class-decl name='DBusWatchList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <typedef-decl name='DBusWatchList' type-id='type-id-120' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='38' column='1' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-84'/>
    <class-decl name='DBusTimeoutList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-122'/>
    <typedef-decl name='DBusTimeoutList' type-id='type-id-122' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='38' column='1' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-85'/>
    <class-decl name='DBusHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-124'/>
    <typedef-decl name='DBusHashTable' type-id='type-id-124' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-hash.h' line='59' column='1' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-87'/>
    <typedef-decl name='DBusWakeupMainFunction' type-id='type-id-113' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='135' column='1' id='type-id-88'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-126'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='DBUS_DISPATCH_DATA_REMAINS' value='0'/>
      <enumerator name='DBUS_DISPATCH_COMPLETE' value='1'/>
      <enumerator name='DBUS_DISPATCH_NEED_MEMORY' value='2'/>
    </enum-decl>
    <typedef-decl name='DBusDispatchStatus' type-id='type-id-126' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='84' column='1' id='type-id-91'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='DBusDispatchStatusFunction' type-id='type-id-128' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='128' column='1' id='type-id-90'/>
    <class-decl name='DBusObjectTree' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
    <typedef-decl name='DBusObjectTree' type-id='type-id-129' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-object-tree.h' line='30' column='1' id='type-id-130'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-92'/>
    <function-decl name='_dbus_connection_has_messages_to_send_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='572' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='572' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <class-decl name='DBusWatch' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
    <typedef-decl name='DBusWatch' type-id='type-id-131' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='43' column='1' id='type-id-132'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <function-decl name='_dbus_connection_add_watch_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='743' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='743' column='1'/>
      <parameter type-id='type-id-133' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='744' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_connection_remove_watch_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='761' column='1'/>
      <parameter type-id='type-id-133' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='762' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_toggle_watch_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='781' column='1'/>
      <parameter type-id='type-id-133' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='782' column='1'/>
      <parameter type-id='type-id-22' name='enabled' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='783' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <class-decl name='DBusTimeout' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
    <typedef-decl name='DBusTimeout' type-id='type-id-134' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='45' column='1' id='type-id-135'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <function-decl name='_dbus_connection_add_timeout_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='867' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='867' column='1'/>
      <parameter type-id='type-id-136' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='868' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_connection_remove_timeout_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='885' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='885' column='1'/>
      <parameter type-id='type-id-136' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='886' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_toggle_timeout_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='905' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='905' column='1'/>
      <parameter type-id='type-id-136' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='906' column='1'/>
      <parameter type-id='type-id-22' name='enabled' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='907' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_set_change_sigpipe' mangled-name='dbus_connection_set_change_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_change_sigpipe'>
      <parameter type-id='type-id-22' name='will_modify_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_lock' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='388' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='388' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_data' mangled-name='dbus_connection_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_data'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1'/>
      <parameter type-id='type-id-95' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6018' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dbus_connection_set_data' mangled-name='dbus_connection_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_data'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1'/>
      <parameter type-id='type-id-95' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5969' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5970' column='1'/>
      <parameter type-id='type-id-89' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5971' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-137'/>
    <function-decl name='dbus_connection_free_data_slot' mangled-name='dbus_connection_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5938' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_free_data_slot'>
      <parameter type-id='type-id-137' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5938' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_allocate_data_slot' mangled-name='dbus_connection_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_allocate_data_slot'>
      <parameter type-id='type-id-137' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5920' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-138'/>
    <function-decl name='dbus_connection_list_registered' mangled-name='dbus_connection_list_registered' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_list_registered'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5878' column='1'/>
      <parameter type-id='type-id-3' name='parent_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5879' column='1'/>
      <parameter type-id='type-id-138' name='child_entries' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5880' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_unregister_object_path' mangled-name='dbus_connection_unregister_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_unregister_object_path'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5809' column='1'/>
      <parameter type-id='type-id-3' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5810' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_ref' mangled-name='dbus_connection_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_ref'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2681' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='_dbus_connection_ref_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1419' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1419' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='_dbus_connection_unlock' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='399' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_outgoing_unix_fds' mangled-name='dbus_connection_get_outgoing_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_unix_fds'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_dbus_connection_get_stats' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6249' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6249' column='1'/>
      <parameter type-id='type-id-73' name='in_messages' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6250' column='1'/>
      <parameter type-id='type-id-73' name='in_bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6251' column='1'/>
      <parameter type-id='type-id-73' name='in_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6252' column='1'/>
      <parameter type-id='type-id-73' name='in_peak_bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6253' column='1'/>
      <parameter type-id='type-id-73' name='in_peak_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6254' column='1'/>
      <parameter type-id='type-id-73' name='out_messages' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6255' column='1'/>
      <parameter type-id='type-id-73' name='out_bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6256' column='1'/>
      <parameter type-id='type-id-73' name='out_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6257' column='1'/>
      <parameter type-id='type-id-73' name='out_peak_bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6258' column='1'/>
      <parameter type-id='type-id-73' name='out_peak_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6259' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_outgoing_size' mangled-name='dbus_connection_get_outgoing_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_size'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='dbus_connection_get_max_received_unix_fds' mangled-name='dbus_connection_get_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_unix_fds'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='dbus_connection_set_max_received_unix_fds' mangled-name='dbus_connection_set_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_unix_fds'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1'/>
      <parameter type-id='type-id-104' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6195' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_max_received_size' mangled-name='dbus_connection_get_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_size'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='dbus_connection_set_max_received_size' mangled-name='dbus_connection_set_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_size'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1'/>
      <parameter type-id='type-id-104' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6153' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_max_message_unix_fds' mangled-name='dbus_connection_get_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_message_unix_fds'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='dbus_connection_set_max_message_unix_fds' mangled-name='dbus_connection_set_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_unix_fds'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1'/>
      <parameter type-id='type-id-104' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6097' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_max_message_size' mangled-name='dbus_connection_get_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_message_size'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='dbus_connection_set_max_message_size' mangled-name='dbus_connection_set_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_size'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1'/>
      <parameter type-id='type-id-104' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6058' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-139'/>
    <function-decl name='dbus_connection_get_object_path_data' mangled-name='dbus_connection_get_object_path_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_object_path_data'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5841' column='1'/>
      <parameter type-id='type-id-3' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5842' column='1'/>
      <parameter type-id='type-id-139' name='data_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5843' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <class-decl name='DBusObjectPathVTable' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='385' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unregister_function' type-id='type-id-141' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message_function' type-id='type-id-142' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dbus_internal_pad1' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dbus_internal_pad2' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dbus_internal_pad3' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dbus_internal_pad4' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='392' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <typedef-decl name='DBusObjectPathUnregisterFunction' type-id='type-id-144' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='367' column='1' id='type-id-141'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-145'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='DBUS_HANDLER_RESULT_HANDLED' value='0'/>
      <enumerator name='DBUS_HANDLER_RESULT_NOT_YET_HANDLED' value='1'/>
      <enumerator name='DBUS_HANDLER_RESULT_NEED_MEMORY' value='2'/>
    </enum-decl>
    <typedef-decl name='DBusHandlerResult' type-id='type-id-145' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='71' column='1' id='type-id-146'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
    <typedef-decl name='DBusObjectPathMessageFunction' type-id='type-id-148' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='374' column='1' id='type-id-142'/>
    <typedef-decl name='DBusObjectPathVTable' type-id='type-id-140' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='53' column='1' id='type-id-149'/>
    <qualified-type-def type-id='type-id-149' const='yes' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-151'/>
    <function-decl name='dbus_connection_register_fallback' mangled-name='dbus_connection_register_fallback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_register_fallback'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5774' column='1'/>
      <parameter type-id='type-id-3' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5775' column='1'/>
      <parameter type-id='type-id-151' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5776' column='1'/>
      <parameter type-id='type-id-8' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5777' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_try_register_fallback' mangled-name='dbus_connection_try_register_fallback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_try_register_fallback'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5742' column='1'/>
      <parameter type-id='type-id-3' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5743' column='1'/>
      <parameter type-id='type-id-151' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5744' column='1'/>
      <parameter type-id='type-id-8' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5745' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5746' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_register_object_path' mangled-name='dbus_connection_register_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_register_object_path'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5702' column='1'/>
      <parameter type-id='type-id-3' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5703' column='1'/>
      <parameter type-id='type-id-151' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5704' column='1'/>
      <parameter type-id='type-id-8' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5705' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_try_register_object_path' mangled-name='dbus_connection_try_register_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_try_register_object_path'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5672' column='1'/>
      <parameter type-id='type-id-3' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5673' column='1'/>
      <parameter type-id='type-id-151' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5674' column='1'/>
      <parameter type-id='type-id-8' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5675' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5676' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <typedef-decl name='DBusHandleMessageFunction' type-id='type-id-148' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='169' column='1' id='type-id-152'/>
    <function-decl name='dbus_connection_remove_filter' mangled-name='dbus_connection_remove_filter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_remove_filter'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1'/>
      <parameter type-id='type-id-152' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5564' column='1'/>
      <parameter type-id='type-id-8' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5565' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_add_filter' mangled-name='dbus_connection_add_filter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_add_filter'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1'/>
      <parameter type-id='type-id-152' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5512' column='1'/>
      <parameter type-id='type-id-8' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5513' column='1'/>
      <parameter type-id='type-id-89' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5514' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_set_route_peer_messages' mangled-name='dbus_connection_set_route_peer_messages' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_route_peer_messages'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5479' column='1'/>
      <parameter type-id='type-id-22' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5480' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_set_allow_anonymous' mangled-name='dbus_connection_set_allow_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_allow_anonymous'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5451' column='1'/>
      <parameter type-id='type-id-22' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5452' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <typedef-decl name='DBusAllowWindowsUserFunction' type-id='type-id-154' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='153' column='1' id='type-id-155'/>
    <function-decl name='dbus_connection_set_windows_user_function' mangled-name='dbus_connection_set_windows_user_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_windows_user_function'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1'/>
      <parameter type-id='type-id-155' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5405' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5406' column='1'/>
      <parameter type-id='type-id-89' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5407' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_windows_user' mangled-name='dbus_connection_get_windows_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_windows_user'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5357' column='1'/>
      <parameter type-id='type-id-33' name='windows_sid_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5358' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-157'/>
    <typedef-decl name='DBusAllowUnixUserFunction' type-id='type-id-157' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='143' column='1' id='type-id-158'/>
    <function-decl name='dbus_connection_set_unix_user_function' mangled-name='dbus_connection_set_unix_user_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_unix_user_function'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1'/>
      <parameter type-id='type-id-158' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5306' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5307' column='1'/>
      <parameter type-id='type-id-89' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5308' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_adt_audit_session_data' mangled-name='dbus_connection_get_adt_audit_session_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_adt_audit_session_data'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5259' column='1'/>
      <parameter type-id='type-id-139' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5260' column='1'/>
      <parameter type-id='type-id-137' name='data_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5261' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-159'/>
    <function-decl name='dbus_connection_get_unix_process_id' mangled-name='dbus_connection_get_unix_process_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_process_id'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5226' column='1'/>
      <parameter type-id='type-id-159' name='pid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5227' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_get_unix_user' mangled-name='dbus_connection_get_unix_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_user'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5190' column='1'/>
      <parameter type-id='type-id-159' name='uid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5191' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_get_socket' mangled-name='dbus_connection_get_socket' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_socket'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5148' column='1'/>
      <parameter type-id='type-id-24' name='fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5149' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_get_unix_fd' mangled-name='dbus_connection_get_unix_fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_fd'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5118' column='1'/>
      <parameter type-id='type-id-24' name='fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5119' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_set_dispatch_status_function' mangled-name='dbus_connection_set_dispatch_status_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_dispatch_status_function'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1'/>
      <parameter type-id='type-id-90' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5074' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5075' column='1'/>
      <parameter type-id='type-id-89' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5076' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_set_wakeup_main_function' mangled-name='dbus_connection_set_wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_wakeup_main_function'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1'/>
      <parameter type-id='type-id-88' name='wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5028' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5029' column='1'/>
      <parameter type-id='type-id-89' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5030' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <typedef-decl name='DBusAddTimeoutFunction' type-id='type-id-161' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='110' column='1' id='type-id-162'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-164'/>
    <typedef-decl name='DBusRemoveTimeoutFunction' type-id='type-id-164' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='123' column='1' id='type-id-165'/>
    <typedef-decl name='DBusTimeoutToggledFunction' type-id='type-id-164' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='117' column='1' id='type-id-166'/>
    <function-decl name='dbus_connection_set_timeout_functions' mangled-name='dbus_connection_set_timeout_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_timeout_functions'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1'/>
      <parameter type-id='type-id-162' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4990' column='1'/>
      <parameter type-id='type-id-165' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4991' column='1'/>
      <parameter type-id='type-id-166' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4992' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4993' column='1'/>
      <parameter type-id='type-id-89' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4994' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <typedef-decl name='DBusAddWatchFunction' type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='91' column='1' id='type-id-169'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <typedef-decl name='DBusRemoveWatchFunction' type-id='type-id-171' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='103' column='1' id='type-id-172'/>
    <typedef-decl name='DBusWatchToggledFunction' type-id='type-id-171' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='97' column='1' id='type-id-173'/>
    <function-decl name='dbus_connection_set_watch_functions' mangled-name='dbus_connection_set_watch_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_watch_functions'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1'/>
      <parameter type-id='type-id-169' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4927' column='1'/>
      <parameter type-id='type-id-172' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4928' column='1'/>
      <parameter type-id='type-id-173' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4929' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4930' column='1'/>
      <parameter type-id='type-id-89' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4931' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_set_exit_on_disconnect' mangled-name='dbus_connection_set_exit_on_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_exit_on_disconnect'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3145' column='1'/>
      <parameter type-id='type-id-22' name='exit_on_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3146' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_is_authenticated' mangled-name='dbus_connection_get_is_authenticated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_authenticated'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2995' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_has_messages_to_send' mangled-name='dbus_connection_has_messages_to_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_has_messages_to_send'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='588' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <class-decl name='DBusPendingCall' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-174'/>
    <typedef-decl name='DBusPendingCall' type-id='type-id-174' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='49' column='1' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <function-decl name='_dbus_connection_remove_pending_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1044' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1044' column='1'/>
      <parameter type-id='type-id-176' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1045' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <class-decl name='DBusPreallocatedSend' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='241' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connection' type-id='type-id-72' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='queue_link' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='counter_link' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='244' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusPreallocatedSend' type-id='type-id-177' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='47' column='1' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <function-decl name='dbus_connection_preallocate_send' mangled-name='dbus_connection_preallocate_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_preallocate_send'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='dbus_connection_get_is_connected' mangled-name='dbus_connection_get_is_connected' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_connected'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_free_preallocated_send' mangled-name='dbus_connection_free_preallocated_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_free_preallocated_send'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1'/>
      <parameter type-id='type-id-179' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3192' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_can_send_type' mangled-name='dbus_connection_can_send_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_can_send_type'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3105' column='1'/>
      <parameter type-id='type-id-9' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3106' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_get_server_id' mangled-name='dbus_connection_get_server_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3074' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_server_id'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3074' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='dbus_connection_get_is_anonymous' mangled-name='dbus_connection_get_is_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_anonymous'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3029' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_unref' mangled-name='dbus_connection_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_unref'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2817' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_unref_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1442' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1442' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <typedef-decl name='DBusPendingFdsChangeFunction' type-id='type-id-113' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection-internal.h' line='47' column='1' id='type-id-180'/>
    <function-decl name='_dbus_connection_set_pending_fds_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2571' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2571' column='1'/>
      <parameter type-id='type-id-180' name='callback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2572' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2573' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_get_pending_fds_count' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2558' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2558' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_dbus_connection_new_for_transport' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1249' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-83' name='transport' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1249' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='_dbus_connection_do_iteration_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1198' column='1'/>
      <parameter type-id='type-id-176' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1199' column='1'/>
      <parameter type-id='type-id-10' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1200' column='1'/>
      <parameter type-id='type-id-9' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1201' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_message_sent_unlocked' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='625' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='625' column='1'/>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='626' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_get_message_to_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='609' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='609' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='_dbus_connection_queue_synthesized_message_link' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='545' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='545' column='1'/>
      <parameter type-id='type-id-6' name='link' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='546' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_get_dispatch_status' mangled-name='dbus_connection_get_dispatch_status' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_dispatch_status'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='dbus_connection_borrow_message' mangled-name='dbus_connection_borrow_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_borrow_message'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='dbus_connection_pop_message' mangled-name='dbus_connection_pop_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_pop_message'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='dbus_connection_steal_borrowed_message' mangled-name='dbus_connection_steal_borrowed_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_steal_borrowed_message'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1'/>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3936' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_return_message' mangled-name='dbus_connection_return_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_return_message'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1'/>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3902' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_flush' mangled-name='dbus_connection_flush' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_flush'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3641' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_send_preallocated' mangled-name='dbus_connection_send_preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_preallocated'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1'/>
      <parameter type-id='type-id-179' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3218' column='1'/>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3219' column='1'/>
      <parameter type-id='type-id-73' name='client_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3220' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_send_and_unlock' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2098' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2098' column='1'/>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2099' column='1'/>
      <parameter type-id='type-id-73' name='client_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2100' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_send' mangled-name='dbus_connection_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1'/>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3303' column='1'/>
      <parameter type-id='type-id-73' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3304' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_close' mangled-name='dbus_connection_close' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_close'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2932' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_connection_open_private' mangled-name='dbus_connection_open_private' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_open_private'>
      <parameter type-id='type-id-3' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2659' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2660' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='dbus_connection_open' mangled-name='dbus_connection_open' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_open'>
      <parameter type-id='type-id-3' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2616' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2617' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='_dbus_connection_close_if_only_one_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2146' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_close_possibly_shared' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1948' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1948' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_connection_handle_watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1486' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1486' column='1'/>
      <parameter type-id='type-id-10' name='condition' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1487' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='1488' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_connection_queue_received_message_link' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='480' column='1'/>
      <parameter type-id='type-id-6' name='link' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='481' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-181'/>
    <function-decl name='dbus_connection_send_with_reply' mangled-name='dbus_connection_send_with_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_with_reply'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1'/>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3400' column='1'/>
      <parameter type-id='type-id-181' name='pending_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3401' column='1'/>
      <parameter type-id='type-id-9' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3402' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_send_with_reply_and_block' mangled-name='dbus_connection_send_with_reply_and_block' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_with_reply_and_block'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1'/>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3536' column='1'/>
      <parameter type-id='type-id-9' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3537' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3538' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='dbus_connection_dispatch' mangled-name='dbus_connection_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_dispatch'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='dbus_connection_read_write' mangled-name='dbus_connection_read_write' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1'/>
      <parameter type-id='type-id-9' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3802' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_read_write_dispatch' mangled-name='dbus_connection_read_write_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write_dispatch'>
      <parameter type-id='type-id-72' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3769' column='1'/>
      <parameter type-id='type-id-9' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3770' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_connection_block_pending_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2379' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-176' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2379' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <var-decl name='_dbus_return_if_fail_warning_format' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-internals.h' line='154' column='1'/>
    <var-decl name='_dbus_no_memory_message' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-internals.h' line='264' column='1'/>
    <var-decl name='_dbus_current_generation' type-id='type-id-9' visibility='default' filepath='../dbus/dbus-internals.h' line='299' column='1'/>
    <var-decl name='_dbus_return_if_fail_warning_format' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-internals.h' line='154' column='1'/>
    <var-decl name='_dbus_no_memory_message' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-internals.h' line='264' column='1'/>
    <var-decl name='_dbus_current_generation' type-id='type-id-9' visibility='default' filepath='../dbus/dbus-internals.h' line='299' column='1'/>
    <function-type size-in-bits='64' id='type-id-112'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-143'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-146'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-153'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-156'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-163'>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-11'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-credentials.c' language='LANG_C89'>
    <class-decl name='DBusCredentials' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='48' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='unix_uid' type-id='type-id-182' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pid' type-id='type-id-183' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='windows_sid' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='adt_audit_data' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adt_audit_data_size' type-id='type-id-95' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='54' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dbus_uid_t' type-id='type-id-74' filepath='../dbus/dbus-sysdeps.h' line='98' column='1' id='type-id-182'/>
    <typedef-decl name='dbus_pid_t' type-id='type-id-74' filepath='../dbus/dbus-sysdeps.h' line='96' column='1' id='type-id-183'/>
    <function-decl name='_dbus_credentials_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='116' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_credentials_add_pid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='149' column='1'/>
      <parameter type-id='type-id-183' name='pid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='150' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_add_unix_uid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='164' column='1'/>
      <parameter type-id='type-id-182' name='uid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='165' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-184'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='DBUS_CREDENTIAL_UNIX_PROCESS_ID' value='0'/>
      <enumerator name='DBUS_CREDENTIAL_UNIX_USER_ID' value='1'/>
      <enumerator name='DBUS_CREDENTIAL_ADT_AUDIT_DATA_ID' value='2'/>
      <enumerator name='DBUS_CREDENTIAL_WINDOWS_SID' value='3'/>
    </enum-decl>
    <typedef-decl name='DBusCredentialType' type-id='type-id-184' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.h' line='38' column='1' id='type-id-185'/>
    <function-decl name='_dbus_credentials_include' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='228' column='1'/>
      <parameter type-id='type-id-185' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='229' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_get_pid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='255' column='1'/>
      <return type-id='type-id-183'/>
    </function-decl>
    <function-decl name='_dbus_credentials_get_unix_uid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='268' column='1'/>
      <return type-id='type-id-182'/>
    </function-decl>
    <function-decl name='_dbus_credentials_get_windows_sid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='281' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_dbus_credentials_get_adt_audit_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='294' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_dbus_credentials_get_adt_audit_data_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='307' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='307' column='1'/>
      <return type-id='type-id-95'/>
    </function-decl>
    <function-decl name='_dbus_credentials_are_empty' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='345' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_are_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='361' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_to_string_append' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='514' column='1'/>
      <parameter type-id='type-id-25' name='string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='515' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_same_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='493' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='493' column='1'/>
      <parameter type-id='type-id-31' name='other_credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='494' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_clear' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='446' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_credentials_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='128' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_credentials_are_superset' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='321' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='321' column='1'/>
      <parameter type-id='type-id-31' name='possible_subset' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='322' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_add_adt_audit_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='204' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='204' column='1'/>
      <parameter type-id='type-id-8' name='audit_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='205' column='1'/>
      <parameter type-id='type-id-95' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='206' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_add_windows_sid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='180' column='1'/>
      <parameter type-id='type-id-3' name='windows_sid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='181' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_add_credential' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='408' column='1'/>
      <parameter type-id='type-id-185' name='which' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='409' column='1'/>
      <parameter type-id='type-id-31' name='other_credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='410' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_add_credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='377' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='377' column='1'/>
      <parameter type-id='type-id-31' name='other_credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='378' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_credentials_new' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='_dbus_credentials_copy' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='464' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='_dbus_credentials_new_from_current_process' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-credentials.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-errors.c' language='LANG_C89'>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-186'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <function-decl name='dbus_error_is_set' mangled-name='dbus_error_is_set' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_is_set'>
      <parameter type-id='type-id-187' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='329' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_error_init' mangled-name='dbus_error_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_init'>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='188' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_error_free' mangled-name='dbus_error_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_free'>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='211' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_move_error' mangled-name='dbus_move_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_move_error'>
      <parameter type-id='type-id-18' name='src' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='279' column='1'/>
      <parameter type-id='type-id-18' name='dest' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='280' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_set_error_const' mangled-name='dbus_set_error_const' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error_const'>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='243' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='244' column='1'/>
      <parameter type-id='type-id-3' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='245' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_set_error' mangled-name='dbus_set_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error'>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='354' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='355' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='356' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_error_has_name' mangled-name='dbus_error_has_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_has_name'>
      <parameter type-id='type-id-187' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='302' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='303' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='_dbus_return_if_fail_warning_format' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='154' column='1'/>
    <var-decl name='_dbus_no_memory_message' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='264' column='1'/>
    <var-decl name='_dbus_return_if_fail_warning_format' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='154' column='1'/>
    <var-decl name='_dbus_no_memory_message' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-internals.h' line='264' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-keyring.c' language='LANG_C89'>
    <class-decl name='DBusKeyring' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='112' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='directory' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='filename' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='filename_lock' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='keys' type-id='type-id-188' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='n_keys' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='credentials' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='119' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='93' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-95' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='creation_time' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='secret' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusKey' type-id='type-id-189' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='103' column='1' id='type-id-190'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-188'/>
    <function-decl name='_dbus_keyring_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='667' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32' name='keyring' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='667' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='_dbus_keyring_get_hex_key' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='1007' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32' name='keyring' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='1007' column='1'/>
      <parameter type-id='type-id-9' name='key_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='1008' column='1'/>
      <parameter type-id='type-id-25' name='hex_key' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='1009' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_keyring_is_for_credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='988' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32' name='keyring' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='988' column='1'/>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='989' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_keyring_get_best_key' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32' name='keyring' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='949' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='950' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_dbus_keyring_validate_context' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='853' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='context' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='853' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_keyring_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='681' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32' name='keyring' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='681' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_keyring_new_for_credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='709' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31' name='credentials' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='709' column='1'/>
      <parameter type-id='type-id-27' name='context' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='710' column='1'/>
      <parameter type-id='type-id-18' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-keyring.c' line='711' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-marshal-header.c' language='LANG_C89'>
    <qualified-type-def type-id='type-id-103' const='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <function-decl name='_dbus_header_get_byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='174' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-193'/>
    <function-decl name='_dbus_header_get_message_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='386' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_dbus_header_get_flag' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1479' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1479' column='1'/>
      <parameter type-id='type-id-21' name='flag' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1480' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_byteswap' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1496' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1496' column='1'/>
      <parameter type-id='type-id-9' name='new_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1497' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_header_toggle_flag' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1457' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1457' column='1'/>
      <parameter type-id='type-id-21' name='flag' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1458' column='1'/>
      <parameter type-id='type-id-22' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1459' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_header_delete_field' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1416' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1416' column='1'/>
      <parameter type-id='type-id-9' name='field' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1417' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_get_field_raw' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1392' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1392' column='1'/>
      <parameter type-id='type-id-9' name='field' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1393' column='1'/>
      <parameter type-id='type-id-65' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1394' column='1'/>
      <parameter type-id='type-id-24' name='pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1395' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_get_field_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1351' column='1'/>
      <parameter type-id='type-id-9' name='field' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1352' column='1'/>
      <parameter type-id='type-id-9' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1353' column='1'/>
      <parameter type-id='type-id-8' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1354' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_set_field_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1273' column='1'/>
      <parameter type-id='type-id-9' name='field' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1274' column='1'/>
      <parameter type-id='type-id-9' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1275' column='1'/>
      <parameter type-id='type-id-8' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1276' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_create' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='528' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='528' column='1'/>
      <parameter type-id='type-id-9' name='byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='529' column='1'/>
      <parameter type-id='type-id-9' name='message_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='530' column='1'/>
      <parameter type-id='type-id-3' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='531' column='1'/>
      <parameter type-id='type-id-3' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='532' column='1'/>
      <parameter type-id='type-id-3' name='interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='533' column='1'/>
      <parameter type-id='type-id-3' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='534' column='1'/>
      <parameter type-id='type-id-3' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='535' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_update_lengths' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1196' column='1'/>
      <parameter type-id='type-id-9' name='body_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='1197' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_header_set_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='404' column='1'/>
      <parameter type-id='type-id-21' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='405' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_header_reinit' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='443' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='443' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-194'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='DBUS_VALIDATION_MODE_WE_TRUST_THIS_DATA_ABSOLUTELY' value='0'/>
      <enumerator name='DBUS_VALIDATION_MODE_DATA_IS_UNTRUSTED' value='1'/>
    </enum-decl>
    <typedef-decl name='DBusValidationMode' type-id='type-id-194' filepath='../dbus/dbus-marshal-validate.h' line='40' column='1' id='type-id-195'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-196'>
      <underlying-type type-id='type-id-38'/>
      <enumerator name='DBUS_VALIDITY_UNKNOWN_OOM_ERROR' value='-4'/>
      <enumerator name='DBUS_INVALID_FOR_UNKNOWN_REASON' value='-3'/>
      <enumerator name='DBUS_VALID_BUT_INCOMPLETE' value='-2'/>
      <enumerator name='DBUS_VALIDITY_UNKNOWN' value='-1'/>
      <enumerator name='DBUS_VALID' value='0'/>
      <enumerator name='DBUS_INVALID_UNKNOWN_TYPECODE' value='1'/>
      <enumerator name='DBUS_INVALID_MISSING_ARRAY_ELEMENT_TYPE' value='2'/>
      <enumerator name='DBUS_INVALID_SIGNATURE_TOO_LONG' value='3'/>
      <enumerator name='DBUS_INVALID_EXCEEDED_MAXIMUM_ARRAY_RECURSION' value='4'/>
      <enumerator name='DBUS_INVALID_EXCEEDED_MAXIMUM_STRUCT_RECURSION' value='5'/>
      <enumerator name='DBUS_INVALID_STRUCT_ENDED_BUT_NOT_STARTED' value='6'/>
      <enumerator name='DBUS_INVALID_STRUCT_STARTED_BUT_NOT_ENDED' value='7'/>
      <enumerator name='DBUS_INVALID_STRUCT_HAS_NO_FIELDS' value='8'/>
      <enumerator name='DBUS_INVALID_ALIGNMENT_PADDING_NOT_NUL' value='9'/>
      <enumerator name='DBUS_INVALID_BOOLEAN_NOT_ZERO_OR_ONE' value='10'/>
      <enumerator name='DBUS_INVALID_NOT_ENOUGH_DATA' value='11'/>
      <enumerator name='DBUS_INVALID_TOO_MUCH_DATA' value='12'/>
      <enumerator name='DBUS_INVALID_BAD_BYTE_ORDER' value='13'/>
      <enumerator name='DBUS_INVALID_BAD_PROTOCOL_VERSION' value='14'/>
      <enumerator name='DBUS_INVALID_BAD_MESSAGE_TYPE' value='15'/>
      <enumerator name='DBUS_INVALID_BAD_SERIAL' value='16'/>
      <enumerator name='DBUS_INVALID_INSANE_FIELDS_ARRAY_LENGTH' value='17'/>
      <enumerator name='DBUS_INVALID_INSANE_BODY_LENGTH' value='18'/>
      <enumerator name='DBUS_INVALID_MESSAGE_TOO_LONG' value='19'/>
      <enumerator name='DBUS_INVALID_HEADER_FIELD_CODE' value='20'/>
      <enumerator name='DBUS_INVALID_HEADER_FIELD_HAS_WRONG_TYPE' value='21'/>
      <enumerator name='DBUS_INVALID_USES_LOCAL_INTERFACE' value='22'/>
      <enumerator name='DBUS_INVALID_USES_LOCAL_PATH' value='23'/>
      <enumerator name='DBUS_INVALID_HEADER_FIELD_APPEARS_TWICE' value='24'/>
      <enumerator name='DBUS_INVALID_BAD_DESTINATION' value='25'/>
      <enumerator name='DBUS_INVALID_BAD_INTERFACE' value='26'/>
      <enumerator name='DBUS_INVALID_BAD_MEMBER' value='27'/>
      <enumerator name='DBUS_INVALID_BAD_ERROR_NAME' value='28'/>
      <enumerator name='DBUS_INVALID_BAD_SENDER' value='29'/>
      <enumerator name='DBUS_INVALID_MISSING_PATH' value='30'/>
      <enumerator name='DBUS_INVALID_MISSING_INTERFACE' value='31'/>
      <enumerator name='DBUS_INVALID_MISSING_MEMBER' value='32'/>
      <enumerator name='DBUS_INVALID_MISSING_ERROR_NAME' value='33'/>
      <enumerator name='DBUS_INVALID_MISSING_REPLY_SERIAL' value='34'/>
      <enumerator name='DBUS_INVALID_LENGTH_OUT_OF_BOUNDS' value='35'/>
      <enumerator name='DBUS_INVALID_ARRAY_LENGTH_EXCEEDS_MAXIMUM' value='36'/>
      <enumerator name='DBUS_INVALID_BAD_PATH' value='37'/>
      <enumerator name='DBUS_INVALID_SIGNATURE_LENGTH_OUT_OF_BOUNDS' value='38'/>
      <enumerator name='DBUS_INVALID_BAD_UTF8_IN_STRING' value='39'/>
      <enumerator name='DBUS_INVALID_ARRAY_LENGTH_INCORRECT' value='40'/>
      <enumerator name='DBUS_INVALID_VARIANT_SIGNATURE_LENGTH_OUT_OF_BOUNDS' value='41'/>
      <enumerator name='DBUS_INVALID_VARIANT_SIGNATURE_BAD' value='42'/>
      <enumerator name='DBUS_INVALID_VARIANT_SIGNATURE_EMPTY' value='43'/>
      <enumerator name='DBUS_INVALID_VARIANT_SIGNATURE_SPECIFIES_MULTIPLE_VALUES' value='44'/>
      <enumerator name='DBUS_INVALID_VARIANT_SIGNATURE_MISSING_NUL' value='45'/>
      <enumerator name='DBUS_INVALID_STRING_MISSING_NUL' value='46'/>
      <enumerator name='DBUS_INVALID_SIGNATURE_MISSING_NUL' value='47'/>
      <enumerator name='DBUS_INVALID_EXCEEDED_MAXIMUM_DICT_ENTRY_RECURSION' value='48'/>
      <enumerator name='DBUS_INVALID_DICT_ENTRY_ENDED_BUT_NOT_STARTED' value='49'/>
      <enumerator name='DBUS_INVALID_DICT_ENTRY_STARTED_BUT_NOT_ENDED' value='50'/>
      <enumerator name='DBUS_INVALID_DICT_ENTRY_HAS_NO_FIELDS' value='51'/>
      <enumerator name='DBUS_INVALID_DICT_ENTRY_HAS_ONLY_ONE_FIELD' value='52'/>
      <enumerator name='DBUS_INVALID_DICT_ENTRY_HAS_TOO_MANY_FIELDS' value='53'/>
      <enumerator name='DBUS_INVALID_DICT_ENTRY_NOT_INSIDE_ARRAY' value='54'/>
      <enumerator name='DBUS_INVALID_DICT_KEY_MUST_BE_BASIC_TYPE' value='55'/>
      <enumerator name='DBUS_INVALID_MISSING_UNIX_FDS' value='56'/>
      <enumerator name='DBUS_INVALID_NESTED_TOO_DEEPLY' value='57'/>
      <enumerator name='DBUS_VALIDITY_LAST' value='58'/>
    </enum-decl>
    <typedef-decl name='DBusValidity' type-id='type-id-196' filepath='../dbus/dbus-marshal-validate.h' line='117' column='1' id='type-id-197'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <function-decl name='_dbus_header_load' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='970' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='970' column='1'/>
      <parameter type-id='type-id-195' name='mode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='971' column='1'/>
      <parameter type-id='type-id-198' name='validity' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='972' column='1'/>
      <parameter type-id='type-id-9' name='byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='973' column='1'/>
      <parameter type-id='type-id-9' name='fields_array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='974' column='1'/>
      <parameter type-id='type-id-9' name='header_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='975' column='1'/>
      <parameter type-id='type-id-9' name='body_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='976' column='1'/>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='977' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='978' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='979' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_have_message_untrusted' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='673' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9' name='max_message_length' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='673' column='1'/>
      <parameter type-id='type-id-198' name='validity' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='674' column='1'/>
      <parameter type-id='type-id-24' name='byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='675' column='1'/>
      <parameter type-id='type-id-24' name='fields_array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='676' column='1'/>
      <parameter type-id='type-id-24' name='header_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='677' column='1'/>
      <parameter type-id='type-id-24' name='body_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='678' column='1'/>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='679' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='680' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='681' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_get_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='427' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='427' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='_dbus_header_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='460' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_copy' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='490' column='1'/>
      <parameter type-id='type-id-193' name='dest' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='491' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_header_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='476' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-header.c' line='476' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-marshal-byteswap.c' language='LANG_C89'>
    <function-decl name='_dbus_marshal_byteswap' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-byteswap.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-byteswap.c' line='222' column='1'/>
      <parameter type-id='type-id-9' name='signature_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-byteswap.c' line='223' column='1'/>
      <parameter type-id='type-id-9' name='old_byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-byteswap.c' line='224' column='1'/>
      <parameter type-id='type-id-9' name='new_byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-byteswap.c' line='225' column='1'/>
      <parameter type-id='type-id-25' name='value_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-byteswap.c' line='226' column='1'/>
      <parameter type-id='type-id-9' name='value_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-byteswap.c' line='227' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-marshal-recursive.c' language='LANG_C89'>
    <function-decl name='_dbus_type_signature_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='340' column='1'/>
      <parameter type-id='type-id-24' name='type_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='341' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <class-decl name='DBusTypeReader' size-in-bits='448' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='40' column='1' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='byte_order' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='finished' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='array_len_offset' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type_str' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type_pos' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value_str' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='value_pos' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='klass' type-id='type-id-200' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='u' type-id='type-id-201' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusTypeReaderClass' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='126' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='types_only' type-id='type-id-22' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='recurse' type-id='type-id-203' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='check_finished' type-id='type-id-204' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='next' type-id='type-id-205' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='133' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusTypeReader' type-id='type-id-199' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='30' column='1' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-203'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-209'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-205'/>
    <typedef-decl name='DBusTypeReaderClass' type-id='type-id-202' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='32' column='1' id='type-id-213'/>
    <qualified-type-def type-id='type-id-213' const='yes' id='type-id-214'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-200'/>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='54' column='1' id='type-id-201'>
      <data-member access='private'>
        <var-decl name='array' type-id='type-id-215' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='55' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start_pos' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='_dbus_type_reader_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='732' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-207' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='732' column='1'/>
      <parameter type-id='type-id-9' name='byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='733' column='1'/>
      <parameter type-id='type-id-27' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='734' column='1'/>
      <parameter type-id='type-id-9' name='type_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='735' column='1'/>
      <parameter type-id='type-id-27' name='value_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='736' column='1'/>
      <parameter type-id='type-id-9' name='value_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='737' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_init_types_only' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='760' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-207' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='760' column='1'/>
      <parameter type-id='type-id-27' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='761' column='1'/>
      <parameter type-id='type-id-9' name='type_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='762' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_get_value_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='837' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='837' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-216'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-217'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
    <function-decl name='_dbus_type_reader_read_raw' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='852' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='852' column='1'/>
      <parameter type-id='type-id-219' name='value_location' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='853' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1122' column='1'/>
      <parameter type-id='type-id-65' name='str_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1123' column='1'/>
      <parameter type-id='type-id-24' name='start_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1124' column='1'/>
      <parameter type-id='type-id-24' name='len_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1125' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <class-decl name='DBusTypeWriter' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='65' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='byte_order' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='container_type' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type_pos_is_expectation' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enabled' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type_str' type-id='type-id-25' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type_pos' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value_str' type-id='type-id-25' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='value_pos' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='u' type-id='type-id-221' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='80' column='1' id='type-id-221'>
      <data-member access='private'>
        <var-decl name='array' type-id='type-id-222' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='81' column='1' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start_pos' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='len_pos' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='element_type_pos' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusTypeWriter' type-id='type-id-220' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.h' line='31' column='1' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-224'/>
    <function-decl name='_dbus_type_writer_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1490' column='1'/>
      <parameter type-id='type-id-9' name='byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1491' column='1'/>
      <parameter type-id='type-id-25' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1492' column='1'/>
      <parameter type-id='type-id-9' name='type_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1493' column='1'/>
      <parameter type-id='type-id-25' name='value_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1494' column='1'/>
      <parameter type-id='type-id-9' name='value_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1495' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_init_types_delayed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1525' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1525' column='1'/>
      <parameter type-id='type-id-9' name='byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1526' column='1'/>
      <parameter type-id='type-id-25' name='value_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1527' column='1'/>
      <parameter type-id='type-id-9' name='value_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1528' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_add_types' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1543' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1543' column='1'/>
      <parameter type-id='type-id-25' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1544' column='1'/>
      <parameter type-id='type-id-9' name='type_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1545' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_remove_types' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1560' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1560' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_init_values_only' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1581' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1581' column='1'/>
      <parameter type-id='type-id-9' name='byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1582' column='1'/>
      <parameter type-id='type-id-27' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1583' column='1'/>
      <parameter type-id='type-id-9' name='type_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1584' column='1'/>
      <parameter type-id='type-id-25' name='value_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1585' column='1'/>
      <parameter type-id='type-id-9' name='value_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1586' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_get_array_length' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='899' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='899' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_get_element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='820' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_get_current_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='785' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='785' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1051' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-207' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1051' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_has_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1091' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1091' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_recurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='988' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-207' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='988' column='1'/>
      <parameter type-id='type-id-207' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='989' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_write_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2308' column='1'/>
      <parameter type-id='type-id-9' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2309' column='1'/>
      <parameter type-id='type-id-8' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2310' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_append_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2140' column='1'/>
      <parameter type-id='type-id-27' name='contained_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2141' column='1'/>
      <parameter type-id='type-id-9' name='contained_type_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2142' column='1'/>
      <parameter type-id='type-id-224' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2143' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_recurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2106' column='1'/>
      <parameter type-id='type-id-9' name='container_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2107' column='1'/>
      <parameter type-id='type-id-27' name='contained_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2108' column='1'/>
      <parameter type-id='type-id-9' name='contained_type_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2109' column='1'/>
      <parameter type-id='type-id-224' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2110' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_read_fixed_multi' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='923' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='923' column='1'/>
      <parameter type-id='type-id-8' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='924' column='1'/>
      <parameter type-id='type-id-24' name='n_elements' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='925' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_unrecurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2176' column='1'/>
      <parameter type-id='type-id-224' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2177' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_write_fixed_multi' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2356' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2356' column='1'/>
      <parameter type-id='type-id-9' name='element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2357' column='1'/>
      <parameter type-id='type-id-8' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2358' column='1'/>
      <parameter type-id='type-id-9' name='n_elements' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2359' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_read_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='869' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='869' column='1'/>
      <parameter type-id='type-id-8' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='870' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_type_writer_write_reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2728' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224' name='writer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2728' column='1'/>
      <parameter type-id='type-id-207' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='2729' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_delete' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1417' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-207' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1417' column='1'/>
      <parameter type-id='type-id-210' name='realign_root' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1418' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_type_reader_set_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-207' name='reader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1360' column='1'/>
      <parameter type-id='type-id-8' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1361' column='1'/>
      <parameter type-id='type-id-210' name='realign_root' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-recursive.c' line='1362' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-208'>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-211'>
      <parameter type-id='type-id-210'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-212'>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-11'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-marshal-validate.c' language='LANG_C89'>
    <function-decl name='_dbus_validity_to_error_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='837' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-197' name='validity' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='837' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_dbus_check_is_valid_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1255' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1255' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_validate_bus_namespace' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1208' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1208' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1209' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1210' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_validate_bus_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1187' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1188' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1189' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_check_is_valid_bus_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1251' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_validate_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='997' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='997' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='998' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='999' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_check_is_valid_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1247' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_validate_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='921' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='921' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='922' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='923' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_check_is_valid_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1245' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_validate_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1058' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1058' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1059' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1060' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_check_is_valid_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1249' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1249' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_validate_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='785' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='785' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='786' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='787' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_check_is_valid_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1243' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1243' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_validate_signature_with_reason' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='51' column='1'/>
      <parameter type-id='type-id-9' name='type_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='52' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='53' column='1'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='_dbus_validate_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1228' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1228' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1229' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1230' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_check_is_valid_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='1253' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_validate_body_with_reason' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='703' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27' name='expected_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='703' column='1'/>
      <parameter type-id='type-id-9' name='expected_signature_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='704' column='1'/>
      <parameter type-id='type-id-9' name='byte_order' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='705' column='1'/>
      <parameter type-id='type-id-24' name='bytes_remaining' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='706' column='1'/>
      <parameter type-id='type-id-27' name='value_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='707' column='1'/>
      <parameter type-id='type-id-9' name='value_pos' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='708' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-marshal-validate.c' line='709' column='1'/>
      <return type-id='type-id-197'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dbus-message.c' language='LANG_C89'>
    <function-decl name='_dbus_message_get_network_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='208' column='1'/>
      <parameter type-id='type-id-65' name='header' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='209' column='1'/>
      <parameter type-id='type-id-65' name='body' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='210' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-225'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-228'/>
    <function-decl name='_dbus_message_get_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='227' column='1'/>
      <parameter type-id='type-id-227' name='fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='228' column='1'/>
      <parameter type-id='type-id-228' name='n_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='229' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_message_contains_unix_fds' mangled-name='dbus_message_contains_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_contains_unix_fds'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <class-decl name='DBusMessageLoader' size-in-bits='768' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='61' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-5' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='messages' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max_message_size' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='max_message_unix_fds' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='corruption_reason' type-id='type-id-197' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='corrupted' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='buffer_outstanding' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='unix_fds_outstanding' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unix_fds' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='n_unix_fds_allocated' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='n_unix_fds' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='unix_fds_change' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unix_fds_change_data' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusMessageLoader' type-id='type-id-229' filepath='../dbus/dbus-message-internal.h' line='48' column='1' id='type-id-230'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <function-decl name='_dbus_message_loader_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3911' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3911' column='1'/>
      <return type-id='type-id-231'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_get_buffer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3962' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3962' column='1'/>
      <parameter type-id='type-id-66' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3963' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_return_buffer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3982' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3982' column='1'/>
      <parameter type-id='type-id-25' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3983' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_return_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4051' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4051' column='1'/>
      <parameter type-id='type-id-24' name='fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4052' column='1'/>
      <parameter type-id='type-id-10' name='n_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4053' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_peek_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4365' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4365' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_get_is_corrupted' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4424' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4424' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_get_corruption_reason' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4438' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4438' column='1'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_set_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4453' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4453' column='1'/>
      <parameter type-id='type-id-104' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4454' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_get_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4472' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4472' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_set_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4484' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4484' column='1'/>
      <parameter type-id='type-id-104' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4485' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_get_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4503' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4503' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_get_pending_fds_count' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4514' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_set_pending_fds_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4532' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4532' column='1'/>
      <parameter type-id='type-id-113' name='callback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4533' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4534' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_message_type_to_string' mangled-name='dbus_message_type_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_type_to_string'>
      <parameter type-id='type-id-9' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4691' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_message_demarshal_bytes_needed' mangled-name='dbus_message_demarshal_bytes_needed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_demarshal_bytes_needed'>
      <parameter type-id='type-id-3' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4841' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4842' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='dbus_message_type_from_string' mangled-name='dbus_message_type_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_type_from_string'>
      <parameter type-id='type-id-3' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4663' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='dbus_message_get_data' mangled-name='dbus_message_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_data'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1'/>
      <parameter type-id='type-id-95' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4636' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dbus_message_set_data' mangled-name='dbus_message_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_data'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1'/>
      <parameter type-id='type-id-95' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4600' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4601' column='1'/>
      <parameter type-id='type-id-89' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4602' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_free_data_slot' mangled-name='dbus_message_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_free_data_slot'>
      <parameter type-id='type-id-137' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4578' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_message_allocate_data_slot' mangled-name='dbus_message_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_allocate_data_slot'>
      <parameter type-id='type-id-137' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4560' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_putback_message_link' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4408' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4408' column='1'/>
      <parameter type-id='type-id-6' name='link' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4409' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_pop_message_link' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4396' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4396' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_pop_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4382' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4382' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='dbus_message_ref' mangled-name='dbus_message_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_ref'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_new' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3863' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-231'/>
    </function-decl>
    <function-decl name='dbus_message_get_sender' mangled-name='dbus_message_get_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_sender'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_message_has_sender' mangled-name='dbus_message_has_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_sender'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3726' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_get_destination' mangled-name='dbus_message_get_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_destination'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_message_has_destination' mangled-name='dbus_message_has_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_destination'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3691' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_get_error_name' mangled-name='dbus_message_get_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_error_name'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_message_get_member' mangled-name='dbus_message_get_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_member'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_message_has_member' mangled-name='dbus_message_has_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_member'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1'/>
      <parameter type-id='type-id-3' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3336' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_get_interface' mangled-name='dbus_message_get_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_interface'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_message_has_interface' mangled-name='dbus_message_has_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_interface'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1'/>
      <parameter type-id='type-id-3' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3250' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_get_path' mangled-name='dbus_message_get_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_message_has_path' mangled-name='dbus_message_has_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_path'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1'/>
      <parameter type-id='type-id-3' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3121' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_get_reply_serial' mangled-name='dbus_message_get_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_reply_serial'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='dbus_message_get_signature' mangled-name='dbus_message_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_signature'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dbus_message_has_signature' mangled-name='dbus_message_has_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_signature'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1'/>
      <parameter type-id='type-id-3' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3755' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-232'/>
    <function-decl name='_dbus_message_loader_get_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4002' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4002' column='1'/>
      <parameter type-id='type-id-232' name='fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4003' column='1'/>
      <parameter type-id='type-id-228' name='max_n_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4004' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dbus_message_loader_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3925' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231' name='loader' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3925' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_message_set_sender' mangled-name='dbus_message_set_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_sender'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1'/>
      <parameter type-id='type-id-3' name='sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3480' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_set_destination' mangled-name='dbus_message_set_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_destination'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1'/>
      <parameter type-id='type-id-3' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3426' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_set_reply_serial' mangled-name='dbus_message_set_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_reply_serial'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1'/>
      <parameter type-id='type-id-21' name='reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1144' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_set_error_name' mangled-name='dbus_message_set_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_error_name'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1'/>
      <parameter type-id='type-id-3' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3372' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_set_member' mangled-name='dbus_message_set_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_member'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1'/>
      <parameter type-id='type-id-3' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3287' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_set_interface' mangled-name='dbus_message_set_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_interface'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1'/>
      <parameter type-id='type-id-3' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3199' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_get_path_decomposed' mangled-name='dbus_message_get_path_decomposed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path_decomposed'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1'/>
      <parameter type-id='type-id-138' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3165' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_set_path' mangled-name='dbus_message_set_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_path'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1'/>
      <parameter type-id='type-id-3' name='object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3068' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_get_auto_start' mangled-name='dbus_message_get_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_auto_start'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_get_no_reply' mangled-name='dbus_message_get_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_no_reply'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_set_auto_start' mangled-name='dbus_message_set_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_auto_start'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1'/>
      <parameter type-id='type-id-22' name='auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3027' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dbus_message_set_no_reply' mangled-name='dbus_message_set_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_no_reply'>
      <parameter type-id='type-id-81' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1'/>
      <parameter type-id='type-id-22' name='no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2985' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <class-decl name='DBusMessageIter' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-message.h' line='52' column='1' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
