<abi-corpus path='data/test-read-dwarf/test16-pr18904.so' soname='liboffloadmic_host.so.5'>
  <elf-needed>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='ORSLRelease' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReservePartial' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLTryReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_find_associated_mic_memory' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_physical_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_number_of_devices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='omp_init_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_init_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_default_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_dynamic_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_nested_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_num_threads_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_schedule_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_test_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_test_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_unset_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_unset_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZN3COI13EngineGetInfoE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI18PipelineSetCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI20PipelineClearCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI21EventRegisterCallbackE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine12m_func_namesE' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine14c_signal_namesE' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream11all_streamsE' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream13m_stream_lockE' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream15m_streams_countE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_major_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_minor_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_is_attached' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_exe_name' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_id' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_so_pid' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_func_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_init_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_var_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_vtable_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../../gcc/liboffloadmic/runtime/dv_util.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>



  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../../gcc/liboffloadmic/runtime/offload_common.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-2'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <type-decl name='void' id='type-id-5'/>
    <typedef-decl name='size_t' type-id='type-id-4' filepath='/export/users/iverbin/gcc_build_host/gcc/include/stddef.h' line='216' column='1' id='type-id-6'/>
    <typedef-decl name='int64_t' type-id='type-id-2' filepath='/usr/include/sys/types.h' line='197' column='1' id='type-id-7'/>
    <class-decl name='Marshaller' size-in-bits='256' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='388' column='1' id='type-id-8'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='buffer_start' type-id='type-id-9' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='392' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='buffer_ptr' type-id='type-id-9' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='395' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='buffer_size' type-id='type-id-3' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='398' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='tfr_size' type-id='type-id-3' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='401' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Marshaller' mangled-name='_ZN10MarshallerC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='405' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='get_tfr_size' mangled-name='_ZNK10Marshaller12get_tfr_sizeEv' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK10Marshaller12get_tfr_sizeEv'>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='get_buffer_start' mangled-name='_ZNK10Marshaller16get_buffer_startEv' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-9'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='get_buffer_size' mangled-name='_ZNK10Marshaller15get_buffer_sizeEv' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='424' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_buffer' mangled-name='_ZN10Marshaller11init_bufferEPcx' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10Marshaller11init_bufferEPcx'>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='send_data' mangled-name='_ZN10Marshaller9send_dataEPKvl' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10Marshaller9send_dataEPKvl'>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-7'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='receive_data' mangled-name='_ZN10Marshaller12receive_dataEPvl' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10Marshaller12receive_dataEPvl'>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-7'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='send_func_ptr' mangled-name='_ZN10Marshaller13send_func_ptrEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10Marshaller13send_func_ptrEPKv'>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='receive_func_ptr' mangled-name='_ZN10Marshaller16receive_func_ptrEPPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10Marshaller16receive_func_ptrEPPKv'>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Marshaller' mangled-name='_ZN10MarshallerC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10MarshallerC2Ev'>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-9'/>
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-13'/>



    <function-decl name='__offload_malloc' mangled-name='_Z16__offload_mallocmm' filepath='../../../gcc/liboffloadmic/runtime/offload_common.cpp' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16__offload_mallocmm'>
      <parameter type-id='type-id-6' name='size' filepath='../../../gcc/liboffloadmic/runtime/offload_common.cpp' line='168' column='1'/>
      <parameter type-id='type-id-6' name='align' filepath='../../../gcc/liboffloadmic/runtime/offload_common.cpp' line='169' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../../gcc/liboffloadmic/runtime/offload_table.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>

    <type-decl name='bool' size-in-bits='8' id='type-id-15'/>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-16'>
      <subrange length='40' type-id='type-id-17' id='type-id-18'/>

    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-20'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-17'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-21'/>
    <class-decl name='FuncList' size-in-bits='448' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='106' column='1' id='type-id-22'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-23'/>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_max_name_len' type-id='type-id-7' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='135' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='FuncList' mangled-name='_ZN8FuncListC4EPN9TableListI9FuncTableE4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN8FuncList9add_tableEPN9TableListI9FuncTableE4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='find_addr' mangled-name='_ZN8FuncList9find_addrEPKc' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='find_name' mangled-name='_ZN8FuncList9find_nameEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='max_name_length' mangled-name='_ZN8FuncList15max_name_lengthEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='dump' mangled-name='_ZN8FuncList4dumpEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='FuncList' mangled-name='_ZN8FuncListC2EPN9TableListI9FuncTableE4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TableList&lt;FuncTable&gt;' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='41' column='1' id='type-id-23'>

        <member-type access='private'>
          <class-decl name='Node' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='47' column='1' id='type-id-27'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='table' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='48' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='prev' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='49' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='next' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='50' column='1'/>
            </data-member>
          </class-decl>
        </member-type>

        <member-type access='private'>
          <typedef-decl name='Table' type-id='type-id-29' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='44' column='1' id='type-id-28'/>
        </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_head' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='80' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_lock' type-id='type-id-30' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='81' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI9FuncTableEC4EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN9TableListI9FuncTableE9add_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI9FuncTableE9add_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_table' mangled-name='_ZN9TableListI9FuncTableE12remove_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI9FuncTableE12remove_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI9FuncTableEC2EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI9FuncTableEC2EPNS1_4NodeE'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='VarTable' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='139' column='1' id='type-id-32'>

        <member-type access='public'>
          <class-decl name='Entry' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='150' column='1' id='type-id-33'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='name' type-id='type-id-26' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='151' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='addr' type-id='type-id-12' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='152' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='size' type-id='type-id-34' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='155' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='type-id-35' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FuncTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='85' column='1' id='type-id-29'>

        <member-type access='public'>
          <class-decl name='Entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='93' column='1' id='type-id-36'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='name' type-id='type-id-26' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='94' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='func' type-id='type-id-12' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='95' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='type-id-37' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_name_len' type-id='type-id-7' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-38' filepath='/usr/include/bits/pthreadtypes.h' line='127' column='1' id='type-id-39'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='91' column='1' id='type-id-38'>
      <member-type access='private'>
        <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='92' column='1' id='type-id-40'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='__lock' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='94' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='__count' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='95' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='__owner' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='96' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='__nusers' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='98' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='__kind' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='__spins' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='104' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='176'>
            <var-decl name='__elision' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='105' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='__list' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='124' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-16' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='125' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='126' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-42' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' id='type-id-41'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='75' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='intptr_t' type-id='type-id-2' filepath='/usr/include/stdint.h' line='119' column='1' id='type-id-44'/>
    <typedef-decl name='uint64_t' type-id='type-id-4' filepath='/usr/include/stdint.h' line='55' column='1' id='type-id-34'/>
    <class-decl name='VarList' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='169' column='1' id='type-id-45'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-46'/>

        <member-type access='private'>
          <class-decl name='BufEntry' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='185' column='1' id='type-id-47'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='name' type-id='type-id-44' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='186' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='addr' type-id='type-id-44' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='187' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      <member-function access='private' constructor='yes'>
        <function-decl name='VarList' mangled-name='_ZN7VarListC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='dump' mangled-name='_ZN7VarList4dumpEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_head' mangled-name='_ZN7VarList8get_headEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <return type-id='type-id-49'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='table_size' mangled-name='_ZN7VarList10table_sizeERl' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-50'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='table_copy' mangled-name='_ZN7VarList10table_copyEPvl' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-7'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='table_patch_names' mangled-name='_ZN7VarList17table_patch_namesEPvl' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-7'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='VarList' mangled-name='_ZN7VarListC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MYOVarTable' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='353' column='1' id='type-id-51'>

        <member-type access='public'>
          <typedef-decl name='Entry' type-id='type-id-53' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='354' column='1' id='type-id-52'/>
        </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='355' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SharedTableEntry' type-id='type-id-55' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='270' column='1' id='type-id-53'/>
    <typedef-decl name='MyoiSharedVarEntry' type-id='type-id-56' filepath='../../../gcc/liboffloadmic/include/myo/myoimpl.h' line='357' column='1' id='type-id-55'/>
    <class-decl name='MYOFuncTable' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='383' column='1' id='type-id-57'>

        <member-type access='public'>
          <typedef-decl name='Entry' type-id='type-id-59' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='384' column='1' id='type-id-58'/>
        </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='type-id-60' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='385' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FptrTableEntry' type-id='type-id-61' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='286' column='1' id='type-id-59'/>
    <class-decl name='MYOInitTable' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='410' column='1' id='type-id-62'>

        <member-type access='public'>
          <typedef-decl name='Entry' type-id='type-id-64' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='411' column='1' id='type-id-63'/>
        </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='type-id-65' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='412' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='InitTableEntry' type-id='type-id-66' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='296' column='1' id='type-id-64'/>
    <typedef-decl name='MyoArena' type-id='type-id-21' filepath='../../../gcc/liboffloadmic/include/myo/myotypes.h' line='140' column='1' id='type-id-67'/>
    <class-decl name='mutex_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='82' column='1' id='type-id-30'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_lock' type-id='type-id-39' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='119' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='mutex_t' mangled-name='_ZN7mutex_tC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~mutex_t' mangled-name='_ZN7mutex_tD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='lock' mangled-name='_ZN7mutex_t4lockEv' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_t4lockEv'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='unlock' mangled-name='_ZN7mutex_t6unlockEv' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_t6unlockEv'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~mutex_t' mangled-name='_ZN7mutex_tD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tD1Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='mutex_t' mangled-name='_ZN7mutex_tC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tC2Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~mutex_t' mangled-name='_ZN7mutex_tD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tD1Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='mutex_t' mangled-name='_ZN7mutex_tC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tC2Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~mutex_t' mangled-name='_ZN7mutex_tD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tD1Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='mutex_t' mangled-name='_ZN7mutex_tC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tC2Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~mutex_t' mangled-name='_ZN7mutex_tD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tD1Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='mutex_t' mangled-name='_ZN7mutex_tC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tC2Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~mutex_t' mangled-name='_ZN7mutex_tD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tD1Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='mutex_t' mangled-name='_ZN7mutex_tC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_util.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7mutex_tC2Ev'>
          <parameter type-id='type-id-68' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TableList&lt;MYOInitTable&gt;' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='41' column='1' id='type-id-69'>

        <member-type access='private'>
          <typedef-decl name='Table' type-id='type-id-62' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='44' column='1' id='type-id-70'/>
        </member-type>

        <member-type access='private'>
          <class-decl name='Node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='47' column='1' id='type-id-71'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='table' type-id='type-id-70' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='48' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='prev' type-id='type-id-72' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='49' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='next' type-id='type-id-72' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='50' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_head' type-id='type-id-72' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='80' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_lock' type-id='type-id-30' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='81' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI12MYOInitTableEC4EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-73' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN9TableListI12MYOInitTableE9add_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI12MYOInitTableE9add_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-73' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_table' mangled-name='_ZN9TableListI12MYOInitTableE12remove_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI12MYOInitTableE12remove_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-73' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI12MYOInitTableEC2EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI12MYOInitTableEC1EPNS1_4NodeE'>
          <parameter type-id='type-id-73' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TableList&lt;MYOFuncTable&gt;' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='41' column='1' id='type-id-74'>

        <member-type access='private'>
          <typedef-decl name='Table' type-id='type-id-57' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='44' column='1' id='type-id-75'/>
        </member-type>

        <member-type access='private'>
          <class-decl name='Node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='47' column='1' id='type-id-76'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='table' type-id='type-id-75' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='48' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='prev' type-id='type-id-77' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='49' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='next' type-id='type-id-77' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='50' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_head' type-id='type-id-77' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='80' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_lock' type-id='type-id-30' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='81' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI12MYOFuncTableEC4EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN9TableListI12MYOFuncTableE9add_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI12MYOFuncTableE9add_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_table' mangled-name='_ZN9TableListI12MYOFuncTableE12remove_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI12MYOFuncTableE12remove_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI12MYOFuncTableEC2EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI12MYOFuncTableEC1EPNS1_4NodeE'>
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TableList&lt;MYOVarTable&gt;' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='41' column='1' id='type-id-79'>

        <member-type access='private'>
          <typedef-decl name='Table' type-id='type-id-51' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='44' column='1' id='type-id-80'/>
        </member-type>

        <member-type access='private'>
          <class-decl name='Node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='47' column='1' id='type-id-81'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='table' type-id='type-id-80' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='48' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='prev' type-id='type-id-82' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='49' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='next' type-id='type-id-82' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='50' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_head' type-id='type-id-82' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='80' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_lock' type-id='type-id-30' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='81' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI11MYOVarTableEC4EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-82'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN9TableListI11MYOVarTableE9add_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI11MYOVarTableE9add_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-82'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_table' mangled-name='_ZN9TableListI11MYOVarTableE12remove_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI11MYOVarTableE12remove_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-82'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI11MYOVarTableEC2EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI11MYOVarTableEC2EPNS1_4NodeE'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-82'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MYOInitTableList' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='415' column='1' id='type-id-84'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-69'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='MYOInitTableList' mangled-name='_ZN16MYOInitTableListC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='417' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN16MYOInitTableList9add_tableEPN9TableListI12MYOInitTableE4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOInitTableList9add_tableEPN9TableListI12MYOInitTableE4NodeE'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='dump' mangled-name='_ZN16MYOInitTableList4dumpEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOInitTableList4dumpEv'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='is_empty' mangled-name='_ZN16MYOInitTableList8is_emptyEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOInitTableList8is_emptyEv'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <return type-id='type-id-15'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='process' mangled-name='_ZN16MYOInitTableList7processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOInitTableList7processEv'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MYOInitTableList' mangled-name='_ZN16MYOInitTableListC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOInitTableListC2Ev'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MYOFuncTableList' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='388' column='1' id='type-id-86'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-74'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='MYOFuncTableList' mangled-name='_ZN16MYOFuncTableListC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-87' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN16MYOFuncTableList9add_tableEPN9TableListI12MYOFuncTableE4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOFuncTableList9add_tableEPN9TableListI12MYOFuncTableE4NodeE'>
          <parameter type-id='type-id-87' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='dump' mangled-name='_ZN16MYOFuncTableList4dumpEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOFuncTableList4dumpEv'>
          <parameter type-id='type-id-87' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='is_empty' mangled-name='_ZN16MYOFuncTableList8is_emptyEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOFuncTableList8is_emptyEv'>
          <parameter type-id='type-id-87' is-artificial='yes'/>
          <return type-id='type-id-15'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='process' mangled-name='_ZN16MYOFuncTableList7processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOFuncTableList7processEv'>
          <parameter type-id='type-id-87' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MYOFuncTableList' mangled-name='_ZN16MYOFuncTableListC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16MYOFuncTableListC1Ev'>
          <parameter type-id='type-id-87' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MYOVarTableList' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='358' column='1' id='type-id-88'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-79'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='MYOVarTableList' mangled-name='_ZN15MYOVarTableListC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN15MYOVarTableList9add_tableEPN9TableListI11MYOVarTableE4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MYOVarTableList9add_tableEPN9TableListI11MYOVarTableE4NodeE'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <parameter type-id='type-id-82'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='dump' mangled-name='_ZN15MYOVarTableList4dumpEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MYOVarTableList4dumpEv'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='is_empty' mangled-name='_ZN15MYOVarTableList8is_emptyEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MYOVarTableList8is_emptyEv'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-15'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='process' mangled-name='_ZN15MYOVarTableList7processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MYOVarTableList7processEv'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='process_vtable' mangled-name='_ZN15MYOVarTableList14process_vtableEv' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MYOVarTableList14process_vtableEv'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MYOVarTableList' mangled-name='_ZN15MYOVarTableListC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MYOVarTableListC1Ev'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TableList&lt;VarTable&gt;' size-in-bits='384' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='41' column='1' id='type-id-46'>

        <member-type access='private'>
          <typedef-decl name='Table' type-id='type-id-32' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='44' column='1' id='type-id-90'/>
        </member-type>

        <member-type access='private'>
          <class-decl name='Node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='47' column='1' id='type-id-91'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='table' type-id='type-id-90' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='48' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='prev' type-id='type-id-49' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='49' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='next' type-id='type-id-49' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='50' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_head' type-id='type-id-49' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='80' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_lock' type-id='type-id-30' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='81' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI8VarTableEC4EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_table' mangled-name='_ZN9TableListI8VarTableE9add_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI8VarTableE9add_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_table' mangled-name='_ZN9TableListI8VarTableE12remove_tableEPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI8VarTableE12remove_tableEPNS1_4NodeE'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TableList' mangled-name='_ZN9TableListI8VarTableEC2EPNS1_4NodeE' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9TableListI8VarTableEC1EPNS1_4NodeE'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-93'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-60'/>
    <qualified-type-def type-id='type-id-63' const='yes' id='type-id-95'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-65'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-54'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-97'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-98'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-26'/>
    <reference-type-def kind='lvalue' type-id='type-id-7' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>



    <var-decl name='__offload_entries' type-id='type-id-22' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='202' column='1'/>
    <var-decl name='__offload_funcs' type-id='type-id-22' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='203' column='1'/>
    <var-decl name='__offload_vars' type-id='type-id-45' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='204' column='1'/>
    <var-decl name='__offload_myo_var_tables' type-id='type-id-88' mangled-name='__offload_myo_var_tables' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='436' column='1' elf-symbol-id='__offload_myo_var_tables'/>
    <var-decl name='__offload_myo_vtable_tables' type-id='type-id-88' mangled-name='__offload_myo_vtable_tables' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='437' column='1' elf-symbol-id='__offload_myo_vtable_tables'/>
    <var-decl name='__offload_myo_func_tables' type-id='type-id-86' mangled-name='__offload_myo_func_tables' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='438' column='1' elf-symbol-id='__offload_myo_func_tables'/>
    <var-decl name='__offload_myo_init_tables' type-id='type-id-84' mangled-name='__offload_myo_init_tables' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='439' column='1' elf-symbol-id='__offload_myo_init_tables'/>
    <function-decl name='__offload_myoRemoveTables' mangled-name='__offload_myoRemoveTables' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__offload_myoRemoveTables'>
      <parameter type-id='type-id-72' name='init_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='526' column='1'/>
      <parameter type-id='type-id-82' name='shared_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='527' column='1'/>
      <parameter type-id='type-id-82' name='shared_vtable' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='528' column='1'/>
      <parameter type-id='type-id-77' name='fptr_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='529' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__offload_myoRegisterTables1' mangled-name='__offload_myoRegisterTables1' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__offload_myoRegisterTables1'>
      <parameter type-id='type-id-72' name='init_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='526' column='1'/>
      <parameter type-id='type-id-82' name='shared_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='527' column='1'/>
      <parameter type-id='type-id-82' name='shared_vtable' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='528' column='1'/>
      <parameter type-id='type-id-77' name='fptr_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='529' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__offload_unregister_tables' mangled-name='__offload_unregister_tables' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__offload_unregister_tables'>
      <parameter type-id='type-id-25' name='entry_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='319' column='1'/>
      <parameter type-id='type-id-25' name='func_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='320' column='1'/>
      <parameter type-id='type-id-49' name='var_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='321' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__offload_register_tables' mangled-name='__offload_register_tables' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__offload_register_tables'>
      <parameter type-id='type-id-25' name='entry_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='319' column='1'/>
      <parameter type-id='type-id-25' name='func_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='320' column='1'/>
      <parameter type-id='type-id-49' name='var_table' filepath='../../../gcc/liboffloadmic/runtime/offload_table.cpp' line='321' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-99'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-5'/>
    </function-type>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-59' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='275' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='funcName' type-id='type-id-26' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='funcAddr' type-id='type-id-12' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='localThunkAddr' type-id='type-id-12' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='281' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-55' visibility='default' filepath='../../../gcc/liboffloadmic/include/myo/myoimpl.h' line='352' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='varName' type-id='type-id-26' visibility='default' filepath='../../../gcc/liboffloadmic/include/myo/myoimpl.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sharedAddr' type-id='type-id-12' visibility='default' filepath='../../../gcc/liboffloadmic/include/myo/myoimpl.h' line='356' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-64' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='289' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-100' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_table.h' line='295' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../../gcc/liboffloadmic/runtime/offload_trace.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>




    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-101'>
      <subrange length='16' type-id='type-id-17' id='type-id-102'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-103'>
      <subrange length='1' type-id='type-id-17' id='type-id-104'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-105'>
      <subrange length='20' type-id='type-id-17' id='type-id-106'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='32' id='type-id-107'>
      <subrange length='4' type-id='type-id-17' id='type-id-108'/>

    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-110'/>
    <type-decl name='float' size-in-bits='32' id='type-id-111'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-112'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-113'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-114'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-115'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-116'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-117'/>
    <typedef-decl name='lldiv_t' type-id='type-id-118' filepath='/usr/include/stdlib.h' line='121' column='1' id='type-id-119'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' filepath='/usr/include/stdlib.h' line='118' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-3' visibility='default' filepath='/usr/include/stdlib.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-3' visibility='default' filepath='/usr/include/stdlib.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wint_t' type-id='type-id-21' filepath='/export/users/iverbin/gcc_build_host/gcc/include/stddef.h' line='357' column='1' id='type-id-120'/>
    <typedef-decl name='__FILE' type-id='type-id-121' filepath='/usr/include/stdio.h' line='64' column='1' id='type-id-122'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='245' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-19' visibility='default' filepath='/usr/include/libio.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-123' visibility='default' filepath='/usr/include/libio.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-124' visibility='default' filepath='/usr/include/libio.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-19' visibility='default' filepath='/usr/include/libio.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-19' visibility='default' filepath='/usr/include/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-125' visibility='default' filepath='/usr/include/libio.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-116' visibility='default' filepath='/usr/include/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-114' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-103' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-126' visibility='default' filepath='/usr/include/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-127' visibility='default' filepath='/usr/include/libio.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-12' visibility='default' filepath='/usr/include/libio.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-12' visibility='default' filepath='/usr/include/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-12' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-12' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-6' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-19' visibility='default' filepath='/usr/include/libio.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-105' visibility='default' filepath='/usr/include/libio.h' line='310' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='160' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-123' visibility='default' filepath='/usr/include/libio.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-124' visibility='default' filepath='/usr/include/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-19' visibility='default' filepath='/usr/include/libio.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-2' filepath='/usr/include/bits/types.h' line='131' column='1' id='type-id-125'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-5' filepath='/usr/include/libio.h' line='154' column='1' id='type-id-129'/>
    <typedef-decl name='__off64_t' type-id='type-id-2' filepath='/usr/include/bits/types.h' line='132' column='1' id='type-id-127'/>
    <typedef-decl name='mbstate_t' type-id='type-id-130' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-131'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-132' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-130'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-130' visibility='default' filepath='/usr/include/wchar.h' line='83' column='1' id='type-id-132'>

        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/wchar.h' line='86' column='1' id='type-id-133'>
            <data-member access='private'>
              <var-decl name='__wch' type-id='type-id-21' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
            </data-member>
            <data-member access='private'>
              <var-decl name='__wchb' type-id='type-id-107' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-19' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-133' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-19' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-2' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-26' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='53' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-1' visibility='default' filepath='/usr/include/locale.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__compar_fn_t' type-id='type-id-136' filepath='/usr/include/stdlib.h' line='742' column='1' id='type-id-137'/>
    <typedef-decl name='div_t' type-id='type-id-138' filepath='/usr/include/stdlib.h' line='101' column='1' id='type-id-139'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-139' visibility='default' filepath='/usr/include/stdlib.h' line='98' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-140' filepath='/usr/include/stdlib.h' line='109' column='1' id='type-id-141'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-141' visibility='default' filepath='/usr/include/stdlib.h' line='106' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-2' visibility='default' filepath='/usr/include/stdlib.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-2' visibility='default' filepath='/usr/include/stdlib.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-121' filepath='/usr/include/stdio.h' line='48' column='1' id='type-id-142'/>
    <typedef-decl name='fpos_t' type-id='type-id-143' filepath='/usr/include/stdio.h' line='110' column='1' id='type-id-144'/>
    <typedef-decl name='_G_fpos_t' type-id='type-id-145' filepath='/usr/include/_G_config.h' line='25' column='1' id='type-id-143'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-143' visibility='default' filepath='/usr/include/_G_config.h' line='22' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-125' visibility='default' filepath='/usr/include/_G_config.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-130' visibility='default' filepath='/usr/include/_G_config.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wctype_t' type-id='type-id-4' filepath='/usr/include/wctype.h' line='52' column='1' id='type-id-146'/>
    <typedef-decl name='wctrans_t' type-id='type-id-147' filepath='/usr/include/wctype.h' line='186' column='1' id='type-id-148'/>
    <typedef-decl name='__int32_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-149'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-151'/>
    <reference-type-def kind='lvalue' type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <reference-type-def kind='lvalue' type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-156'/>
    <reference-type-def kind='lvalue' type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <reference-type-def kind='lvalue' type-id='type-id-1' size-in-bits='64' id='type-id-162'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-163'/>
    <reference-type-def kind='lvalue' type-id='type-id-163' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-165'/>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-166'/>
    <reference-type-def kind='lvalue' type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-168'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-170'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <qualified-type-def type-id='type-id-160' const='yes' id='type-id-172'/>
    <reference-type-def kind='lvalue' type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-174'/>
    <qualified-type-def type-id='type-id-149' const='yes' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-147'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-176'/>
    <reference-type-def kind='lvalue' type-id='type-id-98' size-in-bits='64' id='type-id-177'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-178'/>
    <reference-type-def kind='lvalue' type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-180'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-183'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-184'/>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-185'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-187'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-189'/>
    <reference-type-def kind='lvalue' type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-192'/>
    <reference-type-def kind='lvalue' type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-194'/>
    <qualified-type-def type-id='type-id-195' const='yes' id='type-id-196'/>
    <reference-type-def kind='lvalue' type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-199'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-201'/>
    <reference-type-def kind='lvalue' type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <qualified-type-def type-id='type-id-203' const='yes' id='type-id-204'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-205'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-207'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-210'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <qualified-type-def type-id='type-id-212' const='yes' id='type-id-213'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-215'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-217'/>
    <qualified-type-def type-id='type-id-218' const='yes' id='type-id-219'/>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-220'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-221'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-222'/>
    <qualified-type-def type-id='type-id-117' const='yes' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-229'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-230'/>
    <reference-type-def kind='lvalue' type-id='type-id-191' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-234'/>
    <reference-type-def kind='lvalue' type-id='type-id-195' size-in-bits='64' id='type-id-235'/>
    <reference-type-def kind='lvalue' type-id='type-id-198' size-in-bits='64' id='type-id-236'/>
    <reference-type-def kind='lvalue' type-id='type-id-200' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-239'/>
    <reference-type-def kind='lvalue' type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-243'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-245'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <namespace-decl name='std'>
      <namespace-decl name='__cxx11'>
        <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='256' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='72' column='1' id='type-id-191'>

            <member-type access='private'>
              <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='107' column='1' id='type-id-233'>
                <base-class access='public' layout-offset-in-bits='0' type-id='type-id-200'/>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='_M_p' type-id='type-id-248' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='112' column='1'/>
                </data-member>
                <member-function access='public' constructor='yes'>
                  <function-decl name='_Alloc_hider' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12_Alloc_hiderC4EPcRKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
                    <parameter type-id='type-id-234' is-artificial='yes'/>
                    <parameter type-id='type-id-248'/>
                    <parameter type-id='type-id-202'/>
                    <return type-id='type-id-5'/>
                  </function-decl>
                </member-function>
                <member-function access='public' constructor='yes'>
                  <function-decl name='_Alloc_hider' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12_Alloc_hiderC2EPcRKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
                    <parameter type-id='type-id-234' is-artificial='yes'/>
                    <parameter type-id='type-id-248'/>
                    <parameter type-id='type-id-202'/>
                    <return type-id='type-id-5'/>
                  </function-decl>
                </member-function>
                <member-function access='public' constructor='yes'>
                  <function-decl name='_Alloc_hider' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12_Alloc_hiderC2EPcRKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
                    <parameter type-id='type-id-234' is-artificial='yes'/>
                    <parameter type-id='type-id-248'/>
                    <parameter type-id='type-id-202'/>
                    <return type-id='type-id-5'/>
                  </function-decl>
                </member-function>
              </class-decl>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='pointer' type-id='type-id-249' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='87' column='1' id='type-id-248'/>
            </member-type>

            <member-type access='private'>
              <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='121' column='1' id='type-id-250'>
                <data-member access='private'>
                  <var-decl name='_M_local_buf' type-id='type-id-101' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='122' column='1'/>
                </data-member>
                <data-member access='private'>
                  <var-decl name='_M_allocated_capacity' type-id='type-id-198' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='123' column='1'/>
                </data-member>
              </union-decl>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='size_type' type-id='type-id-251' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='83' column='1' id='type-id-198'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='_Char_alloc_type' type-id='type-id-253' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='75' column='1' id='type-id-252'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='allocator_type' type-id='type-id-252' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='82' column='1' id='type-id-195'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='reference' type-id='type-id-255' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='85' column='1' id='type-id-254'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='const_reference' type-id='type-id-257' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='86' column='1' id='type-id-256'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='const_pointer' type-id='type-id-259' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='88' column='1' id='type-id-258'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='iterator' type-id='type-id-157' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='89' column='1' id='type-id-260'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='const_iterator' type-id='type-id-154' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='91' column='1' id='type-id-261'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='const_reverse_iterator' type-id='type-id-263' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='92' column='1' id='type-id-262'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='reverse_iterator' type-id='type-id-265' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='93' column='1' id='type-id-264'/>
            </member-type>

            <member-type access='private'>
              <typedef-decl name='__const_iterator' type-id='type-id-261' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='103' column='1' id='type-id-266'/>
            </member-type>
          <data-member access='private' static='yes'>
            <var-decl name='npos' type-id='type-id-199' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='96' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='_M_dataplus' type-id='type-id-233' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='115' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='_M_string_length' type-id='type-id-198' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='116' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='' type-id='type-id-250' visibility='default'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='_M_data' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7_M_dataEPc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_length' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_lengthEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_data' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7_M_dataEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-248'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_local_data' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_M_local_dataEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-248'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_local_data' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_M_local_dataEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-258'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_capacity' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE11_M_capacityEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_set_length' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_M_set_lengthEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_is_local' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE11_M_is_localEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-15'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_create' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_createERmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-236'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-248'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_dispose' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE10_M_disposeEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_destroy' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE10_M_destroyEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_construct_aux_2' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE18_M_construct_aux_2Emc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_construct' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12_M_constructEmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_get_allocator' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16_M_get_allocatorEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-235'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_get_allocator' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16_M_get_allocatorEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-197'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_check' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8_M_checkEmPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_check_length' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE15_M_check_lengthEmmPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_limit' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8_M_limitEmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_disjunct' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE11_M_disjunctEPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-15'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='_S_copy' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7_S_copyEPcPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='_S_move' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7_S_moveEPcPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='_S_assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_S_assignEPcmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='_S_copy_chars' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_S_copy_charsEPcN9__gnu_cxx17__normal_iteratorIS5_S4_EES8_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-260'/>
              <parameter type-id='type-id-260'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='_S_copy_chars' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_S_copy_charsEPcN9__gnu_cxx17__normal_iteratorIPKcS4_EESA_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='337' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-261'/>
              <parameter type-id='type-id-261'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='_S_copy_chars' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_S_copy_charsEPcS5_S5_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-9'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='_S_copy_chars' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13_S_copy_charsEPcPKcS7_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='_S_compare' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE10_S_compareEmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_assignERKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_mutate' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_mutateEmmPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_erase' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8_M_eraseEmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='392' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-202'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_mm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_mmRKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='428' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-202'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4EPKcmRKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-202'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4EPKcRKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='456' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-202'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4EmcRKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='466' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-202'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4EOS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='478' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-231'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ESt16initializer_listIcERKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='505' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-203'/>
              <parameter type-id='type-id-202'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4ERKS4_RKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='509' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-202'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC4EOS4_RKS3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-231'/>
              <parameter type-id='type-id-202'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='544' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-19' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSERKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='552' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSEPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSEc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='571' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSEOS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='589' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-231'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEaSESt16initializer_listIcE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='600' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-203'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='begin' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5beginEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='613' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-260'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='begin' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5beginEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='end' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE3endEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='629' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-260'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='end' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE3endEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='637' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='rbegin' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6rbeginEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='646' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-264'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='rbegin' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6rbeginEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='655' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-262'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='rend' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4rendEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='664' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-264'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='rend' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4rendEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='673' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-262'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='cbegin' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6cbeginEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='cend' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4cendEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='690' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='crbegin' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7crbeginEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='699' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-262'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='crend' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5crendEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='708' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-262'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='size' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4sizeEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='717' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='length' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6lengthEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='723' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='max_size' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8max_sizeEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='resize' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6resizeEmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='742' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='resize' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6resizeEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='shrink_to_fit' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13shrink_to_fitEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='capacity' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8capacityEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='reserve' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7reserveEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='802' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='clear' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5clearEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='808' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='empty' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5emptyEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='816' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-15'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='operator[]' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEixEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='831' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-256'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator[]' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEixEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='848' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-254'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='at' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE2atEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='869' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-256'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='at' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE2atEm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='890' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-254'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='front' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5frontEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='906' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-254'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='front' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5frontEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='917' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-256'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='back' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4backEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='928' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-254'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='back' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4backEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='939' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-256'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator+=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEpLERKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='953' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator+=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEpLEPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='962' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator+=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEpLEc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='971' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='operator+=' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEpLESt16initializer_listIcE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='984' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-203'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='append' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendERKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='994' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='append' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendERKS4_mm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1011' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='append' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1023' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='append' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendEPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1036' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='append' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendEmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1053' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='append' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6appendESt16initializer_listIcE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1063' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-203'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='push_back' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9push_backEc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1090' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignERKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1105' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignEOS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1121' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-231'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignERKS4_mm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1143' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1159' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignEPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1175' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignEmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1192' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='assign' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6assignESt16initializer_listIcE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1220' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-203'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='insert' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEN9__gnu_cxx17__normal_iteratorIPKcS4_EEmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1241' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-261'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-260'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='insert' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEN9__gnu_cxx17__normal_iteratorIPcS4_EESt16initializer_listIcE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1319' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-260'/>
              <parameter type-id='type-id-203'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='insert' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmRKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1339' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='insert' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmRKS4_mm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1362' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='insert' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1385' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='insert' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1404' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='insert' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEmmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1428' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='insert' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6insertEN9__gnu_cxx17__normal_iteratorIPKcS4_EEc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1446' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-260'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='erase' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5eraseEmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1470' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='erase' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5eraseEN9__gnu_cxx17__normal_iteratorIPKcS4_EE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1486' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <return type-id='type-id-260'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='erase' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5eraseEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1505' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <return type-id='type-id-260'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='pop_back' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE8pop_backEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1521' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmRKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1546' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmRKS4_mm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1568' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1593' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1618' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEmmmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1642' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_RKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1660' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_S8_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1680' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_S8_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1702' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_mc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1723' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_PcSA_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1780' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-9'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_S8_S8_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1791' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_NS6_IPcS4_EESB_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1802' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-260'/>
              <parameter type-id='type-id-260'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_S9_S9_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1813' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-266'/>
              <parameter type-id='type-id-261'/>
              <parameter type-id='type-id-261'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7replaceEN9__gnu_cxx17__normal_iteratorIPKcS4_EES9_St16initializer_listIcE' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1838' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-261'/>
              <parameter type-id='type-id-261'/>
              <parameter type-id='type-id-203'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_replace_aux' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE14_M_replace_auxEmmmc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1857' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_replace' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE10_M_replaceEmmPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1861' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_append' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE9_M_appendEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1865' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-231'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='copy' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4copyEPcmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1882' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-9'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='swap' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4swapERS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1892' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-231'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='c_str' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5c_strEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1902' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-26'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='data' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4dataEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1912' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-26'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='get_allocator' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13get_allocatorEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1919' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <return type-id='type-id-195'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4findEPKcmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1935' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4findERKS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1948' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4findEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1963' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE4findEcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1980' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='rfind' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5rfindERKS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='1993' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='rfind' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5rfindEPKcmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2010' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='rfind' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5rfindEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2023' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='rfind' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE5rfindEcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2040' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_first_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13find_first_ofERKS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2054' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_first_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13find_first_ofEPKcmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2071' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_first_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13find_first_ofEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2084' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_first_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE13find_first_ofEcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2103' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_last_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12find_last_ofERKS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2118' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_last_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12find_last_ofEPKcmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2135' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_last_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12find_last_ofEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2148' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_last_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE12find_last_ofEcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2167' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_first_not_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17find_first_not_ofERKS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2181' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_first_not_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17find_first_not_ofEPKcmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2198' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_first_not_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17find_first_not_ofEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2212' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_first_not_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE17find_first_not_ofEcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2229' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_last_not_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16find_last_not_ofERKS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2244' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_last_not_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16find_last_not_ofEPKcmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2261' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_last_not_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16find_last_not_ofEPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2275' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='find_last_not_of' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE16find_last_not_ofEcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2292' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-198'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='substr' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE6substrEmm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2308' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-191'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='compare' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareERKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2327' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='compare' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEmmRKS4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2359' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-193'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='compare' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEmmRKS4_mm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2385' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-193'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='compare' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2403' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='compare' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEmmPKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2427' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='compare' mangled-name='_ZNKSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEE7compareEmmPKcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='2454' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-194' is-artificial='yes'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-198'/>
              <parameter type-id='type-id-26'/>
              <parameter type-id='type-id-198'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='544' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-19' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~basic_string' mangled-name='_ZNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/basic_string.h' line='544' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-232' is-artificial='yes'/>
              <parameter type-id='type-id-19' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>



      <class-decl name='ios_base' visibility='default' is-declaration-only='yes' id='type-id-240'>

          <member-type access='private'>
            <typedef-decl name='seekdir' type-id='type-id-267' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='455' column='1' id='type-id-218'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='openmode' type-id='type-id-268' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='423' column='1' id='type-id-216'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='iostate' type-id='type-id-269' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='392' column='1' id='type-id-214'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='fmtflags' type-id='type-id-188' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='317' column='1' id='type-id-212'/>
          </member-type>

          <member-type access='private'>
            <class-decl name='Init' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='595' column='1' id='type-id-270'>
              <data-member access='private' static='yes'>
                <var-decl name='_S_refcount' type-id='type-id-271' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='603' column='1'/>
              </data-member>
              <data-member access='private' static='yes'>
                <var-decl name='_S_synced_with_stdio' type-id='type-id-15' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='604' column='1'/>
              </data-member>
              <member-function access='private' constructor='yes'>
                <function-decl name='Init' mangled-name='_ZNSt8ios_base4InitC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='599' column='1' visibility='default' binding='global' size-in-bits='64'>
                  <parameter type-id='type-id-272' is-artificial='yes'/>
                  <return type-id='type-id-5'/>
                </function-decl>
              </member-function>
              <member-function access='private' destructor='yes'>
                <function-decl name='~Init' mangled-name='_ZNSt8ios_base4InitD4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='600' column='1' visibility='default' binding='global' size-in-bits='64'>
                  <parameter type-id='type-id-272' is-artificial='yes'/>
                  <parameter type-id='type-id-19' is-artificial='yes'/>
                  <return type-id='type-id-5'/>
                </function-decl>
              </member-function>
            </class-decl>
          </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='end' type-id='type-id-219' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='464' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='cur' type-id='type-id-219' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='461' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='beg' type-id='type-id-219' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='458' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='trunc' type-id='type-id-217' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='443' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='out' type-id='type-id-217' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='440' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='in' type-id='type-id-217' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='437' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='binary' type-id='type-id-217' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='434' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='ate' type-id='type-id-217' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='429' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='app' type-id='type-id-217' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='426' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='goodbit' type-id='type-id-215' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='407' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='failbit' type-id='type-id-215' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='404' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='eofbit' type-id='type-id-215' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='399' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='badbit' type-id='type-id-215' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='396' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='floatfield' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='378' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='basefield' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='375' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='adjustfield' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='372' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='uppercase' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='369' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='unitbuf' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='365' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='skipws' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='362' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='showpos' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='359' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='showpoint' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='356' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='showbase' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='352' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='scientific' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='348' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='right' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='345' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='oct' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='341' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='left' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='338' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='internal' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='334' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='hex' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='329' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='fixed' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='326' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='dec' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='323' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='boolalpha' type-id='type-id-213' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='320' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='setf' mangled-name='_ZNSt8ios_base4setfESt13_Ios_FmtflagsS0_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8ios_base4setfESt13_Ios_FmtflagsS0_'>
            <parameter type-id='type-id-242' is-artificial='yes'/>
            <parameter type-id='type-id-212'/>
            <parameter type-id='type-id-212'/>
            <return type-id='type-id-212'/>
          </function-decl>
        </member-function>
      </class-decl>
      <enum-decl name='_Ios_Seekdir' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='187' column='1' id='type-id-267'>
        <underlying-type type-id='type-id-115'/>
        <enumerator name='_S_beg' value='0'/>
        <enumerator name='_S_cur' value='1'/>
        <enumerator name='_S_end' value='2'/>
        <enumerator name='_S_ios_seekdir_end' value='65536'/>
      </enum-decl>
      <enum-decl name='_Ios_Openmode' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='109' column='1' id='type-id-268'>
        <underlying-type type-id='type-id-115'/>
        <enumerator name='_S_app' value='1'/>
        <enumerator name='_S_ate' value='2'/>
        <enumerator name='_S_bin' value='4'/>
        <enumerator name='_S_in' value='8'/>
        <enumerator name='_S_out' value='16'/>
        <enumerator name='_S_trunc' value='32'/>
        <enumerator name='_S_ios_openmode_end' value='65536'/>
      </enum-decl>
      <enum-decl name='_Ios_Iostate' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='149' column='1' id='type-id-269'>
        <underlying-type type-id='type-id-115'/>
        <enumerator name='_S_goodbit' value='0'/>
        <enumerator name='_S_badbit' value='1'/>
        <enumerator name='_S_eofbit' value='2'/>
        <enumerator name='_S_failbit' value='4'/>
        <enumerator name='_S_ios_iostate_end' value='65536'/>
      </enum-decl>
      <enum-decl name='_Ios_Fmtflags' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='57' column='1' id='type-id-188'>
        <underlying-type type-id='type-id-115'/>
        <enumerator name='_S_boolalpha' value='1'/>
        <enumerator name='_S_dec' value='2'/>
        <enumerator name='_S_fixed' value='4'/>
        <enumerator name='_S_hex' value='8'/>
        <enumerator name='_S_internal' value='16'/>
        <enumerator name='_S_left' value='32'/>
        <enumerator name='_S_oct' value='64'/>
        <enumerator name='_S_right' value='128'/>
        <enumerator name='_S_scientific' value='256'/>
        <enumerator name='_S_showbase' value='512'/>
        <enumerator name='_S_showpoint' value='1024'/>
        <enumerator name='_S_showpos' value='2048'/>
        <enumerator name='_S_skipws' value='4096'/>
        <enumerator name='_S_unitbuf' value='8192'/>
        <enumerator name='_S_uppercase' value='16384'/>
        <enumerator name='_S_adjustfield' value='176'/>
        <enumerator name='_S_basefield' value='74'/>
        <enumerator name='_S_floatfield' value='260'/>
        <enumerator name='_S_ios_fmtflags_end' value='65536'/>
      </enum-decl>
      <function-decl name='hex' mangled-name='_ZSt3hexRSt8ios_base' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='1018' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt3hexRSt8ios_base'>
        <parameter type-id='type-id-241'/>
        <return type-id='type-id-241'/>
      </function-decl>
      <function-decl name='dec' mangled-name='_ZSt3decRSt8ios_base' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='1010' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZSt3decRSt8ios_base'>
        <parameter type-id='type-id-241'/>
        <return type-id='type-id-241'/>
      </function-decl>
      <function-decl name='operator|' mangled-name='_ZStorSt13_Ios_OpenmodeS_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZStorSt13_Ios_OpenmodeS_'>
        <parameter type-id='type-id-268'/>
        <parameter type-id='type-id-268'/>
        <return type-id='type-id-268'/>
      </function-decl>
      <function-decl name='operator&amp;=' mangled-name='_ZStaNRSt13_Ios_FmtflagsS_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZStaNRSt13_Ios_FmtflagsS_'>
        <parameter type-id='type-id-230'/>
        <parameter type-id='type-id-188'/>
        <return type-id='type-id-190'/>
      </function-decl>
      <function-decl name='operator|=' mangled-name='_ZStoRRSt13_Ios_FmtflagsS_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZStoRRSt13_Ios_FmtflagsS_'>
        <parameter type-id='type-id-230'/>
        <parameter type-id='type-id-188'/>
        <return type-id='type-id-190'/>
      </function-decl>
      <function-decl name='operator~' mangled-name='_ZStcoSt13_Ios_Fmtflags' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZStcoSt13_Ios_Fmtflags'>
        <parameter type-id='type-id-188'/>
        <return type-id='type-id-188'/>
      </function-decl>
      <function-decl name='operator|' mangled-name='_ZStorSt13_Ios_FmtflagsS_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZStorSt13_Ios_FmtflagsS_'>
        <parameter type-id='type-id-188'/>
        <parameter type-id='type-id-188'/>
        <return type-id='type-id-188'/>
      </function-decl>
      <function-decl name='operator&amp;' mangled-name='_ZStanSt13_Ios_FmtflagsS_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/ios_base.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZStanSt13_Ios_FmtflagsS_'>
        <parameter type-id='type-id-188'/>
        <parameter type-id='type-id-188'/>
        <return type-id='type-id-188'/>
      </function-decl>
      <class-decl name='integral_constant&lt;bool, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='69' column='1' id='type-id-209'>

          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-15' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='72' column='1' id='type-id-273'/>
          </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-176' mangled-name='_ZNSt17integral_constantIbLb1EE5valueE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='71' column='1'/>
        </data-member>
        <member-function access='public' const='yes'>
          <function-decl name='operator std::integral_constant&lt;bool, true&gt;::value_type' mangled-name='_ZNKSt17integral_constantIbLb1EEcvbEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-211' is-artificial='yes'/>
            <return type-id='type-id-273'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='integral_constant&lt;bool, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='69' column='1' id='type-id-206'>

          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-15' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='72' column='1' id='type-id-274'/>
          </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-176' mangled-name='_ZNSt17integral_constantIbLb0EE5valueE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='71' column='1'/>
        </data-member>
        <member-function access='public' const='yes'>
          <function-decl name='operator std::integral_constant&lt;bool, false&gt;::value_type' mangled-name='_ZNKSt17integral_constantIbLb0EEcvbEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-208' is-artificial='yes'/>
            <return type-id='type-id-274'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='size_t' type-id='type-id-4' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/x86_64-pc-linux-gnu/bits/c++config.h' line='196' column='1' id='type-id-275'/>
      <class-decl name='allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-200'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-160'/>

          <member-type access='private'>
            <class-decl name='rebind&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-276'>

                <member-type access='public'>
                  <typedef-decl name='other' type-id='type-id-200' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-277'/>
                </member-type>
            </class-decl>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='size_type' type-id='type-id-275' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-278'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-9' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-279'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='type-id-26' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='100' column='1' id='type-id-280'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-1' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-281'/>
          </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaIcEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-238' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaIcEC4ERKS_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-238' is-artificial='yes'/>
            <parameter type-id='type-id-202'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIcED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-238' is-artificial='yes'/>
            <parameter type-id='type-id-19' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIcED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-238' is-artificial='yes'/>
            <parameter type-id='type-id-19' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaIcEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-238' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIcED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-238' is-artificial='yes'/>
            <parameter type-id='type-id-19' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaIcEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-238' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-282'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-283'/>

          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-281' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-284'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-286' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-285'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='const_pointer' type-id='type-id-286' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='103' column='1' id='type-id-287'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='const_void_pointer' type-id='type-id-286' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-288'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='size_type' type-id='type-id-286' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-289'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='rebind_alloc' type-id='type-id-291' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-290'/>
          </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaIcEE8allocateERS0_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-237'/>
            <parameter type-id='type-id-289'/>
            <return type-id='type-id-285'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaIcEE8allocateERS0_mPKv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-237'/>
            <parameter type-id='type-id-289'/>
            <parameter type-id='type-id-288'/>
            <return type-id='type-id-285'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaIcEE10deallocateERS0_Pcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-237'/>
            <parameter type-id='type-id-285'/>
            <parameter type-id='type-id-289'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='max_size' mangled-name='_ZNSt16allocator_traitsISaIcEE8max_sizeERKS0_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-202'/>
            <return type-id='type-id-289'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='select_on_container_copy_construction' mangled-name='_ZNSt16allocator_traitsISaIcEE37select_on_container_copy_constructionERKS0_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='356' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-202'/>
            <return type-id='type-id-200'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__allocator_traits_base' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='43' column='1' id='type-id-283'>

          <member-type access='protected'>
            <typedef-decl name='__pointer' type-id='type-id-279' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='50' column='1' id='type-id-292'/>
          </member-type>

          <member-type access='protected'>
            <typedef-decl name='__c_pointer' type-id='type-id-280' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='52' column='1' id='type-id-293'/>
          </member-type>

          <member-type access='protected'>
            <typedef-decl name='__size_type' type-id='type-id-278' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='60' column='1' id='type-id-294'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='__rebind' type-id='type-id-277' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='46' column='1' id='type-id-295'/>
          </member-type>
      </class-decl>
      <class-decl name='__detector&lt;char*, void, std::__allocator_traits_base::__pointer, std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2432' column='1' id='type-id-296'>

          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-292' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2435' column='1' id='type-id-297'/>
          </member-type>
      </class-decl>
      <typedef-decl name='__detected_or_t' type-id='type-id-297' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2447' column='1' id='type-id-286'/>
      <class-decl name='__detector&lt;char const*, void, std::__allocator_traits_base::__c_pointer, std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2432' column='1' id='type-id-298'>

          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-293' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2435' column='1' id='type-id-299'/>
          </member-type>
      </class-decl>
      <class-decl name='__detector&lt;void const*, void, std::__allocator_traits_base::__cv_pointer, std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2423' column='1' id='type-id-300'>

          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-12' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2426' column='1' id='type-id-301'/>
          </member-type>
      </class-decl>
      <class-decl name='__detector&lt;long unsigned int, void, std::__allocator_traits_base::__size_type, std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2432' column='1' id='type-id-302'>

          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-294' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2435' column='1' id='type-id-303'/>
          </member-type>
      </class-decl>
      <class-decl name='__detector&lt;std::allocator&lt;char&gt;, void, std::__allocator_traits_base::__rebind, std::allocator&lt;char&gt;, char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2432' column='1' id='type-id-304'>

          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-295' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2435' column='1' id='type-id-305'/>
          </member-type>
      </class-decl>
      <typedef-decl name='__detected_or_t_' type-id='type-id-286' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/type_traits' line='2453' column='1' id='type-id-306'/>
      <typedef-decl name='__alloc_rebind' type-id='type-id-306' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='74' column='1' id='type-id-291'/>
      <class-decl name='iterator_traits&lt;char*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator_base_types.h' line='178' column='1' id='type-id-307'>

          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-309' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator_base_types.h' line='182' column='1' id='type-id-308'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-9' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator_base_types.h' line='183' column='1' id='type-id-310'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-162' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator_base_types.h' line='184' column='1' id='type-id-311'/>
          </member-type>
      </class-decl>
      <typedef-decl name='ptrdiff_t' type-id='type-id-2' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/x86_64-pc-linux-gnu/bits/c++config.h' line='197' column='1' id='type-id-309'/>
      <class-decl name='iterator_traits&lt;char const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator_base_types.h' line='189' column='1' id='type-id-312'>

          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-309' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator_base_types.h' line='193' column='1' id='type-id-313'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-26' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator_base_types.h' line='194' column='1' id='type-id-314'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-177' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator_base_types.h' line='195' column='1' id='type-id-315'/>
          </member-type>
      </class-decl>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-263'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-265'/>
      <class-decl name='initializer_list&lt;char&gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='type-id-203'>

          <member-type access='private'>
            <typedef-decl name='iterator' type-id='type-id-26' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='type-id-316'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='size_type' type-id='type-id-275' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='type-id-317'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='type-id-26' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='type-id-318'/>
          </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-316' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-317' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='initializer_list' mangled-name='_ZNSt16initializer_listIcEC4EPKcm' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-239' is-artificial='yes'/>
            <parameter type-id='type-id-318'/>
            <parameter type-id='type-id-317'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='initializer_list' mangled-name='_ZNSt16initializer_listIcEC4Ev' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-239' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='size' mangled-name='_ZNKSt16initializer_listIcE4sizeEv' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-205' is-artificial='yes'/>
            <return type-id='type-id-317'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='begin' mangled-name='_ZNKSt16initializer_listIcE5beginEv' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-205' is-artificial='yes'/>
            <return type-id='type-id-318'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='end' mangled-name='_ZNKSt16initializer_listIcE3endEv' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-205' is-artificial='yes'/>
            <return type-id='type-id-318'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__gnu_cxx'>


      <function-decl name='div' mangled-name='_ZN9__gnu_cxx3divExx' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/cstdlib' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-3'/>
        <parameter type-id='type-id-3'/>
        <return type-id='type-id-119'/>
      </function-decl>
      <class-decl name='__numeric_traits_integer&lt;long int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='55' column='1' id='type-id-319'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-184' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIlE5__minE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-184' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIlE5__maxE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-176' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;short int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='55' column='1' id='type-id-320'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-187' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIsE5__minE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-187' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIsE5__maxE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-176' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='55' column='1' id='type-id-321'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-98' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-98' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIcE5__maxE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-176' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='55' column='1' id='type-id-322'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-222' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-222' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-176' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-183' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerImE8__digitsE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_floating&lt;long double&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='100' column='1' id='type-id-323'>
        <data-member access='public' static='yes'>
          <var-decl name='__max_digits10' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-176' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits10' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max_exponent10' type-id='type-id-183' mangled-name='_ZN9__gnu_cxx25__numeric_traits_floatingIeE16__max_exponent10E' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='108' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_floating&lt;double&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='100' column='1' id='type-id-324'>
        <data-member access='public' static='yes'>
          <var-decl name='__max_digits10' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-176' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits10' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max_exponent10' type-id='type-id-183' mangled-name='_ZN9__gnu_cxx25__numeric_traits_floatingIdE16__max_exponent10E' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='108' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_floating&lt;float&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='100' column='1' id='type-id-325'>
        <data-member access='public' static='yes'>
          <var-decl name='__max_digits10' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-176' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits10' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max_exponent10' type-id='type-id-183' mangled-name='_ZN9__gnu_cxx25__numeric_traits_floatingIfE16__max_exponent10E' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='108' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='55' column='1' id='type-id-326'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-183' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIiE5__minE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-183' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIiE5__maxE' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-176' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-183' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='new_allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='58' column='1' id='type-id-160'>

          <member-type access='private'>
            <typedef-decl name='size_type' type-id='type-id-275' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='61' column='1' id='type-id-327'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-9' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='63' column='1' id='type-id-328'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='type-id-26' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='64' column='1' id='type-id-329'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-162' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='65' column='1' id='type-id-330'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='type-id-177' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='66' column='1' id='type-id-331'/>
          </member-type>
        <member-function access='private'>
          <function-decl name='new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcEC4ERKS1_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <parameter type-id='type-id-173'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <parameter type-id='type-id-19' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='address' mangled-name='_ZNK9__gnu_cxx13new_allocatorIcE7addressERc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-174' is-artificial='yes'/>
            <parameter type-id='type-id-330'/>
            <return type-id='type-id-328'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='address' mangled-name='_ZNK9__gnu_cxx13new_allocatorIcE7addressERKc' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-174' is-artificial='yes'/>
            <parameter type-id='type-id-331'/>
            <return type-id='type-id-329'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocate' mangled-name='_ZN9__gnu_cxx13new_allocatorIcE8allocateEmPKv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <parameter type-id='type-id-327'/>
            <parameter type-id='type-id-12'/>
            <return type-id='type-id-328'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='deallocate' mangled-name='_ZN9__gnu_cxx13new_allocatorIcE10deallocateEPcm' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <parameter type-id='type-id-328'/>
            <parameter type-id='type-id-327'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='max_size' mangled-name='_ZNK9__gnu_cxx13new_allocatorIcE8max_sizeEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-174' is-artificial='yes'/>
            <return type-id='type-id-327'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <parameter type-id='type-id-19' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <parameter type-id='type-id-19' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/new_allocator.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-161' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__alloc_traits&lt;std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='50' column='1' id='type-id-332'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-282'/>

          <member-type access='public'>
            <class-decl name='rebind&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='122' column='1' id='type-id-333'>

                <member-type access='public'>
                  <typedef-decl name='other' type-id='type-id-290' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='123' column='1' id='type-id-253'/>
                </member-type>
            </class-decl>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-284' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='58' column='1' id='type-id-152'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-285' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='59' column='1' id='type-id-249'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='const_pointer' type-id='type-id-287' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='60' column='1' id='type-id-259'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='size_type' type-id='type-id-289' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='61' column='1' id='type-id-251'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-153' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='64' column='1' id='type-id-255'/>
          </member-type>

          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='type-id-167' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='65' column='1' id='type-id-257'/>
          </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='_S_select_on_copy' mangled-name='_ZN9__gnu_cxx14__alloc_traitsISaIcEE17_S_select_on_copyERKS1_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-202'/>
            <return type-id='type-id-200'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='_S_on_swap' mangled-name='_ZN9__gnu_cxx14__alloc_traitsISaIcEE10_S_on_swapERS1_S3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-237'/>
            <parameter type-id='type-id-237'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='_S_propagate_on_copy_assign' mangled-name='_ZN9__gnu_cxx14__alloc_traitsISaIcEE27_S_propagate_on_copy_assignEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='_S_propagate_on_move_assign' mangled-name='_ZN9__gnu_cxx14__alloc_traitsISaIcEE27_S_propagate_on_move_assignEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='_S_propagate_on_swap' mangled-name='_ZN9__gnu_cxx14__alloc_traitsISaIcEE20_S_propagate_on_swapEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='_S_always_equal' mangled-name='_ZN9__gnu_cxx14__alloc_traitsISaIcEE15_S_always_equalEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='_S_nothrow_move' mangled-name='_ZN9__gnu_cxx14__alloc_traitsISaIcEE15_S_nothrow_moveEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='_S_nothrow_swap' mangled-name='_ZN9__gnu_cxx14__alloc_traitsISaIcEE15_S_nothrow_swapEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/ext/alloc_traits.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__normal_iterator&lt;char*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='748' column='1' id='type-id-157'>

          <member-type access='private'>
            <typedef-decl name='difference_type' type-id='type-id-308' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='759' column='1' id='type-id-334'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-311' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='760' column='1' id='type-id-335'/>
          </member-type>

          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-310' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='761' column='1' id='type-id-336'/>
          </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-9' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='751' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='__normal_iterator' mangled-name='_ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-159' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='__normal_iterator' mangled-name='_ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEC4ERKS1_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='767' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-159' is-artificial='yes'/>
            <parameter type-id='type-id-164'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='operator*' mangled-name='_ZNK9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEdeEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='780' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-171' is-artificial='yes'/>
            <return type-id='type-id-335'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='operator-&gt;' mangled-name='_ZNK9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEptEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='784' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-171' is-artificial='yes'/>
            <return type-id='type-id-336'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='operator++' mangled-name='_ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEppEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='788' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-159' is-artificial='yes'/>
            <return type-id='type-id-158'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='operator++' mangled-name='_ZN9__gnu_cxx17__normal_iteratorIPcNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEEppEi' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_iterator.h' line='795' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-159' is-artificial='yes'/>
            <parameter type-id='type-id-19'/>
            <return type-id='type-id-157'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
