<abi-corpus path='data/test-read-dwarf/test17-pr19027.so' soname='libharfbuzz.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libfreetype.so.6'/>
    <dependency name='libpng16.so.16'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libbz2.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_blob_create' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_blob_create_sub_blob' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_blob_destroy' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_data_writable' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_empty' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_length' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_user_data' type='func-type' binding='global-binding' is-defined='yes'/>

    <elf-symbol name='hb_set_is_equal' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_set_next' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_set_next_range' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_set_reference' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_set_set' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_set_set_user_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_set_subtract' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_set_symmetric_difference' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_set_union' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_full' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_list_shapers' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_create' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_create_cached' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_destroy' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_execute' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_get_empty' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_get_shaper' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_get_user_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_reference' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_shape_plan_set_user_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_tag_from_string' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_tag_to_string' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_combining_class' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_compose' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_decompose' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_decompose_compatibility' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_eastasian_width' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_create' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_destroy' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_default' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_empty' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_parent' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_user_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_is_immutable' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_make_immutable' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_reference' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_combining_class_func' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_compose_func' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_decompose_compatibility_func' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_decompose_func' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_eastasian_width_func' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_general_category_func' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_mirroring_func' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_script_func' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_user_data' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_general_category' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_mirroring' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_unicode_script' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_version' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_version_atleast' type='func-type' binding='global-binding' is-defined='yes'/>
    <elf-symbol name='hb_version_string' type='func-type' binding='global-binding' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='hb-blob.cc' language='LANG_C_plus_plus'>
    <class-decl name='hb_reference_count_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='53' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='54' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN20hb_reference_count_t4initEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <parameter type-id='type-id-4'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='inc' mangled-name='_ZN20hb_reference_count_t3incEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <return type-id='type-id-4'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='dec' mangled-name='_ZN20hb_reference_count_t3decEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <return type-id='type-id-4'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN20hb_reference_count_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='is_invalid' mangled-name='_ZNK20hb_reference_count_t10is_invalidEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-4'/>
    <typedef-decl name='hb_atomic_int_t' type-id='type-id-4' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-atomic-private.hh' line='94' column='1' id='type-id-2'/>
    <type-decl name='void' id='type-id-5'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-3'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-7'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-8'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-6'/>
    <class-decl name='hb_prealloced_array_t&lt;hb_user_data_array_t::hb_user_data_item_t, 2u&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='329' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='allocated' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='array' type-id='type-id-11' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='static_array' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='333' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='335' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator[]' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EEixEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='337' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator[]' mangled-name='_ZNK21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EEixEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-15' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='push' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE4pushEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='pop' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE3popEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE6removeEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='377' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='shrink' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE6shrinkEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='387' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='qsort' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE5qsortEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='qsort' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE5qsortEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='429' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-10'/>
    <class-decl name='hb_user_data_array_t' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='70' column='1' id='type-id-17'>
      <member-type access='public'>
        <class-decl name='hb_user_data_item_t' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='71' column='1' id='type-id-18'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='key' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='72' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='data' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='73' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='74' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='operator==' mangled-name='_ZNK20hb_user_data_array_t19hb_user_data_item_teqEP18hb_user_data_key_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-22' is-artificial='yes'/>
              <parameter type-id='type-id-19'/>
              <return type-id='type-id-7'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator==' mangled-name='_ZNK20hb_user_data_array_t19hb_user_data_item_teqERS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-22' is-artificial='yes'/>
              <parameter type-id='type-id-14'/>
              <return type-id='type-id-7'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='finish' mangled-name='_ZN20hb_user_data_array_t19hb_user_data_item_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-11' is-artificial='yes'/>
              <return type-id='type-id-5'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-23' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='items' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='83' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN20hb_user_data_array_t4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set' mangled-name='_ZN20hb_user_data_array_t3setEP18hb_user_data_key_tPvPFvS2_Ei' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-20'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get' mangled-name='_ZN20hb_user_data_array_t3getEP18hb_user_data_key_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN20hb_user_data_array_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_user_data_key_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='334' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unused' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-28'/>
    <typedef-decl name='hb_user_data_key_t' type-id='type-id-27' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='337' column='1' id='type-id-29'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-31'/>
    <typedef-decl name='hb_destroy_func_t' type-id='type-id-31' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='339' column='1' id='type-id-21'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-22'/>
    <reference-type-def kind='lvalue' type-id='type-id-18' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-11'/>
    <class-decl name='hb_mutex_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='117' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='120' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN10hb_mutex_t4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-34' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='lock' mangled-name='_ZN10hb_mutex_t4lockEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-34' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='unlock' mangled-name='_ZN10hb_mutex_t6unlockEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-34' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN10hb_mutex_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-34' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <union-decl name='pthread_mutex_t' size-in-bits='320' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1' id='type-id-35'>
      <member-type access='private'>
        <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' id='type-id-36'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='__lock' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='__count' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='81' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='__owner' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='82' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='__nusers' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='84' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='__kind' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='88' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='__spins' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='90' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='__list' type-id='type-id-37' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='91' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-36' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='101' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-40' filepath='/usr/include/bits/pthreadtypes.h' line='65' column='1' id='type-id-37'/>
    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='320' id='type-id-38'>
      <subrange length='40'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-39'/>
    <typedef-decl name='hb_mutex_impl_t' type-id='type-id-35' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='59' column='1' id='type-id-33'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-34'/>
    <class-decl name='hb_lockable_set_t&lt;hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='449' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='items' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='450' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN17hb_lockable_set_tIN20hb_user_data_array_t19hb_user_data_item_tE10hb_mutex_tE4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='452' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-42' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN17hb_lockable_set_tIN20hb_user_data_array_t19hb_user_data_item_tE10hb_mutex_tE6finishERS2_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-42' is-artificial='yes'/>
          <parameter type-id='type-id-43'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-42'/>
    <reference-type-def kind='lvalue' type-id='type-id-23' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-25'/>
    <typedef-decl name='hb_bool_t' type-id='type-id-4' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='73' column='1' id='type-id-26'/>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='384' id='type-id-12'>
      <subrange length='2'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-13'/>
    <reference-type-def kind='lvalue' type-id='type-id-32' size-in-bits='64' id='type-id-16'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-15'/>
    <class-decl name='hb_blob_t' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='53' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-46' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='data' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='length' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='mode' type-id='type-id-48' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='user_data' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='64' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='_static_assertion_on_line_55' mangled-name='_ZNK9hb_blob_t28_static_assertion_on_line_55Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_object_header_t' size-in-bits='896' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='101' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user_data' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='103' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='_static_assertion_on_line_108' mangled-name='_ZNK18hb_object_header_t29_static_assertion_on_line_108Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-51'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-50'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-47'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-53'/>
    <enum-decl name='hb_memory_mode_t' id='type-id-48'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_MEMORY_MODE_DUPLICATE' value='0'/>
      <enumerator name='HB_MEMORY_MODE_READONLY' value='1'/>
      <enumerator name='HB_MEMORY_MODE_WRITABLE' value='2'/>
      <enumerator name='HB_MEMORY_MODE_READONLY_MAY_MAKE_WRITABLE' value='3'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-49'/>
    <typedef-decl name='hb_blob_t' type-id='type-id-45' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='65' column='1' id='type-id-55'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <function-decl name='hb_blob_get_empty' mangled-name='hb_blob_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_empty'>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='hb_blob_is_immutable' mangled-name='hb_blob_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_is_immutable'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_blob_get_length' mangled-name='hb_blob_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_length'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-57'/>
    <function-decl name='hb_blob_get_data' mangled-name='hb_blob_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <parameter type-id='type-id-57' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='hb_blob_make_immutable' mangled-name='hb_blob_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_make_immutable'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-58'/>
    <function-decl name='hb_blob_get_data_writable' mangled-name='hb_blob_get_data_writable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data_writable'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <parameter type-id='type-id-57' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='hb_blob_get_user_data' mangled-name='hb_blob_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_user_data'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1'/>
      <parameter type-id='type-id-19' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='275' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='hb_blob_set_user_data' mangled-name='hb_blob_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_set_user_data'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1'/>
      <parameter type-id='type-id-19' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='254' column='1'/>
      <parameter type-id='type-id-20' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='255' column='1'/>
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='256' column='1'/>
      <parameter type-id='type-id-26' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='257' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_blob_reference' mangled-name='hb_blob_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_reference'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='hb_blob_destroy' mangled-name='hb_blob_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_destroy'>
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_blob_create' mangled-name='hb_blob_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create'>
      <parameter type-id='type-id-47' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1'/>
      <parameter type-id='type-id-10' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='98' column='1'/>
      <parameter type-id='type-id-48' name='mode' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='99' column='1'/>
      <parameter type-id='type-id-20' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='100' column='1'/>
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='101' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='hb_blob_create_sub_blob' mangled-name='hb_blob_create_sub_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create_sub_blob'>
      <parameter type-id='type-id-56' name='parent' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1'/>
      <parameter type-id='type-id-10' name='offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='151' column='1'/>
      <parameter type-id='type-id-10' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='152' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='271' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-58' visibility='default' filepath='/usr/include/libio.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-60' visibility='default' filepath='/usr/include/libio.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-61' visibility='default' filepath='/usr/include/libio.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-62' visibility='default' filepath='/usr/include/libio.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-63' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-64' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-65' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-66' visibility='default' filepath='/usr/include/libio.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-20' visibility='default' filepath='/usr/include/libio.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-20' visibility='default' filepath='/usr/include/libio.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-20' visibility='default' filepath='/usr/include/libio.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-20' visibility='default' filepath='/usr/include/libio.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-67' visibility='default' filepath='/usr/include/libio.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-68' visibility='default' filepath='/usr/include/libio.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='186' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-60' visibility='default' filepath='/usr/include/libio.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-61' visibility='default' filepath='/usr/include/libio.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-4' visibility='default' filepath='/usr/include/libio.h' line='192' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-61'/>
    <typedef-decl name='__off_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='141' column='1' id='type-id-62'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-63'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-64'/>
    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='8' id='type-id-65'>
      <subrange length='1'/>
    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='142' column='1' id='type-id-66'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='size_t' type-id='type-id-70' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='type-id-67'/>
    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='160' id='type-id-68'>
      <subrange length='20'/>
    </array-type-def>
    <var-decl name='stdin' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='165' column='1'/>
    <var-decl name='stdout' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='166' column='1'/>
    <var-decl name='stderr' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='167' column='1'/>
    <union-decl name='hb_options_union_t' size-in-bits='32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='919' column='1' id='type-id-71'>
      <data-member access='private'>
        <var-decl name='i' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='920' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='opts' type-id='type-id-72' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='921' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='hb_options_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='914' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='initialized' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='915' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='uniscribe_bug_compatible' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='916' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='_hb_options' type-id='type-id-71' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='928' column='1'/>
    <function-type size-in-bits='64' id='type-id-30'>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hb-buffer-serialize.cc' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-73'/>
    <function-decl name='hb_buffer_serialize_list_formats' mangled-name='hb_buffer_serialize_list_formats' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_list_formats'>
      <return type-id='type-id-73'/>
    </function-decl>
    <enum-decl name='hb_buffer_serialize_format_t' id='type-id-74'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_TEXT' value='1413830740'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_JSON' value='1246973774'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_INVALID' value='0'/>
    </enum-decl>
    <function-decl name='hb_buffer_serialize_format_to_string' mangled-name='hb_buffer_serialize_format_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_to_string'>
      <parameter type-id='type-id-74' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <class-decl name='hb_buffer_t' size-in-bits='2752' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='46' column='1' id='type-id-75'>
      <member-type access='public'>
        <typedef-decl name='scratch_buffer_t' type-id='type-id-39' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='190' column='1' id='type-id-76'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-46' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='unicode' type-id='type-id-77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flags' type-id='type-id-78' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='replacement' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='content_type' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='props' type-id='type-id-81' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='in_error' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <var-decl name='have_output' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <var-decl name='have_positions' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='idx' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='len' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='out_len' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='allocated' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='info' type-id='type-id-82' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='out_info' type-id='type-id-82' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='pos' type-id='type-id-83' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='serial' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='allocated_var_bytes' type-id='type-id-84' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='allocated_var_owner' type-id='type-id-85' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='87' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='CONTEXT_LENGTH' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='context' type-id='type-id-87' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='context_len' type-id='type-id-88' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='94' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='_static_assertion_on_line_48' mangled-name='_ZNK11hb_buffer_t28_static_assertion_on_line_48Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='cur' mangled-name='_ZN11hb_buffer_t3curEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-91'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='cur' mangled-name='_ZNK11hb_buffer_t3curEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-92'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='cur_pos' mangled-name='_ZN11hb_buffer_t7cur_posEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='cur_pos' mangled-name='_ZNK11hb_buffer_t7cur_posEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-94'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='prev' mangled-name='_ZN11hb_buffer_t4prevEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-91'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='prev' mangled-name='_ZNK11hb_buffer_t4prevEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-92'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='has_separate_output' mangled-name='_ZNK11hb_buffer_t19has_separate_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reset' mangled-name='_ZN11hb_buffer_t5resetEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clear' mangled-name='_ZN11hb_buffer_t5clearEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='backtrack_len' mangled-name='_ZNK11hb_buffer_t13backtrack_lenEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='lookahead_len' mangled-name='_ZNK11hb_buffer_t13lookahead_lenEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-89' is-artificial='yes'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='next_serial' mangled-name='_ZN11hb_buffer_t11next_serialEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='allocate_var' mangled-name='_ZN11hb_buffer_t12allocate_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='deallocate_var' mangled-name='_ZN11hb_buffer_t14deallocate_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='assert_var' mangled-name='_ZN11hb_buffer_t10assert_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='deallocate_var_all' mangled-name='_ZN11hb_buffer_t18deallocate_var_allEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add' mangled-name='_ZN11hb_buffer_t3addEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_info' mangled-name='_ZN11hb_buffer_t8add_infoERK15hb_glyph_info_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-95'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reverse_range' mangled-name='_ZN11hb_buffer_t13reverse_rangeEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reverse' mangled-name='_ZN11hb_buffer_t7reverseEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reverse_clusters' mangled-name='_ZN11hb_buffer_t16reverse_clustersEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='guess_segment_properties' mangled-name='_ZN11hb_buffer_t24guess_segment_propertiesEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='swap_buffers' mangled-name='_ZN11hb_buffer_t12swap_buffersEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_output' mangled-name='_ZN11hb_buffer_t13remove_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clear_output' mangled-name='_ZN11hb_buffer_t12clear_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clear_positions' mangled-name='_ZN11hb_buffer_t15clear_positionsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='replace_glyphs' mangled-name='_ZN11hb_buffer_t14replace_glyphsEjjPKj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='replace_glyph' mangled-name='_ZN11hb_buffer_t13replace_glyphEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='output_glyph' mangled-name='_ZN11hb_buffer_t12output_glyphEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='output_info' mangled-name='_ZN11hb_buffer_t11output_infoERK15hb_glyph_info_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-95'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='copy_glyph' mangled-name='_ZN11hb_buffer_t10copy_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='move_to' mangled-name='_ZN11hb_buffer_t7move_toEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='next_glyph' mangled-name='_ZN11hb_buffer_t10next_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='skip_glyph' mangled-name='_ZN11hb_buffer_t10skip_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reset_masks' mangled-name='_ZN11hb_buffer_t11reset_masksEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-97'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_masks' mangled-name='_ZN11hb_buffer_t9add_masksEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-97'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_masks' mangled-name='_ZN11hb_buffer_t9set_masksEjjjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-97'/>
          <parameter type-id='type-id-97'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='merge_clusters' mangled-name='_ZN11hb_buffer_t14merge_clustersEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='merge_out_clusters' mangled-name='_ZN11hb_buffer_t18merge_out_clustersEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='enlarge' mangled-name='_ZN11hb_buffer_t7enlargeEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ensure' mangled-name='_ZN11hb_buffer_t6ensureEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ensure_inplace' mangled-name='_ZN11hb_buffer_t14ensure_inplaceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='make_room_for' mangled-name='_ZN11hb_buffer_t13make_room_forEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='shift_forward' mangled-name='_ZN11hb_buffer_t13shift_forwardEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_scratch_buffer' mangled-name='_ZN11hb_buffer_t18get_scratch_bufferEPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-98'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clear_context' mangled-name='_ZN11hb_buffer_t13clear_contextEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_unicode_funcs_t' size-in-bits='2560' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='64' column='1' id='type-id-99'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='203' column='1' id='type-id-100'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-101' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-106' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-107' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-108' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='209' column='1' id='type-id-109'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='215' column='1' id='type-id-110'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-46' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='parent' type-id='type-id-111' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='immutable' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='func' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='user_data' type-id='type-id-109' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='destroy' type-id='type-id-110' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='219' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='_static_assertion_on_line_66' mangled-name='_ZNK18hb_unicode_funcs_t28_static_assertion_on_line_66Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='combining_class' mangled-name='_ZN18hb_unicode_funcs_t15combining_classEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-113'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='eastasian_width' mangled-name='_ZN18hb_unicode_funcs_t15eastasian_widthEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='general_category' mangled-name='_ZN18hb_unicode_funcs_t16general_categoryEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-114'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='mirroring' mangled-name='_ZN18hb_unicode_funcs_t9mirroringEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-79'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='script' mangled-name='_ZN18hb_unicode_funcs_t6scriptEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-115'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='compose' mangled-name='_ZN18hb_unicode_funcs_t7composeEjjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <parameter type-id='type-id-79'/>
          <parameter type-id='type-id-116'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='decompose' mangled-name='_ZN18hb_unicode_funcs_t9decomposeEjPjS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-116'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='decompose_compatibility' mangled-name='_ZN18hb_unicode_funcs_t23decompose_compatibilityEjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <parameter type-id='type-id-116'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='modified_combining_class' mangled-name='_ZN18hb_unicode_funcs_t24modified_combining_classEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='is_variation_selector' mangled-name='_ZN18hb_unicode_funcs_t21is_variation_selectorEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='is_default_ignorable' mangled-name='_ZN18hb_unicode_funcs_t20is_default_ignorableEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='hb_unicode_combining_class_t' id='type-id-113'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NOT_REORDERED' value='0'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_OVERLAY' value='1'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NUKTA' value='7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_KANA_VOICING' value='8'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_VIRAMA' value='9'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC10' value='10'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC11' value='11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC12' value='12'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC13' value='13'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC14' value='14'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC15' value='15'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC16' value='16'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC17' value='17'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC18' value='18'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC19' value='19'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC20' value='20'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC21' value='21'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC22' value='22'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC23' value='23'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC24' value='24'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC25' value='25'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC26' value='26'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC27' value='27'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC28' value='28'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC29' value='29'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC30' value='30'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC31' value='31'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC32' value='32'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC33' value='33'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC34' value='34'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC35' value='35'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC36' value='36'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC84' value='84'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC91' value='91'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC103' value='103'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC107' value='107'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC118' value='118'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC122' value='122'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC129' value='129'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC130' value='130'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC133' value='132'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW_LEFT' value='200'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW' value='202'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE' value='214'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE_RIGHT' value='216'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_LEFT' value='218'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW' value='220'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_RIGHT' value='222'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_LEFT' value='224'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_RIGHT' value='226'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_LEFT' value='228'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE' value='230'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_RIGHT' value='232'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_BELOW' value='233'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_ABOVE' value='234'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_IOTA_SUBSCRIPT' value='240'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_INVALID' value='255'/>
    </enum-decl>
    <typedef-decl name='hb_unicode_funcs_t' type-id='type-id-99' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='171' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-77'/>
    <typedef-decl name='uint32_t' type-id='type-id-10' filepath='/usr/include/stdint.h' line='52' column='1' id='type-id-118'/>
    <typedef-decl name='hb_codepoint_t' type-id='type-id-118' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='75' column='1' id='type-id-79'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
    <typedef-decl name='hb_unicode_combining_class_func_t' type-id='type-id-120' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='224' column='1' id='type-id-101'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <typedef-decl name='hb_unicode_eastasian_width_func_t' type-id='type-id-122' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='227' column='1' id='type-id-102'/>
    <enum-decl name='hb_unicode_general_category_t' id='type-id-114'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONTROL' value='0'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FORMAT' value='1'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UNASSIGNED' value='2'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PRIVATE_USE' value='3'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SURROGATE' value='4'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LOWERCASE_LETTER' value='5'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_LETTER' value='6'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_LETTER' value='7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_TITLECASE_LETTER' value='8'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UPPERCASE_LETTER' value='9'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACING_MARK' value='10'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_ENCLOSING_MARK' value='11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_NON_SPACING_MARK' value='12'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DECIMAL_NUMBER' value='13'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LETTER_NUMBER' value='14'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_NUMBER' value='15'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DASH_PUNCTUATION' value='17'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MATH_SYMBOL' value='25'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_SYMBOL' value='26'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LINE_SEPARATOR' value='27'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <typedef-decl name='hb_unicode_general_category_func_t' type-id='type-id-124' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='230' column='1' id='type-id-103'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <typedef-decl name='hb_unicode_mirroring_func_t' type-id='type-id-126' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='233' column='1' id='type-id-104'/>
    <enum-decl name='hb_script_t' id='type-id-115'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_SCRIPT_COMMON' value='1517910393'/>
      <enumerator name='HB_SCRIPT_INHERITED' value='1516858984'/>
      <enumerator name='HB_SCRIPT_UNKNOWN' value='1517976186'/>
      <enumerator name='HB_SCRIPT_ARABIC' value='1098015074'/>
      <enumerator name='HB_SCRIPT_ARMENIAN' value='1098018158'/>
      <enumerator name='HB_SCRIPT_BENGALI' value='1113943655'/>
      <enumerator name='HB_SCRIPT_CYRILLIC' value='1132032620'/>
      <enumerator name='HB_SCRIPT_DEVANAGARI' value='1147500129'/>
      <enumerator name='HB_SCRIPT_GEORGIAN' value='1197830002'/>
      <enumerator name='HB_SCRIPT_GREEK' value='1198679403'/>
      <enumerator name='HB_SCRIPT_GUJARATI' value='1198877298'/>
      <enumerator name='HB_SCRIPT_GURMUKHI' value='1198879349'/>
      <enumerator name='HB_SCRIPT_HANGUL' value='1214344807'/>
      <enumerator name='HB_SCRIPT_HAN' value='1214344809'/>
      <enumerator name='HB_SCRIPT_HEBREW' value='1214603890'/>
      <enumerator name='HB_SCRIPT_HIRAGANA' value='1214870113'/>
      <enumerator name='HB_SCRIPT_KANNADA' value='1265525857'/>
      <enumerator name='HB_SCRIPT_KATAKANA' value='1264676449'/>
      <enumerator name='HB_SCRIPT_LAO' value='1281453935'/>
      <enumerator name='HB_SCRIPT_LATIN' value='1281455214'/>
      <enumerator name='HB_SCRIPT_MALAYALAM' value='1298954605'/>
      <enumerator name='HB_SCRIPT_ORIYA' value='1332902241'/>
      <enumerator name='HB_SCRIPT_TAMIL' value='1415671148'/>
      <enumerator name='HB_SCRIPT_TELUGU' value='1415933045'/>
      <enumerator name='HB_SCRIPT_THAI' value='1416126825'/>
      <enumerator name='HB_SCRIPT_TIBETAN' value='1416192628'/>
      <enumerator name='HB_SCRIPT_BOPOMOFO' value='1114599535'/>
      <enumerator name='HB_SCRIPT_BRAILLE' value='1114792297'/>
      <enumerator name='HB_SCRIPT_CANADIAN_SYLLABICS' value='1130458739'/>
      <enumerator name='HB_SCRIPT_CHEROKEE' value='1130915186'/>
      <enumerator name='HB_SCRIPT_ETHIOPIC' value='1165256809'/>
      <enumerator name='HB_SCRIPT_KHMER' value='1265134962'/>
      <enumerator name='HB_SCRIPT_MONGOLIAN' value='1299148391'/>
      <enumerator name='HB_SCRIPT_MYANMAR' value='1299803506'/>
      <enumerator name='HB_SCRIPT_OGHAM' value='1332175213'/>
      <enumerator name='HB_SCRIPT_RUNIC' value='1383427698'/>
      <enumerator name='HB_SCRIPT_SINHALA' value='1399418472'/>
      <enumerator name='HB_SCRIPT_SYRIAC' value='1400468067'/>
      <enumerator name='HB_SCRIPT_THAANA' value='1416126817'/>
      <enumerator name='HB_SCRIPT_YI' value='1500080489'/>
      <enumerator name='HB_SCRIPT_DESERET' value='1148416628'/>
      <enumerator name='HB_SCRIPT_GOTHIC' value='1198486632'/>
      <enumerator name='HB_SCRIPT_OLD_ITALIC' value='1232363884'/>
      <enumerator name='HB_SCRIPT_BUHID' value='1114990692'/>
      <enumerator name='HB_SCRIPT_HANUNOO' value='1214344815'/>
      <enumerator name='HB_SCRIPT_TAGALOG' value='1416064103'/>
      <enumerator name='HB_SCRIPT_TAGBANWA' value='1415669602'/>
      <enumerator name='HB_SCRIPT_CYPRIOT' value='1131442804'/>
      <enumerator name='HB_SCRIPT_LIMBU' value='1281977698'/>
      <enumerator name='HB_SCRIPT_LINEAR_B' value='1281977954'/>
      <enumerator name='HB_SCRIPT_OSMANYA' value='1332964705'/>
      <enumerator name='HB_SCRIPT_SHAVIAN' value='1399349623'/>
      <enumerator name='HB_SCRIPT_TAI_LE' value='1415670885'/>
      <enumerator name='HB_SCRIPT_UGARITIC' value='1432838514'/>
      <enumerator name='HB_SCRIPT_BUGINESE' value='1114990441'/>
      <enumerator name='HB_SCRIPT_COPTIC' value='1131376756'/>
      <enumerator name='HB_SCRIPT_GLAGOLITIC' value='1198285159'/>
      <enumerator name='HB_SCRIPT_KHAROSHTHI' value='1265131890'/>
      <enumerator name='HB_SCRIPT_NEW_TAI_LUE' value='1415670901'/>
      <enumerator name='HB_SCRIPT_OLD_PERSIAN' value='1483761007'/>
      <enumerator name='HB_SCRIPT_SYLOTI_NAGRI' value='1400466543'/>
      <enumerator name='HB_SCRIPT_TIFINAGH' value='1415999079'/>
      <enumerator name='HB_SCRIPT_BALINESE' value='1113681001'/>
      <enumerator name='HB_SCRIPT_CUNEIFORM' value='1483961720'/>
      <enumerator name='HB_SCRIPT_NKO' value='1315663727'/>
      <enumerator name='HB_SCRIPT_PHAGS_PA' value='1349017959'/>
      <enumerator name='HB_SCRIPT_PHOENICIAN' value='1349021304'/>
      <enumerator name='HB_SCRIPT_CARIAN' value='1130459753'/>
      <enumerator name='HB_SCRIPT_CHAM' value='1130914157'/>
      <enumerator name='HB_SCRIPT_KAYAH_LI' value='1264675945'/>
      <enumerator name='HB_SCRIPT_LEPCHA' value='1281716323'/>
      <enumerator name='HB_SCRIPT_LYCIAN' value='1283023721'/>
      <enumerator name='HB_SCRIPT_LYDIAN' value='1283023977'/>
      <enumerator name='HB_SCRIPT_OL_CHIKI' value='1332503403'/>
      <enumerator name='HB_SCRIPT_REJANG' value='1382706791'/>
      <enumerator name='HB_SCRIPT_SAURASHTRA' value='1398895986'/>
      <enumerator name='HB_SCRIPT_SUNDANESE' value='1400204900'/>
      <enumerator name='HB_SCRIPT_VAI' value='1449224553'/>
      <enumerator name='HB_SCRIPT_AVESTAN' value='1098281844'/>
      <enumerator name='HB_SCRIPT_BAMUM' value='1113681269'/>
      <enumerator name='HB_SCRIPT_EGYPTIAN_HIEROGLYPHS' value='1164409200'/>
      <enumerator name='HB_SCRIPT_IMPERIAL_ARAMAIC' value='1098018153'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PAHLAVI' value='1349020777'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PARTHIAN' value='1349678185'/>
      <enumerator name='HB_SCRIPT_JAVANESE' value='1247901281'/>
      <enumerator name='HB_SCRIPT_KAITHI' value='1265920105'/>
      <enumerator name='HB_SCRIPT_LISU' value='1281979253'/>
      <enumerator name='HB_SCRIPT_MEETEI_MAYEK' value='1299473769'/>
      <enumerator name='HB_SCRIPT_OLD_SOUTH_ARABIAN' value='1398895202'/>
      <enumerator name='HB_SCRIPT_OLD_TURKIC' value='1332898664'/>
      <enumerator name='HB_SCRIPT_SAMARITAN' value='1398893938'/>
      <enumerator name='HB_SCRIPT_TAI_THAM' value='1281453665'/>
      <enumerator name='HB_SCRIPT_TAI_VIET' value='1415673460'/>
      <enumerator name='HB_SCRIPT_BATAK' value='1113683051'/>
      <enumerator name='HB_SCRIPT_BRAHMI' value='1114792296'/>
      <enumerator name='HB_SCRIPT_MANDAIC' value='1298230884'/>
      <enumerator name='HB_SCRIPT_CHAKMA' value='1130457965'/>
      <enumerator name='HB_SCRIPT_MEROITIC_CURSIVE' value='1298494051'/>
      <enumerator name='HB_SCRIPT_MEROITIC_HIEROGLYPHS' value='1298494063'/>
      <enumerator name='HB_SCRIPT_MIAO' value='1349284452'/>
      <enumerator name='HB_SCRIPT_SHARADA' value='1399353956'/>
      <enumerator name='HB_SCRIPT_SORA_SOMPENG' value='1399812705'/>
      <enumerator name='HB_SCRIPT_TAKRI' value='1415670642'/>
      <enumerator name='HB_SCRIPT_BASSA_VAH' value='1113682803'/>
      <enumerator name='HB_SCRIPT_CAUCASIAN_ALBANIAN' value='1097295970'/>
      <enumerator name='HB_SCRIPT_DUPLOYAN' value='1148547180'/>
      <enumerator name='HB_SCRIPT_ELBASAN' value='1164730977'/>
      <enumerator name='HB_SCRIPT_GRANTHA' value='1198678382'/>
      <enumerator name='HB_SCRIPT_KHOJKI' value='1265135466'/>
      <enumerator name='HB_SCRIPT_KHUDAWADI' value='1399418468'/>
      <enumerator name='HB_SCRIPT_LINEAR_A' value='1281977953'/>
      <enumerator name='HB_SCRIPT_MAHAJANI' value='1298229354'/>
      <enumerator name='HB_SCRIPT_MANICHAEAN' value='1298230889'/>
      <enumerator name='HB_SCRIPT_MENDE_KIKAKUI' value='1298493028'/>
      <enumerator name='HB_SCRIPT_MODI' value='1299145833'/>
      <enumerator name='HB_SCRIPT_MRO' value='1299345263'/>
      <enumerator name='HB_SCRIPT_NABATAEAN' value='1315070324'/>
      <enumerator name='HB_SCRIPT_OLD_NORTH_ARABIAN' value='1315009122'/>
      <enumerator name='HB_SCRIPT_OLD_PERMIC' value='1348825709'/>
      <enumerator name='HB_SCRIPT_PAHAWH_HMONG' value='1215131239'/>
      <enumerator name='HB_SCRIPT_PALMYRENE' value='1348562029'/>
      <enumerator name='HB_SCRIPT_PAU_CIN_HAU' value='1348564323'/>
      <enumerator name='HB_SCRIPT_PSALTER_PAHLAVI' value='1349020784'/>
      <enumerator name='HB_SCRIPT_SIDDHAM' value='1399415908'/>
      <enumerator name='HB_SCRIPT_TIRHUTA' value='1416196712'/>
      <enumerator name='HB_SCRIPT_WARANG_CITI' value='1466004065'/>
      <enumerator name='HB_SCRIPT_INVALID' value='0'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE' value='4294967295'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE_SIGNED' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='hb_unicode_script_func_t' type-id='type-id-128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='236' column='1' id='type-id-105'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <typedef-decl name='hb_unicode_compose_func_t' type-id='type-id-130' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='242' column='1' id='type-id-106'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <typedef-decl name='hb_unicode_decompose_func_t' type-id='type-id-132' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='247' column='1' id='type-id-107'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <typedef-decl name='hb_unicode_decompose_compatibility_func_t' type-id='type-id-134' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='270' column='1' id='type-id-108'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-111'/>
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-135'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-112'/>
    <enum-decl name='hb_buffer_flags_t' id='type-id-78'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_BUFFER_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_FLAG_BOT' value='1'/>
      <enumerator name='HB_BUFFER_FLAG_EOT' value='2'/>
      <enumerator name='HB_BUFFER_FLAG_PRESERVE_DEFAULT_IGNORABLES' value='4'/>
    </enum-decl>
    <enum-decl name='hb_buffer_content_type_t' id='type-id-80'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_INVALID' value='0'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_UNICODE' value='1'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_GLYPHS' value='2'/>
    </enum-decl>
    <class-decl name='hb_segment_properties_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='65' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='direction' type-id='type-id-137' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='script' type-id='type-id-115' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='language' type-id='type-id-138' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved1' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved2' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='hb_direction_t' id='type-id-137'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_DIRECTION_INVALID' value='0'/>
      <enumerator name='HB_DIRECTION_LTR' value='4'/>
      <enumerator name='HB_DIRECTION_RTL' value='5'/>
      <enumerator name='HB_DIRECTION_TTB' value='6'/>
      <enumerator name='HB_DIRECTION_BTT' value='7'/>
    </enum-decl>
    <class-decl name='hb_language_impl_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-139'/>
    <qualified-type-def type-id='type-id-139' const='yes' id='type-id-140'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
    <typedef-decl name='hb_language_t' type-id='type-id-141' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='137' column='1' id='type-id-138'/>
    <typedef-decl name='hb_segment_properties_t' type-id='type-id-136' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='72' column='1' id='type-id-81'/>
    <class-decl name='hb_glyph_info_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='44' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='codepoint' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mask' type-id='type-id-97' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cluster' type-id='type-id-118' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='var1' type-id='type-id-143' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='var2' type-id='type-id-143' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_mask_t' type-id='type-id-118' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='77' column='1' id='type-id-97'/>
    <union-decl name='_hb_var_int_t' size-in-bits='32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='79' column='1' id='type-id-144'>
      <data-member access='private'>
        <var-decl name='u32' type-id='type-id-118' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='80' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i32' type-id='type-id-145' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='81' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='u16' type-id='type-id-146' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='82' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i16' type-id='type-id-147' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='83' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='u8' type-id='type-id-148' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='84' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i8' type-id='type-id-149' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='int32_t' type-id='type-id-4' filepath='/usr/include/stdint.h' line='39' column='1' id='type-id-145'/>
    <typedef-decl name='uint16_t' type-id='type-id-63' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-150'/>
    <array-type-def dimensions='1' type-id='type-id-150' size-in-bits='32' id='type-id-146'>
      <subrange length='2'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-151'/>
    <typedef-decl name='int16_t' type-id='type-id-151' filepath='/usr/include/stdint.h' line='38' column='1' id='type-id-152'/>
    <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='32' id='type-id-147'>
      <subrange length='2'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-153'/>
    <typedef-decl name='uint8_t' type-id='type-id-153' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-154'/>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='32' id='type-id-148'>
      <subrange length='4'/>
    </array-type-def>
    <typedef-decl name='int8_t' type-id='type-id-64' filepath='/usr/include/stdint.h' line='37' column='1' id='type-id-155'/>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='32' id='type-id-149'>
      <subrange length='4'/>
    </array-type-def>
    <typedef-decl name='hb_var_int_t' type-id='type-id-144' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='86' column='1' id='type-id-143'/>
    <typedef-decl name='hb_glyph_info_t' type-id='type-id-142' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='52' column='1' id='type-id-92'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-82'/>
    <class-decl name='hb_glyph_position_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='54' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_advance' type-id='type-id-157' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y_advance' type-id='type-id-157' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_offset' type-id='type-id-157' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='y_offset' type-id='type-id-157' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='var' type-id='type-id-143' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_position_t' type-id='type-id-145' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='76' column='1' id='type-id-157'/>
    <typedef-decl name='hb_glyph_position_t' type-id='type-id-156' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='62' column='1' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-83'/>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='64' id='type-id-84'>
      <subrange length='8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-47' size-in-bits='512' id='type-id-85'>
      <subrange length='8'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-86'/>
    <array-type-def dimensions='2' type-id='type-id-79' size-in-bits='224' id='type-id-87'>
      <subrange length='2'/>
      <subrange length='5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='64' id='type-id-88'>
      <subrange length='2'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-89'/>
    <reference-type-def kind='lvalue' type-id='type-id-92' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-90'/>
    <reference-type-def kind='lvalue' type-id='type-id-94' size-in-bits='64' id='type-id-93'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-159'/>
    <reference-type-def kind='lvalue' type-id='type-id-159' size-in-bits='64' id='type-id-95'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-98'/>
    <typedef-decl name='hb_buffer_t' type-id='type-id-75' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='93' column='1' id='type-id-161'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
    <class-decl name='hb_font_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-163'/>
    <typedef-decl name='hb_font_t' type-id='type-id-163' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='40' column='1' id='type-id-164'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <function-decl name='hb_buffer_deserialize_glyphs' mangled-name='hb_buffer_deserialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_deserialize_glyphs'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1'/>
      <parameter type-id='type-id-47' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='354' column='1'/>
      <parameter type-id='type-id-4' name='buf_len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='355' column='1'/>
      <parameter type-id='type-id-73' name='end_ptr' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='356' column='1'/>
      <parameter type-id='type-id-165' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='357' column='1'/>
      <parameter type-id='type-id-74' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='358' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <enum-decl name='hb_buffer_serialize_flags_t' id='type-id-166'>
      <underlying-type type-id='type-id-53'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_CLUSTERS' value='1'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_POSITIONS' value='2'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_GLYPH_NAMES' value='4'/>
    </enum-decl>
    <function-decl name='hb_buffer_serialize_glyphs' mangled-name='hb_buffer_serialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_glyphs'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1'/>
      <parameter type-id='type-id-10' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='247' column='1'/>
      <parameter type-id='type-id-10' name='end' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='248' column='1'/>
      <parameter type-id='type-id-58' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='249' column='1'/>
      <parameter type-id='type-id-10' name='buf_size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='250' column='1'/>
      <parameter type-id='type-id-57' name='buf_consumed' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='251' column='1'/>
      <parameter type-id='type-id-165' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='252' column='1'/>
      <parameter type-id='type-id-74' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='253' column='1'/>
      <parameter type-id='type-id-166' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='254' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_format_from_string' mangled-name='hb_buffer_serialize_format_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_from_string'>
      <parameter type-id='type-id-47' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='165' column='1'/>
    <var-decl name='stdout' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='166' column='1'/>
    <var-decl name='stderr' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='167' column='1'/>
    <var-decl name='_hb_options' type-id='type-id-71' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='928' column='1'/>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='2048' id='type-id-167'>
      <subrange length='256'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-167' const='yes' id='type-id-168'/>
    <var-decl name='_hb_modified_combining_class' type-id='type-id-168' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='38' column='1'/>
    <var-decl name='CONTEXT_LENGTH' type-id='type-id-86' mangled-name='_ZN11hb_buffer_t14CONTEXT_LENGTHE' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='92' column='1'/>
    <function-type size-in-bits='64' id='type-id-119'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-113'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-121'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-123'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-114'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-79'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-115'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-26'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-26'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-10'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hb-buffer.cc' language='LANG_C_plus_plus'>
    <class-decl name='hb_utf_t&lt;unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='32' column='1' id='type-id-169'>
      <member-function access='public' static='yes'>
        <function-decl name='next' mangled-name='_ZN8hb_utf_tIjLb1EE4nextEPKjS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-170'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tIjLb1EE4prevEPKjS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-170'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tIjLb1EE6strlenEPKj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-170'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-170'/>
    <class-decl name='hb_language_impl_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-139'/>
    <class-decl name='hb_utf_t&lt;short unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='138' column='1' id='type-id-172'>
      <member-function access='public' static='yes'>
        <function-decl name='next' mangled-name='_ZN8hb_utf_tItLb1EE4nextEPKtS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-173'/>
          <parameter type-id='type-id-173'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tItLb1EE4prevEPKtS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-173'/>
          <parameter type-id='type-id-173'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tItLb1EE6strlenEPKt' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-173'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='type-id-150' const='yes' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-173'/>
    <class-decl name='hb_utf_t&lt;unsigned char, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='39' column='1' id='type-id-175'>
      <member-function access='public' static='yes'>
        <function-decl name='next' mangled-name='_ZN8hb_utf_tIhLb1EE4nextEPKhS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-176'/>
          <parameter type-id='type-id-176'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-176'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tIhLb1EE4prevEPKhS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-176'/>
          <parameter type-id='type-id-176'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-176'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tIhLb1EE6strlenEPKh' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-177'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-176'/>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <function-decl name='hb_segment_properties_equal' mangled-name='hb_segment_properties_equal' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_equal'>
      <parameter type-id='type-id-179' name='a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1'/>
      <parameter type-id='type-id-179' name='b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='41' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_segment_properties_hash' mangled-name='hb_segment_properties_hash' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_hash'>
      <parameter type-id='type-id-179' name='p' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='hb_buffer_get_empty' mangled-name='hb_buffer_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_empty'>
      <return type-id='type-id-162'/>
    </function-decl>
    <function-decl name='hb_buffer_set_content_type' mangled-name='hb_buffer_set_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_content_type'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1'/>
      <parameter type-id='type-id-80' name='content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='811' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_get_content_type' mangled-name='hb_buffer_get_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_content_type'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='hb_buffer_get_unicode_funcs' mangled-name='hb_buffer_get_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_unicode_funcs'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='hb_buffer_get_direction' mangled-name='hb_buffer_get_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_direction'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='hb_buffer_get_script' mangled-name='hb_buffer_get_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_script'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1'/>
      <return type-id='type-id-115'/>
    </function-decl>
    <function-decl name='hb_buffer_get_language' mangled-name='hb_buffer_get_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_language'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1'/>
      <return type-id='type-id-138'/>
    </function-decl>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-180'/>
    <function-decl name='hb_buffer_get_segment_properties' mangled-name='hb_buffer_get_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_segment_properties'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1'/>
      <parameter type-id='type-id-180' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1010' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_get_flags' mangled-name='hb_buffer_get_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_flags'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='hb_buffer_get_replacement_codepoint' mangled-name='hb_buffer_get_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_replacement_codepoint'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1'/>
      <return type-id='type-id-79'/>
    </function-decl>
    <function-decl name='hb_buffer_allocation_successful' mangled-name='hb_buffer_allocation_successful' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_allocation_successful'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_length' mangled-name='hb_buffer_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_length'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='hb_buffer_get_glyph_infos' mangled-name='hb_buffer_get_glyph_infos' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_infos'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1'/>
      <parameter type-id='type-id-57' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1238' column='1'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='hb_buffer_set_replacement_codepoint' mangled-name='hb_buffer_set_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_replacement_codepoint'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1'/>
      <parameter type-id='type-id-79' name='replacement' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1063' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_set_flags' mangled-name='hb_buffer_set_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_flags'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1'/>
      <parameter type-id='type-id-78' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1027' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_set_segment_properties' mangled-name='hb_buffer_set_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_segment_properties'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1'/>
      <parameter type-id='type-id-179' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='991' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_set_language' mangled-name='hb_buffer_set_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_language'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1'/>
      <parameter type-id='type-id-138' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='956' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_set_script' mangled-name='hb_buffer_set_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_script'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1'/>
      <parameter type-id='type-id-115' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='921' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_set_direction' mangled-name='hb_buffer_set_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_direction'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1'/>
      <parameter type-id='type-id-137' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='885' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_reverse' mangled-name='hb_buffer_reverse' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_reverse_clusters' mangled-name='hb_buffer_reverse_clusters' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse_clusters'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_get_glyph_positions' mangled-name='hb_buffer_get_glyph_positions' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_positions'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1'/>
      <parameter type-id='type-id-57' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1260' column='1'/>
      <return type-id='type-id-83'/>
    </function-decl>
    <function-decl name='hb_buffer_clear_contents' mangled-name='hb_buffer_clear_contents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_clear_contents'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_set_unicode_funcs' mangled-name='hb_buffer_set_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_unicode_funcs'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1'/>
      <parameter type-id='type-id-77' name='unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='844' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_reset' mangled-name='hb_buffer_reset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reset'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_get_user_data' mangled-name='hb_buffer_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_user_data'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1'/>
      <parameter type-id='type-id-19' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='794' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='hb_buffer_set_user_data' mangled-name='hb_buffer_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_user_data'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1'/>
      <parameter type-id='type-id-19' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='773' column='1'/>
      <parameter type-id='type-id-20' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='774' column='1'/>
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='775' column='1'/>
      <parameter type-id='type-id-26' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='776' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_reference' mangled-name='hb_buffer_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reference'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1'/>
      <return type-id='type-id-162'/>
    </function-decl>
    <function-decl name='hb_buffer_destroy' mangled-name='hb_buffer_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_destroy'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_create' mangled-name='hb_buffer_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_create'>
      <return type-id='type-id-162'/>
    </function-decl>
    <function-decl name='hb_buffer_guess_segment_properties' mangled-name='hb_buffer_guess_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_guess_segment_properties'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_pre_allocate' mangled-name='hb_buffer_pre_allocate' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_pre_allocate'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <parameter type-id='type-id-10' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_add' mangled-name='hb_buffer_add' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1'/>
      <parameter type-id='type-id-79' name='codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1161' column='1'/>
      <parameter type-id='type-id-10' name='cluster' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1162' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_add_codepoints' mangled-name='hb_buffer_add_codepoints' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_codepoints'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1'/>
      <parameter type-id='type-id-96' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1480' column='1'/>
      <parameter type-id='type-id-4' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1481' column='1'/>
      <parameter type-id='type-id-10' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1482' column='1'/>
      <parameter type-id='type-id-4' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1483' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf32' mangled-name='hb_buffer_add_utf32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf32'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1'/>
      <parameter type-id='type-id-170' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1458' column='1'/>
      <parameter type-id='type-id-4' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1459' column='1'/>
      <parameter type-id='type-id-10' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1460' column='1'/>
      <parameter type-id='type-id-4' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1461' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf16' mangled-name='hb_buffer_add_utf16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf16'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1'/>
      <parameter type-id='type-id-173' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1436' column='1'/>
      <parameter type-id='type-id-4' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1437' column='1'/>
      <parameter type-id='type-id-10' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1438' column='1'/>
      <parameter type-id='type-id-4' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1439' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_set_length' mangled-name='hb_buffer_set_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_length'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1'/>
      <parameter type-id='type-id-10' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1181' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf8' mangled-name='hb_buffer_add_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf8'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1'/>
      <parameter type-id='type-id-47' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1414' column='1'/>
      <parameter type-id='type-id-4' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1415' column='1'/>
      <parameter type-id='type-id-10' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1416' column='1'/>
      <parameter type-id='type-id-4' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1417' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_buffer_normalize_glyphs' mangled-name='hb_buffer_normalize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_normalize_glyphs'>
      <parameter type-id='type-id-162' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='165' column='1'/>
    <var-decl name='stdout' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='166' column='1'/>
    <var-decl name='stderr' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='167' column='1'/>
    <var-decl name='_hb_options' type-id='type-id-71' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='928' column='1'/>
    <var-decl name='_hb_modified_combining_class' type-id='type-id-168' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='38' column='1'/>
    <qualified-type-def type-id='type-id-117' const='yes' id='type-id-181'/>
    <var-decl name='_hb_unicode_funcs_nil' type-id='type-id-181' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='223' column='1'/>
    <var-decl name='CONTEXT_LENGTH' type-id='type-id-86' mangled-name='_ZN11hb_buffer_t14CONTEXT_LENGTHE' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='92' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hb-common.cc' language='LANG_C_plus_plus'>
    <class-decl name='hb_language_item_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='212' column='1' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-183' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lang' type-id='type-id-138' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='215' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='operator==' mangled-name='_ZNK18hb_language_item_teqEPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-184' is-artificial='yes'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator=' mangled-name='_ZN18hb_language_item_taSEPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-185'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN18hb_language_item_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <return type-id='type-id-5'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <class-decl name='hb_language_impl_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='167' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-187' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='168' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-187'/>
    <qualified-type-def type-id='type-id-182' const='yes' id='type-id-188'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-184'/>
    <reference-type-def kind='lvalue' type-id='type-id-182' size-in-bits='64' id='type-id-185'/>
    <typedef-decl name='hb_tag_t' type-id='type-id-118' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='91' column='1' id='type-id-189'/>
    <function-decl name='hb_tag_from_string' mangled-name='hb_tag_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_from_string'>
      <parameter type-id='type-id-47' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='hb_tag_to_string' mangled-name='hb_tag_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_to_string'>
      <parameter type-id='type-id-189' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <parameter type-id='type-id-58' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_language_to_string' mangled-name='hb_language_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_to_string'>
      <parameter type-id='type-id-138' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='hb_script_to_iso15924_tag' mangled-name='hb_script_to_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_to_iso15924_tag'>
      <parameter type-id='type-id-115' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='hb_script_get_horizontal_direction' mangled-name='hb_script_get_horizontal_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_get_horizontal_direction'>
      <parameter type-id='type-id-115' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='hb_version' mangled-name='hb_version' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version'>
      <parameter type-id='type-id-57' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1'/>
      <parameter type-id='type-id-57' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='548' column='1'/>
      <parameter type-id='type-id-57' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='549' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='hb_version_string' mangled-name='hb_version_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_string'>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='hb_version_atleast' mangled-name='hb_version_atleast' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_atleast'>
      <parameter type-id='type-id-10' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1'/>
      <parameter type-id='type-id-10' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='585' column='1'/>
      <parameter type-id='type-id-10' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='586' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_script_from_iso15924_tag' mangled-name='hb_script_from_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_iso15924_tag'>
      <parameter type-id='type-id-189' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1'/>
      <return type-id='type-id-115'/>
    </function-decl>
    <function-decl name='hb_script_from_string' mangled-name='hb_script_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_string'>
      <parameter type-id='type-id-47' name='s' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <return type-id='type-id-115'/>
    </function-decl>
    <function-decl name='hb_direction_to_string' mangled-name='hb_direction_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_to_string'>
      <parameter type-id='type-id-137' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='hb_direction_from_string' mangled-name='hb_direction_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_from_string'>
      <parameter type-id='type-id-47' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='hb_language_from_string' mangled-name='hb_language_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_from_string'>
      <parameter type-id='type-id-47' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <return type-id='type-id-138'/>
    </function-decl>
    <function-decl name='hb_language_get_default' mangled-name='hb_language_get_default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_get_default'>
      <return type-id='type-id-138'/>
    </function-decl>
    <function-decl name='_hb_options_init' mangled-name='_Z16_hb_options_initv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='165' column='1'/>
    <var-decl name='stdout' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='166' column='1'/>
    <var-decl name='stderr' type-id='type-id-61' visibility='default' filepath='/usr/include/stdio.h' line='167' column='1'/>
    <var-decl name='_hb_options' type-id='type-id-71' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='39' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hb-face.cc' language='LANG_C_plus_plus'>
    <namespace-decl name='OT'>
      <class-decl name='BEInt&lt;unsigned int, 4&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-190'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-148' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='607' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='set' mangled-name='_ZN2OT5BEIntIjLi4EE3setEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='585' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-191' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator unsigned int' mangled-name='_ZNK2OT5BEIntIjLi4EEcvjEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='592' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-192' is-artificial='yes'/>
            <return type-id='type-id-10'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator==' mangled-name='_ZNK2OT5BEIntIjLi4EEeqERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='599' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-192' is-artificial='yes'/>
            <parameter type-id='type-id-193'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator!=' mangled-name='_ZNK2OT5BEIntIjLi4EEneERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='606' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-192' is-artificial='yes'/>
            <parameter type-id='type-id-193'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BEInt&lt;short unsigned int, 2&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-194'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-195' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='554' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='set' mangled-name='_ZN2OT5BEIntItLi2EE3setEt' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='538' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-196' is-artificial='yes'/>
            <parameter type-id='type-id-63'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator short unsigned int' mangled-name='_ZNK2OT5BEIntItLi2EEcvtEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-197' is-artificial='yes'/>
            <return type-id='type-id-63'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator==' mangled-name='_ZNK2OT5BEIntItLi2EEeqERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='548' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-197' is-artificial='yes'/>
            <parameter type-id='type-id-198'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator!=' mangled-name='_ZNK2OT5BEIntItLi2EEneERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='553' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-197' is-artificial='yes'/>
            <parameter type-id='type-id-198'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IntType&lt;short unsigned int, 2u&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-199'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-194' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='set' mangled-name='_ZN2OT7IntTypeItLj2EE3setEt' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-200' is-artificial='yes'/>
            <parameter type-id='type-id-63'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator short unsigned int' mangled-name='_ZNK2OT7IntTypeItLj2EEcvtEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <return type-id='type-id-63'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator==' mangled-name='_ZNK2OT7IntTypeItLj2EEeqERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <parameter type-id='type-id-202'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator!=' mangled-name='_ZNK2OT7IntTypeItLj2EEneERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <parameter type-id='type-id-202'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='cmp' mangled-name='_ZN2OT7IntTypeItLj2EE3cmpEPKS1_S3_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='618' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201'/>
            <parameter type-id='type-id-201'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='cmp' mangled-name='_ZNK2OT7IntTypeItLj2EE3cmpES1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <parameter type-id='type-id-199'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='cmp' mangled-name='_ZNK2OT7IntTypeItLj2EE3cmpEt' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <parameter type-id='type-id-63'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT7IntTypeItLj2EE8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-200' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_628' mangled-name='_ZNK2OT7IntTypeItLj2EE31_instance_assertion_on_line_628Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='hb_sanitize_context_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='178' column='1' id='type-id-204'>
        <member-type access='public'>
          <typedef-decl name='return_t' type-id='type-id-7' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='181' column='1' id='type-id-205'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='max_debug_depth' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='180' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='debug_depth' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='280' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='start' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='end' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='writable' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='edit_count' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='283' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='blob' type-id='type-id-56' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='284' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='get_name' mangled-name='_ZN2OT21hb_sanitize_context_t8get_nameEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <return type-id='type-id-47'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='default_return_value' mangled-name='_ZN2OT21hb_sanitize_context_t20default_return_valueEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-205'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='stop_sublookup_iteration' mangled-name='_ZNK2OT21hb_sanitize_context_t24stop_sublookup_iterationEb' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-205'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='init' mangled-name='_ZN2OT21hb_sanitize_context_t4initEP9hb_blob_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='start_processing' mangled-name='_ZN2OT21hb_sanitize_context_t16start_processingEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='end_processing' mangled-name='_ZN2OT21hb_sanitize_context_t14end_processingEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_range' mangled-name='_ZNK2OT21hb_sanitize_context_t11check_rangeEPKvj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-20'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_array' mangled-name='_ZNK2OT21hb_sanitize_context_t11check_arrayEPKvjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-20'/>
            <parameter type-id='type-id-10'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='may_edit' mangled-name='_ZN2OT21hb_sanitize_context_t8may_editEPKvj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <parameter type-id='type-id-20'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <parameter type-id='type-id-207'/>
            <parameter type-id='type-id-208'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::maxp&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-209'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::head&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-210'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-211'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTable&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-212'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::FixedVersion&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-213'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-214'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-206' is-artificial='yes'/>
            <parameter type-id='type-id-215'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='741' column='1' id='type-id-216'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-217'/>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='778' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='778' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='operator()' mangled-name='_ZNK2OT8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEclEPKv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='742' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-215' is-artificial='yes'/>
            <parameter type-id='type-id-20'/>
            <return type-id='type-id-218'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='serialize' mangled-name='_ZN2OT8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEE9serializeEPNS_22hb_serialize_context_tEPv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='749' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-207' is-artificial='yes'/>
            <parameter type-id='type-id-219'/>
            <parameter type-id='type-id-20'/>
            <return type-id='type-id-220'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEE8sanitizeEPNS_21hb_sanitize_context_tEPv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-207' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <parameter type-id='type-id-20'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='neuter' mangled-name='_ZN2OT8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEE6neuterEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='775' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-207' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_778' mangled-name='_ZNK2OT8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEE31_instance_assertion_on_line_778Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='778' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-215' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Offset&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='683' column='1' id='type-id-217'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-221'/>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='686' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='686' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='is_null' mangled-name='_ZNK2OT6OffsetINS_7IntTypeIjLj4EEEE7is_nullEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='684' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-222' is-artificial='yes'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_686' mangled-name='_ZNK2OT6OffsetINS_7IntTypeIjLj4EEEE31_instance_assertion_on_line_686Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='686' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-222' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IntType&lt;unsigned int, 4u&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-221'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-190' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='set' mangled-name='_ZN2OT7IntTypeIjLj4EE3setEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-223' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator unsigned int' mangled-name='_ZNK2OT7IntTypeIjLj4EEcvjEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-211' is-artificial='yes'/>
            <return type-id='type-id-10'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator==' mangled-name='_ZNK2OT7IntTypeIjLj4EEeqERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-211' is-artificial='yes'/>
            <parameter type-id='type-id-224'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator!=' mangled-name='_ZNK2OT7IntTypeIjLj4EEneERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-211' is-artificial='yes'/>
            <parameter type-id='type-id-224'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='cmp' mangled-name='_ZN2OT7IntTypeIjLj4EE3cmpEPKS1_S3_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='618' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-211'/>
            <parameter type-id='type-id-211'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='cmp' mangled-name='_ZNK2OT7IntTypeIjLj4EE3cmpES1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-211' is-artificial='yes'/>
            <parameter type-id='type-id-221'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='cmp' mangled-name='_ZNK2OT7IntTypeIjLj4EE3cmpEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-211' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT7IntTypeIjLj4EE8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-223' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_628' mangled-name='_ZNK2OT7IntTypeIjLj4EE31_instance_assertion_on_line_628Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-211' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='OffsetTable' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='71' column='1' id='type-id-225'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='sfnt_version' type-id='type-id-226' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='111' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='numTables' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='112' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='48'>
          <var-decl name='searchRangeZ' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='entrySelectorZ' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='114' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='80'>
          <var-decl name='rangeShiftZ' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='115' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <var-decl name='tables' type-id='type-id-228' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='116' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='118' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='get_table_count' mangled-name='_ZNK2OT11OffsetTable15get_table_countEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-212' is-artificial='yes'/>
            <return type-id='type-id-10'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='get_table' mangled-name='_ZNK2OT11OffsetTable9get_tableEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-212' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-229'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='find_table_index' mangled-name='_ZNK2OT11OffsetTable16find_table_indexEjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-212' is-artificial='yes'/>
            <parameter type-id='type-id-189'/>
            <parameter type-id='type-id-57'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='get_table_by_tag' mangled-name='_ZNK2OT11OffsetTable16get_table_by_tagEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-212' is-artificial='yes'/>
            <parameter type-id='type-id-189'/>
            <return type-id='type-id-229'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT11OffsetTable8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-230' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_118' mangled-name='_ZNK2OT11OffsetTable31_instance_assertion_on_line_118Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-212' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_compiles_assertion_on_line_118' mangled-name='_ZNK2OT11OffsetTable31_compiles_assertion_on_line_118Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-212' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Tag' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='662' column='1' id='type-id-226'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-221'/>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='667' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='667' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='operator const char*' mangled-name='_ZNK2OT3TagcvPKcEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='664' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-231' is-artificial='yes'/>
            <return type-id='type-id-47'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator char*' mangled-name='_ZN2OT3TagcvPcEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='665' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-232' is-artificial='yes'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_667' mangled-name='_ZNK2OT3Tag31_instance_assertion_on_line_667Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='667' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-231' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='USHORT' type-id='type-id-199' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='632' column='1' id='type-id-227'/>
      <class-decl name='TableRecord' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='55' column='1' id='type-id-233'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tag' type-id='type-id-226' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='checkSum' type-id='type-id-234' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='offset' type-id='type-id-235' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='length' type-id='type-id-235' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='65' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT11TableRecord8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-236' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_67' mangled-name='_ZNK2OT11TableRecord30_instance_assertion_on_line_67Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-237' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='CheckSum' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='692' column='1' id='type-id-234'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-221'/>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='709' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='709' column='1'/>
        </data-member>
        <member-function access='public' static='yes'>
          <function-decl name='CalcTableChecksum' mangled-name='_ZN2OT8CheckSum17CalcTableChecksumEPKNS_7IntTypeIjLj4EEEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='694' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-238'/>
            <parameter type-id='type-id-118'/>
            <return type-id='type-id-118'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='set_for_data' mangled-name='_ZN2OT8CheckSum12set_for_dataEPKvj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='705' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-239' is-artificial='yes'/>
            <parameter type-id='type-id-20'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_709' mangled-name='_ZNK2OT8CheckSum31_instance_assertion_on_line_709Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='709' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-240' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='ULONG' type-id='type-id-221' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='634' column='1' id='type-id-235'/>
      <class-decl name='hb_serialize_context_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='377' column='1' id='type-id-241'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='debug_depth' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='start' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='end' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='head' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='ran_out_of_room' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='482' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='hb_serialize_context_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-219' is-artificial='yes'/>
            <parameter type-id='type-id-20'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='end_serialize' mangled-name='_ZN2OT22hb_serialize_context_t13end_serializeEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-219' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='truncate' mangled-name='_ZN2OT22hb_serialize_context_t8truncateEPv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='474' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-219' is-artificial='yes'/>
            <parameter type-id='type-id-20'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='maxp' size-in-bits='48' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='43' column='1' id='type-id-242'>
        <data-member access='public' static='yes'>
          <var-decl name='tableTag' type-id='type-id-243' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='44' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='type-id-244' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='58' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='numGlyphs' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='60' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='62' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='62' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='get_num_glyphs' mangled-name='_ZNK2OT4maxp14get_num_glyphsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-209' is-artificial='yes'/>
            <return type-id='type-id-10'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT4maxp8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-245' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_62' mangled-name='_ZNK2OT4maxp30_instance_assertion_on_line_62Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-209' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='FixedVersion' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='718' column='1' id='type-id-244'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='major' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='726' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='minor' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='727' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='729' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='729' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='to_int' mangled-name='_ZNK2OT12FixedVersion6to_intEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='719' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-213' is-artificial='yes'/>
            <return type-id='type-id-118'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT12FixedVersion8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='721' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-246' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_729' mangled-name='_ZNK2OT12FixedVersion31_instance_assertion_on_line_729Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='729' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-213' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='head' size-in-bits='432' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='45' column='1' id='type-id-247'>
        <data-member access='public' static='yes'>
          <var-decl name='tableTag' type-id='type-id-243' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='46' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='type-id-244' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='60' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='fontRevision' type-id='type-id-244' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='62' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='checkSumAdjustment' type-id='type-id-235' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='63' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <var-decl name='magicNumber' type-id='type-id-235' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='66' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='128'>
          <var-decl name='flags' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='67' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='144'>
          <var-decl name='unitsPerEm' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='160'>
          <var-decl name='created' type-id='type-id-248' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='116' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='224'>
          <var-decl name='modified' type-id='type-id-248' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='118' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='288'>
          <var-decl name='xMin' type-id='type-id-249' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='120' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='304'>
          <var-decl name='yMin' type-id='type-id-249' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='121' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='320'>
          <var-decl name='xMax' type-id='type-id-249' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='122' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='336'>
          <var-decl name='yMax' type-id='type-id-249' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='123' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='352'>
          <var-decl name='macStyle' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='124' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='368'>
          <var-decl name='lowestRecPPEM' type-id='type-id-227' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='132' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='384'>
          <var-decl name='fontDirectionHint' type-id='type-id-249' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='133' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='400'>
          <var-decl name='indexToLocFormat' type-id='type-id-249' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='139' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='416'>
          <var-decl name='glyphDataFormat' type-id='type-id-249' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='140' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='142' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='142' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='get_upem' mangled-name='_ZNK2OT4head8get_upemEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-210' is-artificial='yes'/>
            <return type-id='type-id-10'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT4head8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-250' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_142' mangled-name='_ZNK2OT4head31_instance_assertion_on_line_142Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-210' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='LONGDATETIME' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='647' column='1' id='type-id-248'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='major' type-id='type-id-251' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='653' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='minor' type-id='type-id-235' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='654' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='656' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='656' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT12LONGDATETIME8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='648' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-252' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_656' mangled-name='_ZNK2OT12LONGDATETIME31_instance_assertion_on_line_656Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='656' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-253' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IntType&lt;int, 4u&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-254'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-255' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='set' mangled-name='_ZN2OT7IntTypeIiLj4EE3setEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-256' is-artificial='yes'/>
            <parameter type-id='type-id-4'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator int' mangled-name='_ZNK2OT7IntTypeIiLj4EEcviEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-257' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator==' mangled-name='_ZNK2OT7IntTypeIiLj4EEeqERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-257' is-artificial='yes'/>
            <parameter type-id='type-id-258'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator!=' mangled-name='_ZNK2OT7IntTypeIiLj4EEneERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-257' is-artificial='yes'/>
            <parameter type-id='type-id-258'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='cmp' mangled-name='_ZN2OT7IntTypeIiLj4EE3cmpEPKS1_S3_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='618' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-257'/>
            <parameter type-id='type-id-257'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='cmp' mangled-name='_ZNK2OT7IntTypeIiLj4EE3cmpES1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-257' is-artificial='yes'/>
            <parameter type-id='type-id-254'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='cmp' mangled-name='_ZNK2OT7IntTypeIiLj4EE3cmpEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-257' is-artificial='yes'/>
            <parameter type-id='type-id-4'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT7IntTypeIiLj4EE8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-256' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_628' mangled-name='_ZNK2OT7IntTypeIiLj4EE31_instance_assertion_on_line_628Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-257' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BEInt&lt;int, 4&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-255'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-148' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='607' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='set' mangled-name='_ZN2OT5BEIntIiLi4EE3setEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='585' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-259' is-artificial='yes'/>
            <parameter type-id='type-id-4'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator int' mangled-name='_ZNK2OT5BEIntIiLi4EEcviEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='592' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-260' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator==' mangled-name='_ZNK2OT5BEIntIiLi4EEeqERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='599' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-260' is-artificial='yes'/>
            <parameter type-id='type-id-261'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator!=' mangled-name='_ZNK2OT5BEIntIiLi4EEneERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='606' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-260' is-artificial='yes'/>
            <parameter type-id='type-id-261'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='LONG' type-id='type-id-254' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='635' column='1' id='type-id-251'/>
      <class-decl name='IntType&lt;short int, 2u&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-262'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-263' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='set' mangled-name='_ZN2OT7IntTypeIsLj2EE3setEs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-264' is-artificial='yes'/>
            <parameter type-id='type-id-151'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator short int' mangled-name='_ZNK2OT7IntTypeIsLj2EEcvsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-265' is-artificial='yes'/>
            <return type-id='type-id-151'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator==' mangled-name='_ZNK2OT7IntTypeIsLj2EEeqERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-265' is-artificial='yes'/>
            <parameter type-id='type-id-266'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator!=' mangled-name='_ZNK2OT7IntTypeIsLj2EEneERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-265' is-artificial='yes'/>
            <parameter type-id='type-id-266'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='cmp' mangled-name='_ZN2OT7IntTypeIsLj2EE3cmpEPKS1_S3_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='618' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-265'/>
            <parameter type-id='type-id-265'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='cmp' mangled-name='_ZNK2OT7IntTypeIsLj2EE3cmpES1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-265' is-artificial='yes'/>
            <parameter type-id='type-id-262'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='cmp' mangled-name='_ZNK2OT7IntTypeIsLj2EE3cmpEs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-265' is-artificial='yes'/>
            <parameter type-id='type-id-151'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT7IntTypeIsLj2EE8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-264' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_628' mangled-name='_ZNK2OT7IntTypeIsLj2EE31_instance_assertion_on_line_628Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-265' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BEInt&lt;short int, 2&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-263'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-195' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='554' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='set' mangled-name='_ZN2OT5BEIntIsLi2EE3setEs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='538' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-267' is-artificial='yes'/>
            <parameter type-id='type-id-151'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator short int' mangled-name='_ZNK2OT5BEIntIsLi2EEcvsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-268' is-artificial='yes'/>
            <return type-id='type-id-151'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator==' mangled-name='_ZNK2OT5BEIntIsLi2EEeqERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='548' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-268' is-artificial='yes'/>
            <parameter type-id='type-id-269'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator!=' mangled-name='_ZNK2OT5BEIntIsLi2EEneERKS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='553' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-268' is-artificial='yes'/>
            <parameter type-id='type-id-269'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='SHORT' type-id='type-id-262' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='633' column='1' id='type-id-249'/>
      <class-decl name='ArrayOf&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='793' column='1' id='type-id-270'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='len' type-id='type-id-221' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='892' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='array' type-id='type-id-271' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='893' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='895' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sub_array' mangled-name='_ZNK2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E9sub_arrayEjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='794' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-214' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <parameter type-id='type-id-57'/>
            <return type-id='type-id-215'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator[]' mangled-name='_ZNK2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_EixEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='806' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-214' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-272'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator[]' mangled-name='_ZN2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_EixEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='811' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-273' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-274'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='get_size' mangled-name='_ZNK2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E8get_sizeEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='815' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-214' is-artificial='yes'/>
            <return type-id='type-id-10'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='serialize' mangled-name='_ZN2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E9serializeEPNS_22hb_serialize_context_tEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='818' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-273' is-artificial='yes'/>
            <parameter type-id='type-id-219'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='serialize' mangled-name='_ZN2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E9serializeEPNS_22hb_serialize_context_tERNS_8SupplierIS5_EEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='828' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-273' is-artificial='yes'/>
            <parameter type-id='type-id-219'/>
            <parameter type-id='type-id-275'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='840' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-273' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E8sanitizeEPNS_21hb_sanitize_context_tEPv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='855' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-273' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <parameter type-id='type-id-20'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='sanitize_shallow' mangled-name='_ZN2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E16sanitize_shallowEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='886' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-273' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_895' mangled-name='_ZNK2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E31_instance_assertion_on_line_895Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='895' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-214' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_compiles_assertion_on_line_895' mangled-name='_ZNK2OT7ArrayOfINS_8OffsetToINS_11OffsetTableENS_7IntTypeIjLj4EEEEES4_E31_compiles_assertion_on_line_895Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='895' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-214' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Supplier&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-276'/>
      <class-decl name='TTCHeaderVersion1' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='127' column='1' id='type-id-277'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='ttcTag' type-id='type-id-226' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='139' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='version' type-id='type-id-244' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='140' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='table' type-id='type-id-270' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='143' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='146' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='get_face_count' mangled-name='_ZNK2OT17TTCHeaderVersion114get_face_countEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-278' is-artificial='yes'/>
            <return type-id='type-id-10'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='get_face' mangled-name='_ZNK2OT17TTCHeaderVersion18get_faceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-278' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-279'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT17TTCHeaderVersion18sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-280' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_instance_assertion_on_line_146' mangled-name='_ZNK2OT17TTCHeaderVersion131_instance_assertion_on_line_146Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-278' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_compiles_assertion_on_line_146' mangled-name='_ZNK2OT17TTCHeaderVersion131_compiles_assertion_on_line_146Ev' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-278' is-artificial='yes'/>
            <return type-id='type-id-5'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='OpenTypeFontFace' type-id='type-id-225' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='119' column='1' id='type-id-281'/>
      <class-decl name='TTCHeader' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='150' column='1' id='type-id-282'>
        <member-type access='protected'>
          <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='183' column='1' id='type-id-283'>
            <member-type access='private'>
              <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='184' column='1' id='type-id-284'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='ttcTag' type-id='type-id-226' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='185' column='1'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='32'>
                  <var-decl name='version' type-id='type-id-244' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='186' column='1'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='private'>
              <var-decl name='header' type-id='type-id-284' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='188' column='1'/>
            </data-member>
            <data-member access='private'>
              <var-decl name='version1' type-id='type-id-277' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='189' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='u' type-id='type-id-283' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='190' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='get_face_count' mangled-name='_ZNK2OT9TTCHeader14get_face_countEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-285' is-artificial='yes'/>
            <return type-id='type-id-10'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='get_face' mangled-name='_ZNK2OT9TTCHeader8get_faceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-285' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-279'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='sanitize' mangled-name='_ZN2OT9TTCHeader8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-286' is-artificial='yes'/>
            <parameter type-id='type-id-203'/>
            <return type-id='type-id-7'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Sanitizer&lt;OT::maxp&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='type-id-287'>
        <member-function access='public' static='yes'>
          <function-decl name='sanitize' mangled-name='_ZN2OT9SanitizerINS_4maxpEE8sanitizeEP9hb_blob_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='lock_instance' mangled-name='_ZN2OT9SanitizerINS_4maxpEE13lock_instanceEP9hb_blob_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-209'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Sanitizer&lt;OT::head&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='type-id-288'>
        <member-function access='public' static='yes'>
          <function-decl name='sanitize' mangled-name='_ZN2OT9SanitizerINS_4headEE8sanitizeEP9hb_blob_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='lock_instance' mangled-name='_ZN2OT9SanitizerINS_4headEE13lock_instanceEP9hb_blob_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-210'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Sanitizer&lt;OT::OpenTypeFontFile&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='type-id-289'>
        <member-function access='public' static='yes'>
          <function-decl name='sanitize' mangled-name='_ZN2OT9SanitizerINS_16OpenTypeFontFileEE8sanitizeEP9hb_blob_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='lock_instance' mangled-name='_ZN2OT9SanitizerINS_16OpenTypeFontFileEE13lock_instanceEP9hb_blob_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-290'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='OpenTypeFontFile' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='199' column='1' id='type-id-291'>
        <member-type access='protected'>
          <union-decl name='__anonymous_union__' size-in-bits='224' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='250' column='1' id='type-id-292'>
            <data-member access='private'>
              <var-decl name='tag' type-id='type-id-226' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='251' column='1'/>
            </data-member>
            <data-member access='private'>
              <var-decl name='fontFace' type-id='type-id-281' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='252' column='1'/>
            </data-member>
            <data-member access='private'>
              <var-decl name='ttcHeader' type-id='type-id-282' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='253' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='tableTag' type-id='type-id-243' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='200' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='CFFTag' type-id='type-id-243' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='202' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TrueTypeTag' type-id='type-id-243' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='203' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
