<abi-corpus version='2.1' soname='liboffloadmic_host.so.5'>
  <elf-needed>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='ORSLRelease' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReservePartial' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLTryReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_find_associated_mic_memory' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_physical_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_number_of_devices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='omp_init_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_init_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_default_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_dynamic_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_nested_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_num_threads_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_schedule_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_test_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_test_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_unset_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_unset_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZN3COI13EngineGetInfoE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI18PipelineSetCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI20PipelineClearCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI21EventRegisterCallbackE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine12m_func_namesE' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine14c_signal_namesE' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream11all_streamsE' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream13m_stream_lockE' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream15m_streams_countE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_major_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_minor_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_is_attached' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_exe_name' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_id' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_so_pid' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_func_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_init_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_var_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_vtable_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/cean_util.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/coi/coi_client.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32768' id='type-id-3'>
      <subrange length='1024' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='128' id='type-id-7'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='8160' id='type-id-10'>
      <subrange length='255' type-id='type-id-4' id='type-id-11'/>
    </array-type-def>
    <class-decl name='coievent' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='63' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opaque' type-id='type-id-7' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='COI_ISA_TYPE' naming-typedef-id='type-id-13' linkage-name='12COI_ISA_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIEngine_common.h' line='70' column='1' id='type-id-14'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_ISA_INVALID' value='0'/>
      <enumerator name='COI_ISA_x86_64' value='1'/>
      <enumerator name='COI_ISA_MIC' value='2'/>
      <enumerator name='COI_ISA_KNF' value='3'/>
      <enumerator name='COI_ISA_KNC' value='4'/>
    </enum-decl>
    <enum-decl name='COIRESULT' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIResult_common.h' line='57' column='1' id='type-id-16'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_SUCCESS' value='0'/>
      <enumerator name='COI_ERROR' value='1'/>
      <enumerator name='COI_NOT_INITIALIZED' value='2'/>
      <enumerator name='COI_ALREADY_INITIALIZED' value='3'/>
      <enumerator name='COI_ALREADY_EXISTS' value='4'/>
      <enumerator name='COI_DOES_NOT_EXIST' value='5'/>
      <enumerator name='COI_INVALID_POINTER' value='6'/>
      <enumerator name='COI_OUT_OF_RANGE' value='7'/>
      <enumerator name='COI_NOT_SUPPORTED' value='8'/>
      <enumerator name='COI_TIME_OUT_REACHED' value='9'/>
      <enumerator name='COI_MEMORY_OVERLAP' value='10'/>
      <enumerator name='COI_ARGUMENT_MISMATCH' value='11'/>
      <enumerator name='COI_SIZE_MISMATCH' value='12'/>
      <enumerator name='COI_OUT_OF_MEMORY' value='13'/>
      <enumerator name='COI_INVALID_HANDLE' value='14'/>
      <enumerator name='COI_RETRY' value='15'/>
      <enumerator name='COI_RESOURCE_EXHAUSTED' value='16'/>
      <enumerator name='COI_ALREADY_LOCKED' value='17'/>
      <enumerator name='COI_NOT_LOCKED' value='18'/>
      <enumerator name='COI_MISSING_DEPENDENCY' value='19'/>
      <enumerator name='COI_UNDEFINED_SYMBOL' value='20'/>
      <enumerator name='COI_PENDING' value='21'/>
      <enumerator name='COI_BINARY_AND_HARDWARE_MISMATCH' value='22'/>
      <enumerator name='COI_PROCESS_DIED' value='23'/>
      <enumerator name='COI_INVALID_FILE' value='24'/>
      <enumerator name='COI_EVENT_CANCELED' value='25'/>
      <enumerator name='COI_VERSION_MISMATCH' value='26'/>
      <enumerator name='COI_BAD_PORT' value='27'/>
      <enumerator name='COI_AUTHENTICATION_FAILURE' value='28'/>
      <enumerator name='COI_NUM_RESULTS' value='29'/>
    </enum-decl>
    <enum-decl name='COI_BUFFER_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='65' column='1' id='type-id-17'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_BUFFER_NORMAL' value='1'/>
      <enumerator name='COI_BUFFER_RESERVED_1' value='2'/>
      <enumerator name='COI_BUFFER_RESERVED_2' value='3'/>
      <enumerator name='COI_BUFFER_PINNED' value='4'/>
      <enumerator name='COI_BUFFER_OPENCL' value='5'/>
    </enum-decl>
    <enum-decl name='COI_MAP_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='183' column='1' id='type-id-18'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_MAP_READ_WRITE' value='1'/>
      <enumerator name='COI_MAP_READ_ONLY' value='2'/>
      <enumerator name='COI_MAP_WRITE_ENTIRE_BUFFER' value='3'/>
    </enum-decl>
    <enum-decl name='COI_COPY_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='240' column='1' id='type-id-19'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_COPY_UNSPECIFIED' value='0'/>
      <enumerator name='COI_COPY_USE_DMA' value='1'/>
      <enumerator name='COI_COPY_USE_CPU' value='2'/>
      <enumerator name='COI_COPY_UNSPECIFIED_MOVE_ENTIRE' value='3'/>
      <enumerator name='COI_COPY_USE_DMA_MOVE_ENTIRE' value='4'/>
      <enumerator name='COI_COPY_USE_CPU_MOVE_ENTIRE' value='5'/>
    </enum-decl>
    <enum-decl name='COI_BUFFER_STATE' naming-typedef-id='type-id-20' linkage-name='16COI_BUFFER_STATE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='335' column='1' id='type-id-21'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_BUFFER_VALID' value='0'/>
      <enumerator name='COI_BUFFER_INVALID' value='1'/>
      <enumerator name='COI_BUFFER_VALID_MAY_DROP' value='2'/>
      <enumerator name='COI_BUFFER_RESERVED' value='3'/>
    </enum-decl>
    <enum-decl name='COI_BUFFER_MOVE_FLAG' naming-typedef-id='type-id-22' linkage-name='20COI_BUFFER_MOVE_FLAG' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='359' column='1' id='type-id-23'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_BUFFER_MOVE' value='0'/>
      <enumerator name='COI_BUFFER_NO_MOVE' value='1'/>
    </enum-decl>
    <enum-decl name='coi_eng_misc' naming-typedef-id='type-id-24' linkage-name='12coi_eng_misc' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='70' column='1' id='type-id-25'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_ENG_ECC_DISABLED' value='0'/>
      <enumerator name='COI_ENG_ECC_ENABLED' value='1'/>
      <enumerator name='COI_ENG_ECC_UNKNOWN' value='2'/>
    </enum-decl>
    <class-decl name='COI_ENGINE_INFO' size-in-bits='41472' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='83' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='DriverVersion' type-id='type-id-10' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8160'>
        <var-decl name='ISA' type-id='type-id-13' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='NumCores' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8224'>
        <var-decl name='MiscFlags' type-id='type-id-24' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='NumThreads' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8288'>
        <var-decl name='CoreMaxFrequency' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='Load' type-id='type-id-3' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41088'>
        <var-decl name='PhysicalMemory' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41152'>
        <var-decl name='PhysicalMemoryFree' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41216'>
        <var-decl name='SwapMemory' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41280'>
        <var-decl name='SwapMemoryFree' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41344'>
        <var-decl name='VendorId' type-id='type-id-29' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41360'>
        <var-decl name='DeviceId' type-id='type-id-29' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41376'>
        <var-decl name='SubSystemId' type-id='type-id-29' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41392'>
        <var-decl name='BoardStepping' type-id='type-id-29' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41408'>
        <var-decl name='BoardSKU' type-id='type-id-29' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='COI_ACCESS_FLAGS' filepath='../../../gcc/liboffloadmic/include/coi/source/COIPipeline_source.h' line='69' column='1' id='type-id-30'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='COI_SINK_READ' value='1'/>
      <enumerator name='COI_SINK_WRITE' value='2'/>
      <enumerator name='COI_SINK_WRITE_ENTIRE' value='3'/>
      <enumerator name='COI_SINK_READ_ADDREF' value='4'/>
      <enumerator name='COI_SINK_WRITE_ADDREF' value='5'/>
      <enumerator name='COI_SINK_WRITE_ENTIRE_ADDREF' value='6'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-62'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-63'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-64'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-65'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-66'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-67'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-68'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-72'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-139'/>
    <class-decl name='coibuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-49'/>
    <class-decl name='coiengine' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-51'/>
    <class-decl name='coifunction' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-53'/>
    <class-decl name='coilibrary' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-55'/>
    <class-decl name='coimapinst' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-57'/>
    <class-decl name='coipipeline' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-59'/>
    <class-decl name='coiprocess' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-61'/>
    <typedef-decl name='COIPROCESS' type-id='type-id-62' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='65' column='1' id='type-id-45'/>
    <typedef-decl name='COIPIPELINE' type-id='type-id-60' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='66' column='1' id='type-id-43'/>
    <typedef-decl name='COIFUNCTION' type-id='type-id-54' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='67' column='1' id='type-id-37'/>
    <typedef-decl name='COIENGINE' type-id='type-id-52' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='68' column='1' id='type-id-33'/>
    <typedef-decl name='COIEVENT' type-id='type-id-12' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='69' column='1' id='type-id-35'/>
    <typedef-decl name='COIBUFFER' type-id='type-id-50' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='70' column='1' id='type-id-31'/>
    <typedef-decl name='COILIBRARY' type-id='type-id-56' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='71' column='1' id='type-id-39'/>
    <typedef-decl name='COIMAPINSTANCE' type-id='type-id-58' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='72' column='1' id='type-id-41'/>
    <typedef-decl name='COI_ISA_TYPE' type-id='type-id-14' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIEngine_common.h' line='78' column='1' id='type-id-13'/>
    <typedef-decl name='COIRESULT' type-id='type-id-16' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIResult_common.h' line='122' column='1' id='type-id-140'/>
    <typedef-decl name='COI_BUFFER_TYPE' type-id='type-id-17' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='87' column='1' id='type-id-141'/>
    <typedef-decl name='COI_MAP_TYPE' type-id='type-id-18' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='204' column='1' id='type-id-142'/>
    <typedef-decl name='COI_COPY_TYPE' type-id='type-id-19' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='265' column='1' id='type-id-143'/>
    <typedef-decl name='COI_BUFFER_STATE' type-id='type-id-21' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='342' column='1' id='type-id-20'/>
    <typedef-decl name='COI_BUFFER_MOVE_FLAG' type-id='type-id-23' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='362' column='1' id='type-id-22'/>
    <typedef-decl name='coi_eng_misc' type-id='type-id-25' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='74' column='1' id='type-id-24'/>
    <typedef-decl name='COI_ENGINE_INFO' type-id='type-id-26' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='133' column='1' id='type-id-47'/>
    <typedef-decl name='COI_ACCESS_FLAGS' type-id='type-id-30' filepath='../../../gcc/liboffloadmic/include/coi/source/COIPipeline_source.h' line='97' column='1' id='type-id-69'/>
    <namespace-decl name='COI'>
      <var-decl name='is_available' type-id='type-id-144' mangled-name='_ZN3COI12is_availableE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='60' column='1'/>
      <var-decl name='EngineGetCount' type-id='type-id-123' mangled-name='_ZN3COI14EngineGetCountE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='63' column='1'/>
      <var-decl name='EngineGetHandle' type-id='type-id-121' mangled-name='_ZN3COI15EngineGetHandleE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='64' column='1'/>
      <var-decl name='ProcessCreateFromMemory' type-id='type-id-95' mangled-name='_ZN3COI23ProcessCreateFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='66' column='1'/>
      <var-decl name='ProcessCreateFromFile' type-id='type-id-93' mangled-name='_ZN3COI21ProcessCreateFromFileE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='74' column='1'/>
      <var-decl name='ProcessSetCacheSize' type-id='type-id-115' mangled-name='_ZN3COI19ProcessSetCacheSizeE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='82' column='1'/>
      <var-decl name='ProcessDestroy' type-id='type-id-109' mangled-name='_ZN3COI14ProcessDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='85' column='1'/>
      <var-decl name='ProcessGetFunctionHandles' type-id='type-id-111' mangled-name='_ZN3COI25ProcessGetFunctionHandlesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='87' column='1'/>
      <var-decl name='ProcessLoadLibraryFromMemory' type-id='type-id-119' mangled-name='_ZN3COI28ProcessLoadLibraryFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='90' column='1'/>
      <var-decl name='ProcessUnloadLibrary' type-id='type-id-107' mangled-name='_ZN3COI20ProcessUnloadLibraryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='100' column='1'/>
      <var-decl name='ProcessRegisterLibraries' type-id='type-id-127' mangled-name='_ZN3COI24ProcessRegisterLibrariesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='103' column='1'/>
      <var-decl name='PipelineCreate' type-id='type-id-117' mangled-name='_ZN3COI14PipelineCreateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='109' column='1'/>
      <var-decl name='PipelineDestroy' type-id='type-id-103' mangled-name='_ZN3COI15PipelineDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='111' column='1'/>
      <var-decl name='PipelineRunFunction' type-id='type-id-105' mangled-name='_ZN3COI19PipelineRunFunctionE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='112' column='1'/>
      <var-decl name='BufferCreate' type-id='type-id-131' mangled-name='_ZN3COI12BufferCreateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='119' column='1'/>
      <var-decl name='BufferCreateFromMemory' type-id='type-id-131' mangled-name='_ZN3COI22BufferCreateFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='122' column='1'/>
      <var-decl name='BufferDestroy' type-id='type-id-77' mangled-name='_ZN3COI13BufferDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='126' column='1'/>
      <var-decl name='BufferMap' type-id='type-id-85' mangled-name='_ZN3COI9BufferMapE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='127' column='1'/>
      <var-decl name='BufferUnmap' type-id='type-id-101' mangled-name='_ZN3COI11BufferUnmapE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='130' column='1'/>
      <var-decl name='BufferWrite' type-id='type-id-87' mangled-name='_ZN3COI11BufferWriteE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='132' column='1'/>
      <var-decl name='BufferRead' type-id='type-id-87' mangled-name='_ZN3COI10BufferReadE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='135' column='1'/>
      <var-decl name='BufferReadMultiD' type-id='type-id-89' mangled-name='_ZN3COI16BufferReadMultiDE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='138' column='1'/>
      <var-decl name='BufferWriteMultiD' type-id='type-id-83' mangled-name='_ZN3COI17BufferWriteMultiDE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='141' column='1'/>
      <var-decl name='BufferCopy' type-id='type-id-79' mangled-name='_ZN3COI10BufferCopyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='145' column='1'/>
      <var-decl name='BufferGetSinkAddress' type-id='type-id-91' mangled-name='_ZN3COI20BufferGetSinkAddressE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='148' column='1'/>
      <var-decl name='BufferSetState' type-id='type-id-81' mangled-name='_ZN3COI14BufferSetStateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='149' column='1'/>
      <var-decl name='EventWait' type-id='type-id-125' mangled-name='_ZN3COI9EventWaitE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='153' column='1'/>
      <var-decl name='PerfGetCycleFrequency' type-id='type-id-135' mangled-name='_ZN3COI21PerfGetCycleFrequencyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='156' column='1'/>
      <var-decl name='ProcessConfigureDMA' type-id='type-id-129' mangled-name='_ZN3COI19ProcessConfigureDMAE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='158' column='1'/>
      <var-decl name='PipelineClearCPUMask' type-id='type-id-133' mangled-name='_ZN3COI20PipelineClearCPUMaskE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='160' column='1' elf-symbol-id='_ZN3COI20PipelineClearCPUMaskE'/>
      <var-decl name='PipelineSetCPUMask' type-id='type-id-113' mangled-name='_ZN3COI18PipelineSetCPUMaskE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='162' column='1' elf-symbol-id='_ZN3COI18PipelineSetCPUMaskE'/>
      <var-decl name='EngineGetInfo' type-id='type-id-97' mangled-name='_ZN3COI13EngineGetInfoE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='164' column='1' elf-symbol-id='_ZN3COI13EngineGetInfoE'/>
      <var-decl name='EventRegisterCallback' type-id='type-id-99' mangled-name='_ZN3COI21EventRegisterCallbackE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='166' column='1' elf-symbol-id='_ZN3COI21EventRegisterCallbackE'/>
    </namespace-decl>
    <typedef-decl name='int8_t' type-id='type-id-145' filepath='/usr/include/stdint.h' line='36' column='1' id='type-id-74'/>
    <typedef-decl name='int32_t' type-id='type-id-146' filepath='/usr/include/stdint.h' line='38' column='1' id='type-id-147'/>
    <typedef-decl name='uint8_t' type-id='type-id-1' filepath='/usr/include/stdint.h' line='48' column='1' id='type-id-148'/>
    <typedef-decl name='uint16_t' type-id='type-id-149' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-29'/>
    <typedef-decl name='uint32_t' type-id='type-id-2' filepath='/usr/include/stdint.h' line='51' column='1' id='type-id-27'/>
    <function-type size-in-bits='64' id='type-id-76'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-78'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-80'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-82'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-84'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-86'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-88'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-90'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-96'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-98'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-100'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-102'>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-104'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-106'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-136'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-110'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-112'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-114'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-116'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-118'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-120'>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-122'>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-136'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-124'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-136'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-126'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-130'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-132'>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-140'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-134'>
      <return type-id='type-id-28'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-138'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-154'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/compiler_if_host.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='128' id='type-id-156'>
      <subrange length='1' type-id='type-id-4' id='type-id-157'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-158' size-in-bits='320' id='type-id-159'>
      <subrange length='1' type-id='type-id-4' id='type-id-157'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-160' size-in-bits='2560' id='type-id-161'>
      <subrange length='20' type-id='type-id-4' id='type-id-162'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-160' size-in-bits='1152' id='type-id-163'>
      <subrange length='9' type-id='type-id-4' id='type-id-164'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-165' size-in-bits='infinite' id='type-id-166'>
      <subrange length='infinite' type-id='type-id-4' id='type-id-167'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='448' id='type-id-168'>
      <subrange length='7' type-id='type-id-4' id='type-id-169'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='2048' id='type-id-170'>
      <subrange length='32' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='448' id='type-id-172'>
      <subrange length='7' type-id='type-id-4' id='type-id-169'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='832' id='type-id-173'>
      <subrange length='104' type-id='type-id-4' id='type-id-174'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-175'>
      <subrange length='16' type-id='type-id-4' id='type-id-176'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' id='type-id-177'>
      <subrange length='24' type-id='type-id-4' id='type-id-178'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-179'>
      <subrange length='40' type-id='type-id-4' id='type-id-180'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' id='type-id-181'>
      <subrange length='8' type-id='type-id-4' id='type-id-182'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='1024' id='type-id-183'>
      <subrange length='16' type-id='type-id-4' id='type-id-176'/>
    </array-type-def>
    <class-decl name='Dim_Desc' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='38' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lindex' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lower' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='upper' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stride' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Arr_Desc' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='46' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rank' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dim' type-id='type-id-159' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='CeanReadDim' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='52' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='CeanReadRanges' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='58' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arr_desc' type-id='type-id-187' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ptr' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current_number' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='range_max_number' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='range_size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_noncont_ind' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='init_offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='Dim' type-id='type-id-156' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='error_types' naming-typedef-id='type-id-188' linkage-name='11error_types' filepath='../../../gcc/liboffloadmic/runtime/liboffload_error_codes.h' line='38' column='1' id='type-id-189'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='c_device_is_not_available' value='0'/>
      <enumerator name='c_invalid_device_number' value='1'/>
      <enumerator name='c_offload1' value='2'/>
      <enumerator name='c_unknown_var_type' value='3'/>
      <enumerator name='c_send_func_ptr' value='4'/>
      <enumerator name='c_receive_func_ptr' value='5'/>
      <enumerator name='c_malloc' value='6'/>
      <enumerator name='c_offload_malloc' value='7'/>
      <enumerator name='c_invalid_env_var_value' value='8'/>
      <enumerator name='c_invalid_env_var_int_value' value='9'/>
      <enumerator name='c_invalid_env_report_value' value='10'/>
      <enumerator name='c_offload_signaled1' value='11'/>
      <enumerator name='c_offload_signaled2' value='12'/>
      <enumerator name='c_myotarget_checkresult' value='13'/>
      <enumerator name='c_myowrapper_checkresult' value='14'/>
      <enumerator name='c_offload_descriptor_offload' value='15'/>
      <enumerator name='c_merge_var_descs1' value='16'/>
      <enumerator name='c_merge_var_descs2' value='17'/>
      <enumerator name='c_mic_parse_env_var_list1' value='18'/>
      <enumerator name='c_mic_parse_env_var_list2' value='19'/>
      <enumerator name='c_mic_process_exit_ret' value='20'/>
      <enumerator name='c_mic_process_exit_sig' value='21'/>
      <enumerator name='c_mic_process_exit' value='22'/>
      <enumerator name='c_mic_init3' value='23'/>
      <enumerator name='c_mic_init4' value='24'/>
      <enumerator name='c_mic_init5' value='25'/>
      <enumerator name='c_mic_init6' value='26'/>
      <enumerator name='c_no_static_var_data' value='27'/>
      <enumerator name='c_no_ptr_data' value='28'/>
      <enumerator name='c_get_engine_handle' value='29'/>
      <enumerator name='c_get_engine_index' value='30'/>
      <enumerator name='c_process_create' value='31'/>
      <enumerator name='c_process_set_cache_size' value='32'/>
      <enumerator name='c_process_get_func_handles' value='33'/>
      <enumerator name='c_process_wait_shutdown' value='34'/>
      <enumerator name='c_process_proxy_flush' value='35'/>
      <enumerator name='c_load_library' value='36'/>
      <enumerator name='c_pipeline_create' value='37'/>
      <enumerator name='c_pipeline_run_func' value='38'/>
      <enumerator name='c_pipeline_start_run_funcs' value='39'/>
      <enumerator name='c_buf_create' value='40'/>
      <enumerator name='c_buf_create_out_of_mem' value='41'/>
      <enumerator name='c_buf_create_from_mem' value='42'/>
      <enumerator name='c_buf_destroy' value='43'/>
      <enumerator name='c_buf_map' value='44'/>
      <enumerator name='c_buf_unmap' value='45'/>
      <enumerator name='c_buf_read' value='46'/>
      <enumerator name='c_buf_write' value='47'/>
      <enumerator name='c_buf_copy' value='48'/>
      <enumerator name='c_buf_get_address' value='49'/>
      <enumerator name='c_buf_add_ref' value='50'/>
      <enumerator name='c_buf_release_ref' value='51'/>
      <enumerator name='c_buf_set_state' value='52'/>
      <enumerator name='c_event_wait' value='53'/>
      <enumerator name='c_zero_or_neg_ptr_len' value='54'/>
      <enumerator name='c_zero_or_neg_transfer_size' value='55'/>
      <enumerator name='c_bad_ptr_mem_alloc' value='56'/>
      <enumerator name='c_bad_ptr_mem_range' value='57'/>
      <enumerator name='c_different_src_and_dstn_sizes' value='58'/>
      <enumerator name='c_ranges_dont_match' value='59'/>
      <enumerator name='c_destination_is_over' value='60'/>
      <enumerator name='c_slice_of_noncont_array' value='61'/>
      <enumerator name='c_non_contiguous_dope_vector' value='62'/>
      <enumerator name='c_pointer_array_mismatch' value='63'/>
      <enumerator name='c_omp_invalid_device_num_env' value='64'/>
      <enumerator name='c_omp_invalid_device_num' value='65'/>
      <enumerator name='c_unknown_binary_type' value='66'/>
      <enumerator name='c_multiple_target_exes' value='67'/>
      <enumerator name='c_no_target_exe' value='68'/>
      <enumerator name='c_incorrect_affinity' value='69'/>
      <enumerator name='c_cannot_set_affinity' value='70'/>
      <enumerator name='c_report_host' value='71'/>
      <enumerator name='c_report_target' value='72'/>
      <enumerator name='c_report_title' value='73'/>
      <enumerator name='c_report_from_file' value='74'/>
      <enumerator name='c_report_file' value='75'/>
      <enumerator name='c_report_line' value='76'/>
      <enumerator name='c_report_tag' value='77'/>
      <enumerator name='c_report_seconds' value='78'/>
      <enumerator name='c_report_bytes' value='79'/>
      <enumerator name='c_report_mic' value='80'/>
      <enumerator name='c_report_cpu_time' value='81'/>
      <enumerator name='c_report_cpu_to_mic_data' value='82'/>
      <enumerator name='c_report_mic_time' value='83'/>
      <enumerator name='c_report_mic_to_cpu_data' value='84'/>
      <enumerator name='c_report_unknown_timer_node' value='85'/>
      <enumerator name='c_report_unknown_trace_node' value='86'/>
      <enumerator name='c_report_offload' value='87'/>
      <enumerator name='c_report_w_tag' value='88'/>
      <enumerator name='c_report_state' value='89'/>
      <enumerator name='c_report_start' value='90'/>
      <enumerator name='c_report_init' value='91'/>
      <enumerator name='c_report_logical_card' value='92'/>
      <enumerator name='c_report_physical_card' value='93'/>
      <enumerator name='c_report_register' value='94'/>
      <enumerator name='c_report_init_func' value='95'/>
      <enumerator name='c_report_create_buf_host' value='96'/>
      <enumerator name='c_report_create_buf_mic' value='97'/>
      <enumerator name='c_report_send_pointer_data' value='98'/>
      <enumerator name='c_report_sent_pointer_data' value='99'/>
      <enumerator name='c_report_gather_copyin_data' value='100'/>
      <enumerator name='c_report_copyin_data' value='101'/>
      <enumerator name='c_report_state_signal' value='102'/>
      <enumerator name='c_report_signal' value='103'/>
      <enumerator name='c_report_wait' value='104'/>
      <enumerator name='c_report_compute' value='105'/>
      <enumerator name='c_report_receive_pointer_data' value='106'/>
      <enumerator name='c_report_received_pointer_data' value='107'/>
      <enumerator name='c_report_start_target_func' value='108'/>
      <enumerator name='c_report_var' value='109'/>
      <enumerator name='c_report_scatter_copyin_data' value='110'/>
      <enumerator name='c_report_gather_copyout_data' value='111'/>
      <enumerator name='c_report_scatter_copyout_data' value='112'/>
      <enumerator name='c_report_copyout_data' value='113'/>
      <enumerator name='c_report_unregister' value='114'/>
      <enumerator name='c_report_destroy' value='115'/>
      <enumerator name='c_report_myoinit' value='116'/>
      <enumerator name='c_report_myoregister' value='117'/>
      <enumerator name='c_report_myofini' value='118'/>
      <enumerator name='c_report_mic_myo_shared' value='119'/>
      <enumerator name='c_report_mic_myo_fptr' value='120'/>
      <enumerator name='c_report_myosharedmalloc' value='121'/>
      <enumerator name='c_report_myosharedfree' value='122'/>
      <enumerator name='c_report_myosharedalignedmalloc' value='123'/>
      <enumerator name='c_report_myosharedalignedfree' value='124'/>
      <enumerator name='c_report_myoacquire' value='125'/>
      <enumerator name='c_report_myorelease' value='126'/>
      <enumerator name='c_report_myosupportsfeature' value='127'/>
      <enumerator name='c_report_myosharedarenacreate' value='128'/>
      <enumerator name='c_report_myosharedalignedarenamalloc' value='129'/>
      <enumerator name='c_report_myosharedalignedarenafree' value='130'/>
      <enumerator name='c_report_myoarenaacquire' value='131'/>
      <enumerator name='c_report_myoarenarelease' value='132'/>
      <enumerator name='c_coipipe_max_number' value='133'/>
      <enumerator name='c_in_with_preallocated' value='134'/>
      <enumerator name='c_report_no_host_exe' value='135'/>
      <enumerator name='c_report_path_buff_overflow' value='136'/>
      <enumerator name='c_create_pipeline_for_stream' value='137'/>
      <enumerator name='c_offload_no_stream' value='138'/>
      <enumerator name='c_get_engine_info' value='139'/>
      <enumerator name='c_clear_cpu_mask' value='140'/>
      <enumerator name='c_set_cpu_mask' value='141'/>
      <enumerator name='c_report_state_stream' value='142'/>
      <enumerator name='c_report_stream' value='143'/>
      <enumerator name='c_unload_library' value='144'/>
    </enum-decl>
    <enum-decl name='TARGET_TYPE' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='61' column='1' id='type-id-190'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='TARGET_NONE' value='0'/>
      <enumerator name='TARGET_HOST' value='1'/>
      <enumerator name='TARGET_MIC' value='2'/>
    </enum-decl>
    <enum-decl name='_Offload_result' naming-typedef-id='type-id-191' linkage-name='15_Offload_result' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='80' column='1' id='type-id-192'>
      <underlying-type type-id='type-id-15'/>
      <enumerator name='OFFLOAD_SUCCESS' value='0'/>
      <enumerator name='OFFLOAD_DISABLED' value='1'/>
      <enumerator name='OFFLOAD_UNAVAILABLE' value='2'/>
      <enumerator name='OFFLOAD_OUT_OF_MEMORY' value='3'/>
      <enumerator name='OFFLOAD_PROCESS_DIED' value='4'/>
      <enumerator name='OFFLOAD_ERROR' value='5'/>
    </enum-decl>
    <class-decl name='_Offload_status' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-193' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='89' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='result' type-id='type-id-191' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_number' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_sent' type-id='type-id-195' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_received' type-id='type-id-195' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='OffloadFlags' size-in-bits='32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='160' column='1' id='type-id-196'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='162' column='1' id='type-id-197'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='fortran_traceback' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='163' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='1'>
            <var-decl name='omp_async' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='flags' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='161' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='type-id-197' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='165' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='varDescFlags' size-in-bits='32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='217' column='1' id='type-id-198'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='218' column='1' id='type-id-199'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='is_static' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='220' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='1'>
            <var-decl name='is_static_dstn' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='222' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2'>
            <var-decl name='has_length' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='224' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='3'>
            <var-decl name='is_stack_buf' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='226' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='4'>
            <var-decl name='targetptr' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='228' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='5'>
            <var-decl name='preallocated' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='230' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='6'>
            <var-decl name='is_pointer' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='232' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='7'>
            <var-decl name='sink_addr' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='8'>
            <var-decl name='alloc_disp' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='237' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='9'>
            <var-decl name='is_noncont_src' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='239' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='10'>
            <var-decl name='is_noncont_dst' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='241' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='11'>
            <var-decl name='always_copy' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='244' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='12'>
            <var-decl name='always_delete' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='246' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='13'>
            <var-decl name='pin' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='248' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='250' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='VarDesc' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='254' column='1' id='type-id-200'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='256' column='1' id='type-id-201'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='257' column='1' id='type-id-202'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='dst' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='258' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='4'>
                <var-decl name='src' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='259' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='' type-id='type-id-202' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='bits' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='261' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__1' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='265' column='1' id='type-id-203'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='266' column='1' id='type-id-204'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='in' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='267' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='1'>
                <var-decl name='out' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='268' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='' type-id='type-id-204' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='bits' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='270' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='287' column='1' id='type-id-205'>
          <data-member access='public'>
            <var-decl name='count' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='291' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='disp' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='293' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='298' column='1' id='type-id-206'>
          <data-member access='public'>
            <var-decl name='alloc' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='299' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='ptr_arr_offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='300' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-201' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='direction' type-id='type-id-203' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='alloc_if' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='free_if' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='align' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mic_offset' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-198' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='into' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ptr' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='314' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='VarDesc2' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='318' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sname' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dname' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FunctionDescriptor' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='467' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='in_datalen' type-id='type-id-209' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='out_datalen' type-id='type-id-209' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='console_enabled' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='timer_enabled' type-id='type-id-148' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='offload_report_level' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offload_number' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='vars_num' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_offset' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data' type-id='type-id-166' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='495' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='MemRange' size-in-bits='128' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='46' column='1' id='type-id-210'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_start' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='76' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_length' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='77' column='1'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='overlaps' mangled-name='_ZNK8MemRange8overlapsERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange8overlapsERKS_'>
          <parameter type-id='type-id-211' is-artificial='yes'/>
          <parameter type-id='type-id-212'/>
          <return type-id='type-id-144'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='end' mangled-name='_ZNK8MemRange3endEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange3endEv'>
          <parameter type-id='type-id-211' is-artificial='yes'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='start' mangled-name='_ZNK8MemRange5startEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange5startEv'>
          <parameter type-id='type-id-211' is-artificial='yes'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-213' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-28'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8MemRangeC2EPKvm'>
          <parameter type-id='type-id-213' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-28'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='contains' mangled-name='_ZNK8MemRange8containsERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange8containsERKS_'>
          <parameter type-id='type-id-211' is-artificial='yes'/>
          <parameter type-id='type-id-212'/>
          <return type-id='type-id-144'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='length' mangled-name='_ZNK8MemRange6lengthEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange6lengthEv'>
          <parameter type-id='type-id-211' is-artificial='yes'/>
          <return type-id='type-id-28'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8MemRangeC2EPKvm'>
          <parameter type-id='type-id-213' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-28'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PtrData' size-in-bits='832' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='81' column='1' id='type-id-214'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='cpu_addr' type-id='type-id-215' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='cpu_buf' type-id='type-id-31' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='mic_buf' type-id='type-id-31' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='mic_addr' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='alloc_disp' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='mic_offset' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='is_static' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='alloc_ptr_data_lock' type-id='type-id-216' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='ref_count' type-id='type-id-217' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PtrDataTable' size-in-bits='704' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='163' column='1' id='type-id-218'>
      <member-type access='private'>
        <typedef-decl name='PtrSet' type-id='type-id-220' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='165' column='1' id='type-id-219'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='type-id-219' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_ptr_lock' type-id='type-id-216' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='204' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='AutoData' size-in-bits='192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='208' column='1' id='type-id-221'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='cpu_addr' type-id='type-id-215' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='ref_count' type-id='type-id-217' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='255' column='1'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='get_reference' mangled-name='_ZNK8AutoData13get_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8AutoData13get_referenceEv'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <return type-id='type-id-217'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nullify_reference' mangled-name='_ZN8AutoData17nullify_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData17nullify_referenceEv'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <return type-id='type-id-217'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_reference' mangled-name='_ZN8AutoData16remove_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData16remove_referenceEv'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <return type-id='type-id-217'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_reference' mangled-name='_ZN8AutoData13add_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData13add_referenceEv'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <return type-id='type-id-217'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='operator&lt;' mangled-name='_ZNK8AutoDataltERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8AutoDataltERKS_'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <parameter type-id='type-id-224'/>
          <return type-id='type-id-144'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='AutoData' mangled-name='_ZN8AutoDataC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-28'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='AutoData' mangled-name='_ZN8AutoDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoDataC2EPKvm'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-28'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TargetImage' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='262' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='origin' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='offset' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='279' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='TargetImage' mangled-name='_ZN11TargetImageC4EPKcPKvmS1_m' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-28'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='TargetImage' mangled-name='_ZN11TargetImageC2EPKcPKvmS1_m' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11TargetImageC2EPKcPKvmS1_m'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-28'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='DynLib' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='285' column='1' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lib' type-id='type-id-39' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='297' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='DynLib' mangled-name='_ZN6DynLibC4EPKcPKvP10coilibrary' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-228' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-39'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='DynLib' mangled-name='_ZN6DynLibC2EPKcPKvP10coilibrary' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6DynLibC2EPKcPKvP10coilibrary'>
          <parameter type-id='type-id-228' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-39'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PersistData' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='302' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stack_cpu_addr' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='routine_id' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='thread_id' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stack_ptr_data' type-id='type-id-230' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cpu_stack_addr' type-id='type-id-231' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Stream' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='326' column='1' id='type-id-232'>
      <member-type access='public'>
        <typedef-decl name='StreamMap' type-id='type-id-234' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='371' column='1' id='type-id-233'/>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='m_streams_count' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='all_streams' type-id='type-id-233' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='m_stream_lock' type-id='type-id-216' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_device' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_number_of_cpus' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_pipeline' type-id='type-id-43' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_last_offload' type-id='type-id-235' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_stream_cpus' type-id='type-id-236' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='389' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='get_device' mangled-name='_ZN6Stream10get_deviceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream10get_deviceEv'>
          <parameter type-id='type-id-237' is-artificial='yes'/>
          <return type-id='type-id-146'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Engine' size-in-bits='5504' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='395' column='1' id='type-id-238'>
      <member-type access='private'>
        <typedef-decl name='SignalMap' type-id='type-id-240' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='608' column='1' id='type-id-239'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_persist_list' type-id='type-id-241' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='563' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_index' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='611' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='m_physical_index' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='612' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_proc_number' type-id='type-id-217' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='615' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_process' type-id='type-id-45' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='618' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_ready' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='622' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_lock' type-id='type-id-216' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='623' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_images' type-id='type-id-242' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='626' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='m_ptr_set' type-id='type-id-218' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='629' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_targetptr_set' type-id='type-id-218' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='630' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2368'>
        <var-decl name='m_signal_map' type-id='type-id-239' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='633' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2752'>
        <var-decl name='m_signal_lock' type-id='type-id-216' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='634' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <var-decl name='m_stream_map' type-id='type-id-243' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='637' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3456'>
        <var-decl name='m_stream_lock' type-id='type-id-216' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='638' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3776'>
        <var-decl name='m_num_cores' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='639' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3808'>
        <var-decl name='m_num_threads' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='640' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3840'>
        <var-decl name='m_cpus' type-id='type-id-236' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='641' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4864'>
        <var-decl name='m_dyn_libs' type-id='type-id-244' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='644' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='m_func_names' type-id='type-id-172' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='659' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5056'>
        <var-decl name='m_funcs' type-id='type-id-168' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='662' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='c_signal_max' type-id='type-id-245' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='665' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='c_signal_names' type-id='type-id-170' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='666' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='get_physical_index' mangled-name='_ZNK6Engine18get_physical_indexEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='415' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-246' is-artificial='yes'/>
          <return type-id='type-id-146'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OffloadDescriptor' size-in-bits='2368' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='68' column='1' id='type-id-247'>
      <member-type access='public'>
        <enum-decl name='OmpAsyncLastEventType' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='71' column='1' id='type-id-248'>
          <underlying-type type-id='type-id-15'/>
          <enumerator name='c_last_not' value='0'/>
          <enumerator name='c_last_write' value='1'/>
          <enumerator name='c_last_read' value='2'/>
          <enumerator name='c_last_runfunc' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='VarExtra' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='216' column='1' id='type-id-249'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='src_data' type-id='type-id-230' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='dst_data' type-id='type-id-230' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='218' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='auto_data' type-id='type-id-223' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='219' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='cpu_disp' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='220' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='cpu_offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='221' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='alloc' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='222' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='read_rng_src' type-id='type-id-250' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='223' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='read_rng_dst' type-id='type-id-250' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='224' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='ptr_arr_offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='225' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='is_arr_ptr_el' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='226' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='608'>
            <var-decl name='omp_last_event_type' type-id='type-id-248' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='227' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ReadArrElements&lt;long int&gt;' size-in-bits='512' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='230' column='1' id='type-id-251'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='ranges' type-id='type-id-250' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='269' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='val' type-id='type-id-217' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='270' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='el_size' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='271' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='272' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='273' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='length_cur' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='274' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='384'>
            <var-decl name='is_empty' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='275' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='count' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='base' type-id='type-id-231' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='277' column='1'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='read_next' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlE9read_nextEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIlE9read_nextEb'>
              <parameter type-id='type-id-252' is-artificial='yes'/>
              <parameter type-id='type-id-144'/>
              <return type-id='type-id-144'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlEC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-252' is-artificial='yes'/>
              <return type-id='type-id-154'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlEC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIlEC2Ev'>
              <parameter type-id='type-id-252' is-artificial='yes'/>
              <return type-id='type-id-154'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ReadArrElements&lt;void*&gt;' size-in-bits='512' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='230' column='1' id='type-id-253'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='ranges' type-id='type-id-250' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='269' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='val' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='270' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='el_size' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='271' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='272' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='273' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='length_cur' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='274' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='384'>
            <var-decl name='is_empty' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='275' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='count' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='base' type-id='type-id-231' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='277' column='1'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='read_next' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvE9read_nextEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIPvE9read_nextEb'>
              <parameter type-id='type-id-254' is-artificial='yes'/>
              <parameter type-id='type-id-144'/>
              <return type-id='type-id-144'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvEC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-254' is-artificial='yes'/>
              <return type-id='type-id-154'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvEC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIPvEC2Ev'>
              <parameter type-id='type-id-254' is-artificial='yes'/>
              <return type-id='type-id-154'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='BufferList' type-id='type-id-256' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='213' column='1' id='type-id-255'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_stack_ptr_data' type-id='type-id-230' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='281' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_destroy_stack' type-id='type-id-257' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='282' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_device' type-id='type-id-258' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='285' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_wait_all_devices' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='288' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='328'>
        <var-decl name='m_is_mandatory' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='291' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='336'>
        <var-decl name='m_is_openmp' type-id='type-id-259' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='294' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_in' type-id='type-id-260' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='297' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='m_out' type-id='type-id-260' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='300' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='m_compute_buffers' type-id='type-id-255' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='303' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_destroy_buffers' type-id='type-id-255' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='306' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='m_vars' type-id='type-id-261' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='309' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='m_vars_extra' type-id='type-id-262' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='310' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='m_vars_total' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='311' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_status' type-id='type-id-263' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='314' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='m_func_desc' type-id='type-id-264' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='317' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='m_func_desc_size' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='318' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_inout_buf' type-id='type-id-31' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='321' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='m_in_deps' type-id='type-id-36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='324' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1792'>
        <var-decl name='m_in_deps_total' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1824'>
        <var-decl name='m_in_deps_allocated' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1856'>
        <var-decl name='m_out_deps' type-id='type-id-36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='327' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1920'>
        <var-decl name='m_out_deps_total' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='328' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1952'>
        <var-decl name='m_out_deps_allocated' type-id='type-id-27' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='329' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1984'>
        <var-decl name='m_stream' type-id='type-id-265' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2048'>
        <var-decl name='m_timer_data' type-id='type-id-266' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='335' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2112'>
        <var-decl name='m_in_datalen' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2176'>
        <var-decl name='m_out_datalen' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2240'>
        <var-decl name='m_need_runfunction' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='343' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2248'>
        <var-decl name='m_initial_need_runfunction' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='347' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2256'>
        <var-decl name='m_out_with_preallocated' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2264'>
        <var-decl name='m_preallocated_alloc' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <var-decl name='m_traceback_called' type-id='type-id-144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='360' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <var-decl name='m_omp_async_last_event_type' type-id='type-id-248' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='362' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='get_stream' mangled-name='_ZN17OffloadDescriptor10get_streamEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor10get_streamEv'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <return type-id='type-id-265'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_stream' mangled-name='_ZN17OffloadDescriptor10set_streamEm' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor10set_streamEm'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <parameter type-id='type-id-265'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <parameter type-id='type-id-146' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorD2Ev'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <parameter type-id='type-id-146' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorC4EiP15_Offload_statusbbP20OffloadHostTimerData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <parameter type-id='type-id-146'/>
          <parameter type-id='type-id-263'/>
          <parameter type-id='type-id-144'/>
          <parameter type-id='type-id-144'/>
          <parameter type-id='type-id-266'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorC2EiP15_Offload_statusbbP20OffloadHostTimerData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorC2EiP15_Offload_statusbbP20OffloadHostTimerData'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <parameter type-id='type-id-146'/>
          <parameter type-id='type-id-263'/>
          <parameter type-id='type-id-144'/>
          <parameter type-id='type-id-144'/>
          <parameter type-id='type-id-266'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OffloadTargetTimerData' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='43' column='1' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='frequency' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='phases' type-id='type-id-163' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='OffloadHostTimerData' size-in-bits='4160' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='51' column='1' id='type-id-268'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='57' column='1' id='type-id-160'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='58' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='total' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='59' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='phases' type-id='type-id-161' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='sent_bytes' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='received_bytes' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='card_number' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='offload_number' type-id='type-id-146' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='target' type-id='type-id-267' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='next' type-id='type-id-266' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-187'/>
    <reference-type-def kind='lvalue' type-id='type-id-221' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-223'/>
    <reference-type-def kind='lvalue' type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <reference-type-def kind='lvalue' type-id='type-id-36' size-in-bits='64' id='type-id-272'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-250'/>
    <reference-type-def kind='lvalue' type-id='type-id-227' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-228'/>
    <reference-type-def kind='lvalue' type-id='type-id-238' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-266'/>
    <reference-type-def kind='lvalue' type-id='type-id-229' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-276'/>
    <reference-type-def kind='lvalue' type-id='type-id-214' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-230'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-278'/>
    <reference-type-def kind='lvalue' type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-280'/>
    <reference-type-def kind='lvalue' type-id='type-id-230' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-237'/>
    <reference-type-def kind='lvalue' type-id='type-id-225' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <reference-type-def kind='lvalue' type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <reference-type-def kind='lvalue' type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <reference-type-def kind='lvalue' type-id='type-id-310' size-in-bits='64' id='type-id-311'/>
    <reference-type-def kind='lvalue' type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-314' size-in-bits='64' id='type-id-315'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-319'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-325'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-327'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-331'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-339'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-341'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-351'/>
    <reference-type-def kind='lvalue' type-id='type-id-144' size-in-bits='64' id='type-id-352'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-353'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-354'/>
    <reference-type-def kind='lvalue' type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-356'/>
    <reference-type-def kind='lvalue' type-id='type-id-50' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-221' const='yes' id='type-id-359'/>
    <reference-type-def kind='lvalue' type-id='type-id-359' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-222'/>
    <reference-type-def kind='lvalue' type-id='type-id-67' size-in-bits='64' id='type-id-360'/>
    <qualified-type-def type-id='type-id-227' const='yes' id='type-id-361'/>
    <reference-type-def kind='lvalue' type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-363'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-364'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-246'/>
    <qualified-type-def type-id='type-id-210' const='yes' id='type-id-215'/>
    <reference-type-def kind='lvalue' type-id='type-id-215' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-211'/>
    <qualified-type-def type-id='type-id-247' const='yes' id='type-id-365'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-367'/>
    <reference-type-def kind='lvalue' type-id='type-id-367' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-369'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-370'/>
    <reference-type-def kind='lvalue' type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-372'/>
    <qualified-type-def type-id='type-id-225' const='yes' id='type-id-373'/>
    <reference-type-def kind='lvalue' type-id='type-id-373' size-in-bits='64' id='type-id-374'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-375'/>
    <qualified-type-def type-id='type-id-286' const='yes' id='type-id-376'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-377'/>
    <qualified-type-def type-id='type-id-288' const='yes' id='type-id-378'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <qualified-type-def type-id='type-id-290' const='yes' id='type-id-380'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-382'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-383'/>
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-384'/>
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-385'/>
    <qualified-type-def type-id='type-id-296' const='yes' id='type-id-386'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-387'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-388'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-389'/>
    <qualified-type-def type-id='type-id-300' const='yes' id='type-id-390'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-391'/>
    <qualified-type-def type-id='type-id-302' const='yes' id='type-id-392'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-393'/>
    <qualified-type-def type-id='type-id-304' const='yes' id='type-id-394'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-306' const='yes' id='type-id-396'/>
    <reference-type-def kind='lvalue' type-id='type-id-396' size-in-bits='64' id='type-id-397'/>
    <qualified-type-def type-id='type-id-308' const='yes' id='type-id-398'/>
    <reference-type-def kind='lvalue' type-id='type-id-398' size-in-bits='64' id='type-id-399'/>
    <qualified-type-def type-id='type-id-310' const='yes' id='type-id-400'/>
    <reference-type-def kind='lvalue' type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <qualified-type-def type-id='type-id-312' const='yes' id='type-id-402'/>
    <reference-type-def kind='lvalue' type-id='type-id-402' size-in-bits='64' id='type-id-403'/>
    <qualified-type-def type-id='type-id-314' const='yes' id='type-id-404'/>
    <reference-type-def kind='lvalue' type-id='type-id-404' size-in-bits='64' id='type-id-405'/>
    <qualified-type-def type-id='type-id-316' const='yes' id='type-id-406'/>
    <reference-type-def kind='lvalue' type-id='type-id-406' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-408'/>
    <qualified-type-def type-id='type-id-318' const='yes' id='type-id-409'/>
    <reference-type-def kind='lvalue' type-id='type-id-409' size-in-bits='64' id='type-id-410'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-411'/>
    <qualified-type-def type-id='type-id-320' const='yes' id='type-id-412'/>
    <reference-type-def kind='lvalue' type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-414'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-415'/>
    <reference-type-def kind='lvalue' type-id='type-id-415' size-in-bits='64' id='type-id-416'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-417'/>
    <qualified-type-def type-id='type-id-324' const='yes' id='type-id-418'/>
    <reference-type-def kind='lvalue' type-id='type-id-418' size-in-bits='64' id='type-id-419'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-420'/>
    <qualified-type-def type-id='type-id-326' const='yes' id='type-id-421'/>
    <reference-type-def kind='lvalue' type-id='type-id-421' size-in-bits='64' id='type-id-422'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-423'/>
    <qualified-type-def type-id='type-id-328' const='yes' id='type-id-424'/>
    <reference-type-def kind='lvalue' type-id='type-id-424' size-in-bits='64' id='type-id-425'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-426'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-427'/>
    <reference-type-def kind='lvalue' type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-429'/>
    <qualified-type-def type-id='type-id-332' const='yes' id='type-id-430'/>
    <reference-type-def kind='lvalue' type-id='type-id-430' size-in-bits='64' id='type-id-431'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-432'/>
    <qualified-type-def type-id='type-id-334' const='yes' id='type-id-433'/>
    <reference-type-def kind='lvalue' type-id='type-id-433' size-in-bits='64' id='type-id-434'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-435'/>
    <qualified-type-def type-id='type-id-336' const='yes' id='type-id-436'/>
    <reference-type-def kind='lvalue' type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-438'/>
    <qualified-type-def type-id='type-id-338' const='yes' id='type-id-439'/>
    <reference-type-def kind='lvalue' type-id='type-id-439' size-in-bits='64' id='type-id-440'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-441'/>
    <qualified-type-def type-id='type-id-340' const='yes' id='type-id-442'/>
    <reference-type-def kind='lvalue' type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-444'/>
    <qualified-type-def type-id='type-id-342' const='yes' id='type-id-445'/>
    <reference-type-def kind='lvalue' type-id='type-id-445' size-in-bits='64' id='type-id-446'/>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' id='type-id-447'/>
    <qualified-type-def type-id='type-id-344' const='yes' id='type-id-448'/>
    <reference-type-def kind='lvalue' type-id='type-id-448' size-in-bits='64' id='type-id-449'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-450'/>
    <qualified-type-def type-id='type-id-346' const='yes' id='type-id-451'/>
    <reference-type-def kind='lvalue' type-id='type-id-451' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' id='type-id-453'/>
    <qualified-type-def type-id='type-id-348' const='yes' id='type-id-454'/>
    <reference-type-def kind='lvalue' type-id='type-id-454' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-454' size-in-bits='64' id='type-id-456'/>
    <qualified-type-def type-id='type-id-350' const='yes' id='type-id-457'/>
    <reference-type-def kind='lvalue' type-id='type-id-457' size-in-bits='64' id='type-id-458'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-460'/>
    <qualified-type-def type-id='type-id-461' const='yes' id='type-id-462'/>
    <reference-type-def kind='lvalue' type-id='type-id-462' size-in-bits='64' id='type-id-463'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-464'/>
    <qualified-type-def type-id='type-id-465' const='yes' id='type-id-466'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-467'/>
    <qualified-type-def type-id='type-id-468' const='yes' id='type-id-469'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-470'/>
    <qualified-type-def type-id='type-id-471' const='yes' id='type-id-472'/>
    <reference-type-def kind='lvalue' type-id='type-id-472' size-in-bits='64' id='type-id-473'/>
    <qualified-type-def type-id='type-id-474' const='yes' id='type-id-475'/>
    <reference-type-def kind='lvalue' type-id='type-id-475' size-in-bits='64' id='type-id-476'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-477'/>
    <qualified-type-def type-id='type-id-478' const='yes' id='type-id-479'/>
    <reference-type-def kind='lvalue' type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-481'/>
    <qualified-type-def type-id='type-id-482' const='yes' id='type-id-483'/>
    <reference-type-def kind='lvalue' type-id='type-id-483' size-in-bits='64' id='type-id-484'/>
    <pointer-type-def type-id='type-id-483' size-in-bits='64' id='type-id-485'/>
    <qualified-type-def type-id='type-id-486' const='yes' id='type-id-487'/>
    <reference-type-def kind='lvalue' type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' id='type-id-489'/>
    <qualified-type-def type-id='type-id-490' const='yes' id='type-id-491'/>
    <reference-type-def kind='lvalue' type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-493'/>
    <qualified-type-def type-id='type-id-494' const='yes' id='type-id-495'/>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' id='type-id-496'/>
    <qualified-type-def type-id='type-id-497' const='yes' id='type-id-498'/>
    <reference-type-def kind='lvalue' type-id='type-id-498' size-in-bits='64' id='type-id-499'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-500'/>
    <qualified-type-def type-id='type-id-501' const='yes' id='type-id-502'/>
    <reference-type-def kind='lvalue' type-id='type-id-502' size-in-bits='64' id='type-id-503'/>
    <qualified-type-def type-id='type-id-504' const='yes' id='type-id-505'/>
    <reference-type-def kind='lvalue' type-id='type-id-505' size-in-bits='64' id='type-id-506'/>
    <qualified-type-def type-id='type-id-507' const='yes' id='type-id-508'/>
    <reference-type-def kind='lvalue' type-id='type-id-508' size-in-bits='64' id='type-id-509'/>
    <qualified-type-def type-id='type-id-510' const='yes' id='type-id-511'/>
    <reference-type-def kind='lvalue' type-id='type-id-511' size-in-bits='64' id='type-id-512'/>
    <qualified-type-def type-id='type-id-513' const='yes' id='type-id-514'/>
    <reference-type-def kind='lvalue' type-id='type-id-514' size-in-bits='64' id='type-id-515'/>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-516'/>
    <qualified-type-def type-id='type-id-517' const='yes' id='type-id-518'/>
    <reference-type-def kind='lvalue' type-id='type-id-518' size-in-bits='64' id='type-id-519'/>
    <qualified-type-def type-id='type-id-520' const='yes' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' id='type-id-522'/>
    <qualified-type-def type-id='type-id-523' const='yes' id='type-id-524'/>
    <reference-type-def kind='lvalue' type-id='type-id-524' size-in-bits='64' id='type-id-525'/>
    <qualified-type-def type-id='type-id-526' const='yes' id='type-id-527'/>
    <reference-type-def kind='lvalue' type-id='type-id-527' size-in-bits='64' id='type-id-528'/>
    <qualified-type-def type-id='type-id-529' const='yes' id='type-id-530'/>
    <reference-type-def kind='lvalue' type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-533' const='yes' id='type-id-534'/>
    <reference-type-def kind='lvalue' type-id='type-id-534' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-536' const='yes' id='type-id-537'/>
    <reference-type-def kind='lvalue' type-id='type-id-537' size-in-bits='64' id='type-id-538'/>
    <qualified-type-def type-id='type-id-539' const='yes' id='type-id-540'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-542' const='yes' id='type-id-543'/>
    <reference-type-def kind='lvalue' type-id='type-id-543' size-in-bits='64' id='type-id-544'/>
    <qualified-type-def type-id='type-id-545' const='yes' id='type-id-546'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-548'/>
    <qualified-type-def type-id='type-id-549' const='yes' id='type-id-550'/>
    <reference-type-def kind='lvalue' type-id='type-id-550' size-in-bits='64' id='type-id-551'/>
    <qualified-type-def type-id='type-id-552' const='yes' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-558' const='yes' id='type-id-559'/>
    <reference-type-def kind='lvalue' type-id='type-id-559' size-in-bits='64' id='type-id-560'/>
    <qualified-type-def type-id='type-id-561' const='yes' id='type-id-562'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-564' const='yes' id='type-id-565'/>
    <reference-type-def kind='lvalue' type-id='type-id-565' size-in-bits='64' id='type-id-566'/>
    <qualified-type-def type-id='type-id-567' const='yes' id='type-id-568'/>
    <reference-type-def kind='lvalue' type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <qualified-type-def type-id='type-id-570' const='yes' id='type-id-571'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-572'/>
    <qualified-type-def type-id='type-id-573' const='yes' id='type-id-574'/>
    <reference-type-def kind='lvalue' type-id='type-id-574' size-in-bits='64' id='type-id-575'/>
    <qualified-type-def type-id='type-id-576' const='yes' id='type-id-577'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' id='type-id-578'/>
    <qualified-type-def type-id='type-id-579' const='yes' id='type-id-580'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' id='type-id-581'/>
    <qualified-type-def type-id='type-id-582' const='yes' id='type-id-583'/>
    <reference-type-def kind='lvalue' type-id='type-id-583' size-in-bits='64' id='type-id-584'/>
    <qualified-type-def type-id='type-id-585' const='yes' id='type-id-586'/>
    <reference-type-def kind='lvalue' type-id='type-id-586' size-in-bits='64' id='type-id-587'/>
    <qualified-type-def type-id='type-id-588' const='yes' id='type-id-589'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' id='type-id-590'/>
    <qualified-type-def type-id='type-id-591' const='yes' id='type-id-592'/>
    <reference-type-def kind='lvalue' type-id='type-id-592' size-in-bits='64' id='type-id-593'/>
    <qualified-type-def type-id='type-id-594' const='yes' id='type-id-595'/>
    <reference-type-def kind='lvalue' type-id='type-id-595' size-in-bits='64' id='type-id-596'/>
    <qualified-type-def type-id='type-id-597' const='yes' id='type-id-598'/>
    <pointer-type-def type-id='type-id-598' size-in-bits='64' id='type-id-599'/>
    <qualified-type-def type-id='type-id-600' const='yes' id='type-id-601'/>
    <reference-type-def kind='lvalue' type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <qualified-type-def type-id='type-id-603' const='yes' id='type-id-604'/>
    <pointer-type-def type-id='type-id-604' size-in-bits='64' id='type-id-605'/>
    <qualified-type-def type-id='type-id-606' const='yes' id='type-id-607'/>
    <reference-type-def kind='lvalue' type-id='type-id-607' size-in-bits='64' id='type-id-608'/>
    <qualified-type-def type-id='type-id-609' const='yes' id='type-id-610'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <qualified-type-def type-id='type-id-612' const='yes' id='type-id-613'/>
    <reference-type-def kind='lvalue' type-id='type-id-613' size-in-bits='64' id='type-id-614'/>
    <qualified-type-def type-id='type-id-615' const='yes' id='type-id-616'/>
    <pointer-type-def type-id='type-id-616' size-in-bits='64' id='type-id-617'/>
    <qualified-type-def type-id='type-id-618' const='yes' id='type-id-619'/>
    <reference-type-def kind='lvalue' type-id='type-id-619' size-in-bits='64' id='type-id-620'/>
    <qualified-type-def type-id='type-id-621' const='yes' id='type-id-622'/>
    <reference-type-def kind='lvalue' type-id='type-id-622' size-in-bits='64' id='type-id-623'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-624'/>
    <qualified-type-def type-id='type-id-625' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <pointer-type-def type-id='type-id-626' size-in-bits='64' id='type-id-628'/>
    <qualified-type-def type-id='type-id-629' const='yes' id='type-id-630'/>
    <reference-type-def kind='lvalue' type-id='type-id-630' size-in-bits='64' id='type-id-631'/>
    <pointer-type-def type-id='type-id-630' size-in-bits='64' id='type-id-632'/>
    <qualified-type-def type-id='type-id-633' const='yes' id='type-id-634'/>
    <reference-type-def kind='lvalue' type-id='type-id-634' size-in-bits='64' id='type-id-635'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-636'/>
    <qualified-type-def type-id='type-id-637' const='yes' id='type-id-638'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' id='type-id-639'/>
    <qualified-type-def type-id='type-id-640' const='yes' id='type-id-641'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <qualified-type-def type-id='type-id-643' const='yes' id='type-id-644'/>
    <reference-type-def kind='lvalue' type-id='type-id-644' size-in-bits='64' id='type-id-645'/>
    <qualified-type-def type-id='type-id-646' const='yes' id='type-id-647'/>
    <pointer-type-def type-id='type-id-647' size-in-bits='64' id='type-id-648'/>
    <qualified-type-def type-id='type-id-649' const='yes' id='type-id-650'/>
    <reference-type-def kind='lvalue' type-id='type-id-650' size-in-bits='64' id='type-id-651'/>
    <qualified-type-def type-id='type-id-652' const='yes' id='type-id-653'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-654'/>
    <qualified-type-def type-id='type-id-655' const='yes' id='type-id-656'/>
    <reference-type-def kind='lvalue' type-id='type-id-656' size-in-bits='64' id='type-id-657'/>
    <qualified-type-def type-id='type-id-658' const='yes' id='type-id-659'/>
    <pointer-type-def type-id='type-id-659' size-in-bits='64' id='type-id-660'/>
    <qualified-type-def type-id='type-id-661' const='yes' id='type-id-662'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-663'/>
    <qualified-type-def type-id='type-id-664' const='yes' id='type-id-665'/>
    <pointer-type-def type-id='type-id-665' size-in-bits='64' id='type-id-666'/>
    <qualified-type-def type-id='type-id-667' const='yes' id='type-id-668'/>
    <reference-type-def kind='lvalue' type-id='type-id-668' size-in-bits='64' id='type-id-669'/>
    <qualified-type-def type-id='type-id-670' const='yes' id='type-id-671'/>
    <pointer-type-def type-id='type-id-671' size-in-bits='64' id='type-id-672'/>
    <qualified-type-def type-id='type-id-673' const='yes' id='type-id-674'/>
    <qualified-type-def type-id='type-id-675' const='yes' id='type-id-676'/>
    <qualified-type-def type-id='type-id-677' const='yes' id='type-id-678'/>
    <reference-type-def kind='lvalue' type-id='type-id-678' size-in-bits='64' id='type-id-679'/>
    <pointer-type-def type-id='type-id-678' size-in-bits='64' id='type-id-680'/>
    <qualified-type-def type-id='type-id-681' const='yes' id='type-id-682'/>
    <reference-type-def kind='lvalue' type-id='type-id-682' size-in-bits='64' id='type-id-683'/>
    <qualified-type-def type-id='type-id-684' const='yes' id='type-id-685'/>
    <reference-type-def kind='lvalue' type-id='type-id-685' size-in-bits='64' id='type-id-686'/>
    <qualified-type-def type-id='type-id-687' const='yes' id='type-id-688'/>
    <reference-type-def kind='lvalue' type-id='type-id-688' size-in-bits='64' id='type-id-689'/>
    <pointer-type-def type-id='type-id-688' size-in-bits='64' id='type-id-690'/>
    <qualified-type-def type-id='type-id-691' const='yes' id='type-id-692'/>
    <reference-type-def kind='lvalue' type-id='type-id-692' size-in-bits='64' id='type-id-693'/>
    <qualified-type-def type-id='type-id-694' const='yes' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-695' size-in-bits='64' id='type-id-696'/>
    <qualified-type-def type-id='type-id-697' const='yes' id='type-id-698'/>
    <reference-type-def kind='lvalue' type-id='type-id-698' size-in-bits='64' id='type-id-699'/>
    <pointer-type-def type-id='type-id-698' size-in-bits='64' id='type-id-700'/>
    <qualified-type-def type-id='type-id-701' const='yes' id='type-id-702'/>
    <reference-type-def kind='lvalue' type-id='type-id-702' size-in-bits='64' id='type-id-703'/>
    <qualified-type-def type-id='type-id-704' const='yes' id='type-id-705'/>
    <reference-type-def kind='lvalue' type-id='type-id-705' size-in-bits='64' id='type-id-706'/>
    <qualified-type-def type-id='type-id-707' const='yes' id='type-id-708'/>
    <reference-type-def kind='lvalue' type-id='type-id-708' size-in-bits='64' id='type-id-709'/>
    <pointer-type-def type-id='type-id-708' size-in-bits='64' id='type-id-710'/>
    <qualified-type-def type-id='type-id-711' const='yes' id='type-id-712'/>
    <reference-type-def kind='lvalue' type-id='type-id-712' size-in-bits='64' id='type-id-713'/>
    <qualified-type-def type-id='type-id-714' const='yes' id='type-id-715'/>
    <reference-type-def kind='lvalue' type-id='type-id-715' size-in-bits='64' id='type-id-716'/>
    <qualified-type-def type-id='type-id-256' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-717' size-in-bits='64' id='type-id-718'/>
    <pointer-type-def type-id='type-id-717' size-in-bits='64' id='type-id-719'/>
    <qualified-type-def type-id='type-id-720' const='yes' id='type-id-721'/>
    <reference-type-def kind='lvalue' type-id='type-id-721' size-in-bits='64' id='type-id-722'/>
    <qualified-type-def type-id='type-id-723' const='yes' id='type-id-724'/>
    <reference-type-def kind='lvalue' type-id='type-id-724' size-in-bits='64' id='type-id-725'/>
    <qualified-type-def type-id='type-id-726' const='yes' id='type-id-727'/>
    <pointer-type-def type-id='type-id-727' size-in-bits='64' id='type-id-728'/>
    <qualified-type-def type-id='type-id-729' const='yes' id='type-id-730'/>
    <reference-type-def kind='lvalue' type-id='type-id-730' size-in-bits='64' id='type-id-731'/>
    <qualified-type-def type-id='type-id-732' const='yes' id='type-id-733'/>
    <reference-type-def kind='lvalue' type-id='type-id-733' size-in-bits='64' id='type-id-734'/>
    <qualified-type-def type-id='type-id-735' const='yes' id='type-id-736'/>
    <reference-type-def kind='lvalue' type-id='type-id-736' size-in-bits='64' id='type-id-737'/>
    <qualified-type-def type-id='type-id-738' const='yes' id='type-id-739'/>
    <reference-type-def kind='lvalue' type-id='type-id-739' size-in-bits='64' id='type-id-740'/>
    <qualified-type-def type-id='type-id-741' const='yes' id='type-id-742'/>
    <reference-type-def kind='lvalue' type-id='type-id-742' size-in-bits='64' id='type-id-743'/>
    <qualified-type-def type-id='type-id-744' const='yes' id='type-id-745'/>
    <reference-type-def kind='lvalue' type-id='type-id-745' size-in-bits='64' id='type-id-746'/>
    <qualified-type-def type-id='type-id-747' const='yes' id='type-id-748'/>
    <reference-type-def kind='lvalue' type-id='type-id-748' size-in-bits='64' id='type-id-749'/>
    <qualified-type-def type-id='type-id-750' const='yes' id='type-id-751'/>
    <reference-type-def kind='lvalue' type-id='type-id-751' size-in-bits='64' id='type-id-752'/>
    <qualified-type-def type-id='type-id-753' const='yes' id='type-id-754'/>
    <reference-type-def kind='lvalue' type-id='type-id-754' size-in-bits='64' id='type-id-755'/>
    <qualified-type-def type-id='type-id-756' const='yes' id='type-id-757'/>
    <reference-type-def kind='lvalue' type-id='type-id-757' size-in-bits='64' id='type-id-758'/>
    <qualified-type-def type-id='type-id-759' const='yes' id='type-id-760'/>
    <reference-type-def kind='lvalue' type-id='type-id-760' size-in-bits='64' id='type-id-761'/>
    <qualified-type-def type-id='type-id-762' const='yes' id='type-id-763'/>
    <reference-type-def kind='lvalue' type-id='type-id-763' size-in-bits='64' id='type-id-764'/>
    <qualified-type-def type-id='type-id-765' const='yes' id='type-id-766'/>
    <reference-type-def kind='lvalue' type-id='type-id-766' size-in-bits='64' id='type-id-767'/>
    <qualified-type-def type-id='type-id-768' const='yes' id='type-id-769'/>
    <reference-type-def kind='lvalue' type-id='type-id-769' size-in-bits='64' id='type-id-770'/>
    <qualified-type-def type-id='type-id-771' const='yes' id='type-id-772'/>
    <reference-type-def kind='lvalue' type-id='type-id-772' size-in-bits='64' id='type-id-773'/>
    <qualified-type-def type-id='type-id-774' const='yes' id='type-id-775'/>
    <reference-type-def kind='lvalue' type-id='type-id-775' size-in-bits='64' id='type-id-776'/>
    <qualified-type-def type-id='type-id-777' const='yes' id='type-id-778'/>
    <reference-type-def kind='lvalue' type-id='type-id-778' size-in-bits='64' id='type-id-779'/>
    <qualified-type-def type-id='type-id-780' const='yes' id='type-id-781'/>
    <reference-type-def kind='lvalue' type-id='type-id-781' size-in-bits='64' id='type-id-782'/>
    <qualified-type-def type-id='type-id-236' const='yes' id='type-id-783'/>
    <reference-type-def kind='lvalue' type-id='type-id-783' size-in-bits='64' id='type-id-784'/>
    <pointer-type-def type-id='type-id-783' size-in-bits='64' id='type-id-785'/>
    <qualified-type-def type-id='type-id-786' const='yes' id='type-id-787'/>
    <pointer-type-def type-id='type-id-787' size-in-bits='64' id='type-id-788'/>
    <qualified-type-def type-id='type-id-789' const='yes' id='type-id-790'/>
    <pointer-type-def type-id='type-id-790' size-in-bits='64' id='type-id-791'/>
    <qualified-type-def type-id='type-id-792' const='yes' id='type-id-793'/>
    <pointer-type-def type-id='type-id-793' size-in-bits='64' id='type-id-794'/>
    <qualified-type-def type-id='type-id-795' const='yes' id='type-id-796'/>
    <reference-type-def kind='lvalue' type-id='type-id-796' size-in-bits='64' id='type-id-797'/>
    <pointer-type-def type-id='type-id-796' size-in-bits='64' id='type-id-798'/>
    <qualified-type-def type-id='type-id-799' const='yes' id='type-id-800'/>
    <reference-type-def kind='lvalue' type-id='type-id-800' size-in-bits='64' id='type-id-801'/>
    <pointer-type-def type-id='type-id-800' size-in-bits='64' id='type-id-802'/>
    <qualified-type-def type-id='type-id-803' const='yes' id='type-id-804'/>
    <reference-type-def kind='lvalue' type-id='type-id-804' size-in-bits='64' id='type-id-805'/>
    <pointer-type-def type-id='type-id-804' size-in-bits='64' id='type-id-806'/>
    <qualified-type-def type-id='type-id-807' const='yes' id='type-id-808'/>
    <reference-type-def kind='lvalue' type-id='type-id-808' size-in-bits='64' id='type-id-809'/>
    <pointer-type-def type-id='type-id-808' size-in-bits='64' id='type-id-810'/>
    <qualified-type-def type-id='type-id-234' const='yes' id='type-id-811'/>
    <reference-type-def kind='lvalue' type-id='type-id-811' size-in-bits='64' id='type-id-812'/>
    <pointer-type-def type-id='type-id-811' size-in-bits='64' id='type-id-813'/>
    <qualified-type-def type-id='type-id-814' const='yes' id='type-id-815'/>
    <reference-type-def kind='lvalue' type-id='type-id-815' size-in-bits='64' id='type-id-816'/>
    <qualified-type-def type-id='type-id-817' const='yes' id='type-id-818'/>
    <reference-type-def kind='lvalue' type-id='type-id-818' size-in-bits='64' id='type-id-819'/>
    <qualified-type-def type-id='type-id-820' const='yes' id='type-id-821'/>
    <reference-type-def kind='lvalue' type-id='type-id-821' size-in-bits='64' id='type-id-822'/>
    <qualified-type-def type-id='type-id-823' const='yes' id='type-id-824'/>
    <reference-type-def kind='lvalue' type-id='type-id-824' size-in-bits='64' id='type-id-825'/>
    <qualified-type-def type-id='type-id-240' const='yes' id='type-id-826'/>
    <reference-type-def kind='lvalue' type-id='type-id-826' size-in-bits='64' id='type-id-827'/>
    <pointer-type-def type-id='type-id-826' size-in-bits='64' id='type-id-828'/>
    <qualified-type-def type-id='type-id-829' const='yes' id='type-id-830'/>
    <reference-type-def kind='lvalue' type-id='type-id-830' size-in-bits='64' id='type-id-831'/>
    <qualified-type-def type-id='type-id-832' const='yes' id='type-id-833'/>
    <reference-type-def kind='lvalue' type-id='type-id-833' size-in-bits='64' id='type-id-834'/>
    <qualified-type-def type-id='type-id-835' const='yes' id='type-id-836'/>
    <reference-type-def kind='lvalue' type-id='type-id-836' size-in-bits='64' id='type-id-837'/>
    <qualified-type-def type-id='type-id-838' const='yes' id='type-id-839'/>
    <reference-type-def kind='lvalue' type-id='type-id-839' size-in-bits='64' id='type-id-840'/>
    <qualified-type-def type-id='type-id-841' const='yes' id='type-id-842'/>
    <reference-type-def kind='lvalue' type-id='type-id-842' size-in-bits='64' id='type-id-843'/>
    <pointer-type-def type-id='type-id-842' size-in-bits='64' id='type-id-844'/>
    <qualified-type-def type-id='type-id-845' const='yes' id='type-id-846'/>
    <reference-type-def kind='lvalue' type-id='type-id-846' size-in-bits='64' id='type-id-847'/>
    <qualified-type-def type-id='type-id-848' const='yes' id='type-id-849'/>
    <reference-type-def kind='lvalue' type-id='type-id-849' size-in-bits='64' id='type-id-850'/>
    <qualified-type-def type-id='type-id-851' const='yes' id='type-id-852'/>
    <reference-type-def kind='lvalue' type-id='type-id-852' size-in-bits='64' id='type-id-853'/>
    <qualified-type-def type-id='type-id-854' const='yes' id='type-id-855'/>
    <reference-type-def kind='lvalue' type-id='type-id-855' size-in-bits='64' id='type-id-856'/>
    <qualified-type-def type-id='type-id-857' const='yes' id='type-id-858'/>
    <reference-type-def kind='lvalue' type-id='type-id-858' size-in-bits='64' id='type-id-859'/>
    <qualified-type-def type-id='type-id-860' const='yes' id='type-id-861'/>
    <reference-type-def kind='lvalue' type-id='type-id-861' size-in-bits='64' id='type-id-862'/>
    <pointer-type-def type-id='type-id-861' size-in-bits='64' id='type-id-863'/>
    <qualified-type-def type-id='type-id-864' const='yes' id='type-id-865'/>
    <reference-type-def kind='lvalue' type-id='type-id-865' size-in-bits='64' id='type-id-866'/>
    <pointer-type-def type-id='type-id-865' size-in-bits='64' id='type-id-867'/>
    <qualified-type-def type-id='type-id-868' const='yes' id='type-id-869'/>
    <reference-type-def kind='lvalue' type-id='type-id-869' size-in-bits='64' id='type-id-870'/>
    <qualified-type-def type-id='type-id-871' const='yes' id='type-id-872'/>
    <reference-type-def kind='lvalue' type-id='type-id-872' size-in-bits='64' id='type-id-873'/>
    <qualified-type-def type-id='type-id-874' const='yes' id='type-id-875'/>
    <reference-type-def kind='lvalue' type-id='type-id-875' size-in-bits='64' id='type-id-876'/>
    <qualified-type-def type-id='type-id-220' const='yes' id='type-id-877'/>
    <reference-type-def kind='lvalue' type-id='type-id-877' size-in-bits='64' id='type-id-878'/>
    <pointer-type-def type-id='type-id-877' size-in-bits='64' id='type-id-879'/>
    <qualified-type-def type-id='type-id-880' const='yes' id='type-id-881'/>
    <reference-type-def kind='lvalue' type-id='type-id-881' size-in-bits='64' id='type-id-882'/>
    <qualified-type-def type-id='type-id-883' const='yes' id='type-id-884'/>
    <reference-type-def kind='lvalue' type-id='type-id-884' size-in-bits='64' id='type-id-885'/>
    <qualified-type-def type-id='type-id-886' const='yes' id='type-id-887'/>
    <reference-type-def kind='lvalue' type-id='type-id-887' size-in-bits='64' id='type-id-888'/>
    <reference-type-def kind='lvalue' type-id='type-id-889' size-in-bits='64' id='type-id-890'/>
    <pointer-type-def type-id='type-id-889' size-in-bits='64' id='type-id-891'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-892'/>
    <reference-type-def kind='lvalue' type-id='type-id-465' size-in-bits='64' id='type-id-893'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-894'/>
    <reference-type-def kind='lvalue' type-id='type-id-471' size-in-bits='64' id='type-id-895'/>
    <reference-type-def kind='lvalue' type-id='type-id-474' size-in-bits='64' id='type-id-896'/>
    <pointer-type-def type-id='type-id-474' size-in-bits='64' id='type-id-897'/>
    <reference-type-def kind='lvalue' type-id='type-id-478' size-in-bits='64' id='type-id-898'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-899'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' id='type-id-900'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-901'/>
    <reference-type-def kind='lvalue' type-id='type-id-486' size-in-bits='64' id='type-id-902'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' id='type-id-903'/>
    <reference-type-def kind='lvalue' type-id='type-id-490' size-in-bits='64' id='type-id-904'/>
    <pointer-type-def type-id='type-id-490' size-in-bits='64' id='type-id-905'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-906'/>
    <reference-type-def kind='lvalue' type-id='type-id-497' size-in-bits='64' id='type-id-907'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-908'/>
    <reference-type-def kind='lvalue' type-id='type-id-909' size-in-bits='64' id='type-id-910'/>
    <reference-type-def kind='lvalue' type-id='type-id-501' size-in-bits='64' id='type-id-911'/>
    <pointer-type-def type-id='type-id-912' size-in-bits='64' id='type-id-913'/>
    <reference-type-def kind='lvalue' type-id='type-id-513' size-in-bits='64' id='type-id-914'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' id='type-id-915'/>
    <reference-type-def kind='lvalue' type-id='type-id-916' size-in-bits='64' id='type-id-917'/>
    <reference-type-def kind='lvalue' type-id='type-id-517' size-in-bits='64' id='type-id-918'/>
    <pointer-type-def type-id='type-id-919' size-in-bits='64' id='type-id-920'/>
    <reference-type-def kind='lvalue' type-id='type-id-529' size-in-bits='64' id='type-id-921'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-922'/>
    <reference-type-def kind='lvalue' type-id='type-id-923' size-in-bits='64' id='type-id-924'/>
    <reference-type-def kind='lvalue' type-id='type-id-533' size-in-bits='64' id='type-id-925'/>
    <pointer-type-def type-id='type-id-926' size-in-bits='64' id='type-id-927'/>
    <reference-type-def kind='lvalue' type-id='type-id-545' size-in-bits='64' id='type-id-928'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-929'/>
    <reference-type-def kind='lvalue' type-id='type-id-930' size-in-bits='64' id='type-id-931'/>
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' id='type-id-932'/>
    <pointer-type-def type-id='type-id-933' size-in-bits='64' id='type-id-934'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-935'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-936'/>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' id='type-id-937'/>
    <reference-type-def kind='lvalue' type-id='type-id-573' size-in-bits='64' id='type-id-938'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' id='type-id-939'/>
    <reference-type-def kind='lvalue' type-id='type-id-582' size-in-bits='64' id='type-id-940'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' id='type-id-941'/>
    <reference-type-def kind='lvalue' type-id='type-id-591' size-in-bits='64' id='type-id-942'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-943'/>
    <reference-type-def kind='lvalue' type-id='type-id-600' size-in-bits='64' id='type-id-944'/>
    <pointer-type-def type-id='type-id-603' size-in-bits='64' id='type-id-945'/>
    <reference-type-def kind='lvalue' type-id='type-id-606' size-in-bits='64' id='type-id-946'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' id='type-id-947'/>
    <reference-type-def kind='lvalue' type-id='type-id-612' size-in-bits='64' id='type-id-948'/>
    <pointer-type-def type-id='type-id-615' size-in-bits='64' id='type-id-949'/>
    <reference-type-def kind='lvalue' type-id='type-id-618' size-in-bits='64' id='type-id-950'/>
    <reference-type-def kind='lvalue' type-id='type-id-621' size-in-bits='64' id='type-id-951'/>
    <pointer-type-def type-id='type-id-621' size-in-bits='64' id='type-id-952'/>
    <reference-type-def kind='lvalue' type-id='type-id-625' size-in-bits='64' id='type-id-953'/>
    <pointer-type-def type-id='type-id-625' size-in-bits='64' id='type-id-954'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' id='type-id-955'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' id='type-id-956'/>
    <reference-type-def kind='lvalue' type-id='type-id-633' size-in-bits='64' id='type-id-957'/>
    <pointer-type-def type-id='type-id-633' size-in-bits='64' id='type-id-958'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' id='type-id-959'/>
    <reference-type-def kind='lvalue' type-id='type-id-640' size-in-bits='64' id='type-id-960'/>
    <pointer-type-def type-id='type-id-640' size-in-bits='64' id='type-id-961'/>
    <pointer-type-def type-id='type-id-962' size-in-bits='64' id='type-id-963'/>
    <reference-type-def kind='lvalue' type-id='type-id-643' size-in-bits='64' id='type-id-964'/>
    <reference-type-def kind='lvalue' type-id='type-id-646' size-in-bits='64' id='type-id-965'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-966'/>
    <pointer-type-def type-id='type-id-967' size-in-bits='64' id='type-id-968'/>
    <reference-type-def kind='lvalue' type-id='type-id-649' size-in-bits='64' id='type-id-969'/>
    <reference-type-def kind='lvalue' type-id='type-id-652' size-in-bits='64' id='type-id-970'/>
    <pointer-type-def type-id='type-id-652' size-in-bits='64' id='type-id-971'/>
    <pointer-type-def type-id='type-id-972' size-in-bits='64' id='type-id-973'/>
    <reference-type-def kind='lvalue' type-id='type-id-655' size-in-bits='64' id='type-id-974'/>
    <reference-type-def kind='lvalue' type-id='type-id-658' size-in-bits='64' id='type-id-975'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' id='type-id-976'/>
    <pointer-type-def type-id='type-id-977' size-in-bits='64' id='type-id-978'/>
    <reference-type-def kind='lvalue' type-id='type-id-661' size-in-bits='64' id='type-id-979'/>
    <reference-type-def kind='lvalue' type-id='type-id-664' size-in-bits='64' id='type-id-980'/>
    <pointer-type-def type-id='type-id-664' size-in-bits='64' id='type-id-981'/>
    <pointer-type-def type-id='type-id-982' size-in-bits='64' id='type-id-983'/>
    <reference-type-def kind='lvalue' type-id='type-id-667' size-in-bits='64' id='type-id-984'/>
    <pointer-type-def type-id='type-id-670' size-in-bits='64' id='type-id-985'/>
    <reference-type-def kind='lvalue' type-id='type-id-677' size-in-bits='64' id='type-id-986'/>
    <pointer-type-def type-id='type-id-677' size-in-bits='64' id='type-id-987'/>
    <reference-type-def kind='lvalue' type-id='type-id-988' size-in-bits='64' id='type-id-989'/>
    <reference-type-def kind='lvalue' type-id='type-id-684' size-in-bits='64' id='type-id-990'/>
    <reference-type-def kind='lvalue' type-id='type-id-687' size-in-bits='64' id='type-id-991'/>
    <pointer-type-def type-id='type-id-687' size-in-bits='64' id='type-id-992'/>
    <reference-type-def kind='lvalue' type-id='type-id-993' size-in-bits='64' id='type-id-994'/>
    <reference-type-def kind='lvalue' type-id='type-id-694' size-in-bits='64' id='type-id-995'/>
    <reference-type-def kind='lvalue' type-id='type-id-697' size-in-bits='64' id='type-id-996'/>
    <pointer-type-def type-id='type-id-697' size-in-bits='64' id='type-id-997'/>
    <reference-type-def kind='lvalue' type-id='type-id-998' size-in-bits='64' id='type-id-999'/>
    <reference-type-def kind='lvalue' type-id='type-id-704' size-in-bits='64' id='type-id-1000'/>
    <reference-type-def kind='lvalue' type-id='type-id-707' size-in-bits='64' id='type-id-1001'/>
    <pointer-type-def type-id='type-id-707' size-in-bits='64' id='type-id-1002'/>
    <reference-type-def kind='lvalue' type-id='type-id-1003' size-in-bits='64' id='type-id-1004'/>
    <reference-type-def kind='lvalue' type-id='type-id-714' size-in-bits='64' id='type-id-1005'/>
    <reference-type-def kind='lvalue' type-id='type-id-256' size-in-bits='64' id='type-id-1006'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-1007'/>
    <reference-type-def kind='lvalue' type-id='type-id-1008' size-in-bits='64' id='type-id-1009'/>
    <reference-type-def kind='lvalue' type-id='type-id-723' size-in-bits='64' id='type-id-1010'/>
    <reference-type-def kind='lvalue' type-id='type-id-726' size-in-bits='64' id='type-id-1011'/>
    <pointer-type-def type-id='type-id-726' size-in-bits='64' id='type-id-1012'/>
    <reference-type-def kind='lvalue' type-id='type-id-729' size-in-bits='64' id='type-id-1013'/>
    <pointer-type-def type-id='type-id-729' size-in-bits='64' id='type-id-1014'/>
    <reference-type-def kind='lvalue' type-id='type-id-732' size-in-bits='64' id='type-id-1015'/>
    <pointer-type-def type-id='type-id-732' size-in-bits='64' id='type-id-1016'/>
    <reference-type-def kind='lvalue' type-id='type-id-735' size-in-bits='64' id='type-id-1017'/>
    <pointer-type-def type-id='type-id-735' size-in-bits='64' id='type-id-1018'/>
    <reference-type-def kind='lvalue' type-id='type-id-738' size-in-bits='64' id='type-id-1019'/>
    <pointer-type-def type-id='type-id-738' size-in-bits='64' id='type-id-1020'/>
    <reference-type-def kind='lvalue' type-id='type-id-741' size-in-bits='64' id='type-id-1021'/>
    <pointer-type-def type-id='type-id-741' size-in-bits='64' id='type-id-1022'/>
    <reference-type-def kind='lvalue' type-id='type-id-744' size-in-bits='64' id='type-id-1023'/>
    <pointer-type-def type-id='type-id-744' size-in-bits='64' id='type-id-1024'/>
    <reference-type-def kind='lvalue' type-id='type-id-747' size-in-bits='64' id='type-id-1025'/>
    <pointer-type-def type-id='type-id-747' size-in-bits='64' id='type-id-1026'/>
    <reference-type-def kind='lvalue' type-id='type-id-750' size-in-bits='64' id='type-id-1027'/>
    <pointer-type-def type-id='type-id-750' size-in-bits='64' id='type-id-1028'/>
    <reference-type-def kind='lvalue' type-id='type-id-753' size-in-bits='64' id='type-id-1029'/>
    <pointer-type-def type-id='type-id-753' size-in-bits='64' id='type-id-1030'/>
    <reference-type-def kind='lvalue' type-id='type-id-756' size-in-bits='64' id='type-id-1031'/>
    <pointer-type-def type-id='type-id-756' size-in-bits='64' id='type-id-1032'/>
    <reference-type-def kind='lvalue' type-id='type-id-759' size-in-bits='64' id='type-id-1033'/>
    <pointer-type-def type-id='type-id-759' size-in-bits='64' id='type-id-1034'/>
    <reference-type-def kind='lvalue' type-id='type-id-762' size-in-bits='64' id='type-id-1035'/>
    <pointer-type-def type-id='type-id-762' size-in-bits='64' id='type-id-1036'/>
    <pointer-type-def type-id='type-id-765' size-in-bits='64' id='type-id-1037'/>
    <pointer-type-def type-id='type-id-768' size-in-bits='64' id='type-id-1038'/>
    <pointer-type-def type-id='type-id-771' size-in-bits='64' id='type-id-1039'/>
    <pointer-type-def type-id='type-id-774' size-in-bits='64' id='type-id-1040'/>
    <reference-type-def kind='lvalue' type-id='type-id-777' size-in-bits='64' id='type-id-1041'/>
    <pointer-type-def type-id='type-id-777' size-in-bits='64' id='type-id-1042'/>
    <reference-type-def kind='lvalue' type-id='type-id-780' size-in-bits='64' id='type-id-1043'/>
    <pointer-type-def type-id='type-id-780' size-in-bits='64' id='type-id-1044'/>
    <reference-type-def kind='lvalue' type-id='type-id-236' size-in-bits='64' id='type-id-1045'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-1046'/>
    <pointer-type-def type-id='type-id-786' size-in-bits='64' id='type-id-1047'/>
    <pointer-type-def type-id='type-id-789' size-in-bits='64' id='type-id-1048'/>
    <pointer-type-def type-id='type-id-792' size-in-bits='64' id='type-id-1049'/>
    <reference-type-def kind='lvalue' type-id='type-id-234' size-in-bits='64' id='type-id-1050'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-1051'/>
    <reference-type-def kind='lvalue' type-id='type-id-817' size-in-bits='64' id='type-id-1052'/>
    <reference-type-def kind='lvalue' type-id='type-id-820' size-in-bits='64' id='type-id-1053'/>
    <reference-type-def kind='lvalue' type-id='type-id-240' size-in-bits='64' id='type-id-1054'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-1055'/>
    <reference-type-def kind='lvalue' type-id='type-id-832' size-in-bits='64' id='type-id-1056'/>
    <reference-type-def kind='lvalue' type-id='type-id-835' size-in-bits='64' id='type-id-1057'/>
    <reference-type-def kind='lvalue' type-id='type-id-841' size-in-bits='64' id='type-id-1058'/>
    <pointer-type-def type-id='type-id-841' size-in-bits='64' id='type-id-1059'/>
    <reference-type-def kind='lvalue' type-id='type-id-845' size-in-bits='64' id='type-id-1060'/>
    <pointer-type-def type-id='type-id-845' size-in-bits='64' id='type-id-1061'/>
    <reference-type-def kind='lvalue' type-id='type-id-848' size-in-bits='64' id='type-id-1062'/>
    <pointer-type-def type-id='type-id-848' size-in-bits='64' id='type-id-1063'/>
    <reference-type-def kind='lvalue' type-id='type-id-851' size-in-bits='64' id='type-id-1064'/>
    <pointer-type-def type-id='type-id-851' size-in-bits='64' id='type-id-1065'/>
    <reference-type-def kind='lvalue' type-id='type-id-854' size-in-bits='64' id='type-id-1066'/>
    <pointer-type-def type-id='type-id-854' size-in-bits='64' id='type-id-1067'/>
    <reference-type-def kind='lvalue' type-id='type-id-857' size-in-bits='64' id='type-id-1068'/>
    <pointer-type-def type-id='type-id-857' size-in-bits='64' id='type-id-1069'/>
    <reference-type-def kind='lvalue' type-id='type-id-860' size-in-bits='64' id='type-id-1070'/>
    <pointer-type-def type-id='type-id-860' size-in-bits='64' id='type-id-1071'/>
    <reference-type-def kind='lvalue' type-id='type-id-864' size-in-bits='64' id='type-id-1072'/>
    <pointer-type-def type-id='type-id-864' size-in-bits='64' id='type-id-1073'/>
    <reference-type-def kind='lvalue' type-id='type-id-874' size-in-bits='64' id='type-id-1074'/>
    <reference-type-def kind='lvalue' type-id='type-id-220' size-in-bits='64' id='type-id-1075'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-1076'/>
    <reference-type-def kind='lvalue' type-id='type-id-886' size-in-bits='64' id='type-id-1077'/>
    <reference-type-def kind='lvalue' type-id='type-id-27' size-in-bits='64' id='type-id-1078'/>
    <reference-type-def kind='lvalue' type-id='type-id-28' size-in-bits='64' id='type-id-1079'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-1080'/>
    <qualified-type-def type-id='type-id-150' const='yes' id='type-id-1081'/>
    <reference-type-def kind='lvalue' type-id='type-id-1081' size-in-bits='64' id='type-id-1082'/>
    <pointer-type-def type-id='type-id-1081' size-in-bits='64' id='type-id-1083'/>
    <namespace-decl name='std'>
      <class-decl name='initializer_list&lt;AutoData&gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='type-id-786'>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='type-id-222' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='type-id-1084'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='type-id-1085'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='type-id-222' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='type-id-1087'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1084' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1085' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;PtrData&gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='type-id-789'>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='type-id-372' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='type-id-1088'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='type-id-1089'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='type-id-372' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='type-id-1090'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1088' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1089' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='type-id-792'>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='type-id-844' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='type-id-1091'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='type-id-1092'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='type-id-844' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='type-id-1093'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1091' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1092' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;AutoData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1094'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1096'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1098'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1099'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1100'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1103' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1102'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1104'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;DynLib&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1106'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1108' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1107'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1109'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1110'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1111'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1112'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1103' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1113'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1114'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PersistData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1115'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1117' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1116'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1118'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1119'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1120'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1121'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1122'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1124'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1125'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1117' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1116'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1126'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PtrData*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1127'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1129' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1128'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1130'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1131'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1132'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1133'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1134'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1135'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1136'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1129' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1128'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1137'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PtrData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1138'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1139'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1140'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1141'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1142'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1143'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1144'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1145'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1103' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1146'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1147'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;TargetImage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1148'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1150' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1149'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1151'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1152'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1153'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1154'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1103' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1155'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1156'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;coibuffer*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1157'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1159' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1158'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1160'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1161'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1162'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1163'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1103' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1164'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1165'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;DynLib&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1166'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1167'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1168'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1169'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;PersistData&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1170'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1171'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1172'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1173'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;PtrData*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1174'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1175'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1176'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1177'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10deallocateERS4_PS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10deallocateERS4_PS3_m'>
            <parameter type-id='type-id-1031'/>
            <parameter type-id='type-id-1175'/>
            <parameter type-id='type-id-1177'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;PtrData*&gt; &gt;, PtrData*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='type-id-1031'/>
            <parameter type-id='type-id-282'/>
            <parameter type-id='type-id-146'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;PtrData*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE7destroyIS2_EEvRS4_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE7destroyIS2_EEvRS4_PT_'>
            <parameter type-id='type-id-1031'/>
            <parameter type-id='type-id-282'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;TargetImage&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1178'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1179'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1180'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1181'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;coibuffer*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1182'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1183'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1184'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1185'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10deallocateERS4_PS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10deallocateERS4_PS3_m'>
            <parameter type-id='type-id-1035'/>
            <parameter type-id='type-id-1183'/>
            <parameter type-id='type-id-1185'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;coibuffer*&gt; &gt;, coibuffer*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='type-id-1035'/>
            <parameter type-id='type-id-358'/>
            <parameter type-id='type-id-146'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;coibuffer*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE7destroyIS2_EEvRS4_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE7destroyIS2_EEvRS4_PT_'>
            <parameter type-id='type-id-1035'/>
            <parameter type-id='type-id-358'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1186'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1187'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1188'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1189'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1190'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1191'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1192'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1193'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1103' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1194'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1196' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1195'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1196' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1197'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1196' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1198'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1199'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1201' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1200'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1201' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1202'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1201' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1203'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1205' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1204'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::pair&lt;void const* const, OffloadDescriptor*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1206'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1095'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1207'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1208'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1209'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1101' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1210'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1211'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1212'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1123' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1213'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1103' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1214'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1196' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1215'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1196' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1216'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1196' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1217'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1105' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1218'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1201' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1219'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1201' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1220'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1201' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1221'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1205' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1222'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;AutoData&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-729'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-316'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_Rb_tree_node&lt;AutoData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1223'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-765' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1224'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-765' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1224'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1225'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-223' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1226'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;DynLib&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-732'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-318'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_List_node&lt;DynLib&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1227'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-750' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1228'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-750' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1228'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1229'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-228' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1230'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-227' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1108'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;PersistData&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-735'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-320'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_List_node&lt;PersistData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1231'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-753' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1232'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-753' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1232'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1233'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-276' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1234'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-229' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1117'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-276' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1234'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-229' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1117'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;PtrData*&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-738'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-322'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_List_node&lt;PtrData*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1235'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-756' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1236'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-756' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1236'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1237'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-282' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1238'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-230' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1129'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-282' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1238'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-230' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1129'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;PtrData&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-741'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-324'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_Rb_tree_node&lt;PtrData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1239'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-768' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1240'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-768' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1240'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1241'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-230' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1242'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-230' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1242'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;TargetImage&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-744'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-326'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_List_node&lt;TargetImage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1243'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-759' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1244'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-759' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1244'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1245'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-226' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1246'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-225' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1150'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;coibuffer*&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-747'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-328'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_List_node&lt;coibuffer*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1247'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-762' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1248'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-762' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1248'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1249'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-358' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1250'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-50' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='type-id-1159'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;DynLib&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-750'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-330'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1251'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-897' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1252'/>
        </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeI6DynLibEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1028' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeI6DynLibEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeI6DynLibEEC2Ev'>
            <parameter type-id='type-id-1028' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeI6DynLibEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1028' is-artificial='yes'/>
            <parameter type-id='type-id-146' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeI6DynLibEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeI6DynLibEED2Ev'>
            <parameter type-id='type-id-1028' is-artificial='yes'/>
            <parameter type-id='type-id-146' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;PersistData&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-753'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-332'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1253'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-899' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1254'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;PtrData*&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-756'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-334'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1255'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-901' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1256'/>
        </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP7PtrDataEEC2Ev'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <parameter type-id='type-id-146' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP7PtrDataEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP7PtrDataEED2Ev'>
            <parameter type-id='type-id-1032' is-artificial='yes'/>
            <parameter type-id='type-id-146' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;TargetImage&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-759'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-336'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1257'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-903' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1258'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;std::_List_node&lt;coibuffer*&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-762'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-338'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1259'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-905' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1260'/>
        </member-type>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEEC4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEEC2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP9coibufferEEC2Ev'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEED4Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <parameter type-id='type-id-146' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaISt10_List_nodeIP9coibufferEED2Ev' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSaISt10_List_nodeIP9coibufferEED2Ev'>
            <parameter type-id='type-id-1036' is-artificial='yes'/>
            <parameter type-id='type-id-146' is-artificial='yes'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::_Rb_tree_node&lt;AutoData&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-765'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-340'/>
      </class-decl>
      <class-decl name='allocator&lt;std::_Rb_tree_node&lt;PtrData&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-768'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-342'/>
      </class-decl>
      <class-decl name='allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-771'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-344'/>
      </class-decl>
      <class-decl name='allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;void const* const, OffloadDescriptor*&gt; &gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-774'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-346'/>
      </class-decl>
      <class-decl name='allocator&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-777'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-348'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_Rb_tree_node&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1261'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-771' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1262'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-771' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1262'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1263'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-1059' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1264'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-1059' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1264'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-1059' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1264'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-1059' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1264'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;std::pair&lt;void const* const, OffloadDescriptor*&gt; &gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='type-id-780'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-350'/>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_Rb_tree_node&lt;std::pair&lt;void const* const, OffloadDescriptor*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='type-id-1265'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-774' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1266'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-774' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='type-id-1266'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1086' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='type-id-1267'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-1071' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1268'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-1071' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1268'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-1071' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1268'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='type-id-1071' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='type-id-1268'/>
        </member-type>
      </class-decl>
      <class-decl name='binary_function&lt;AutoData, AutoData, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='118' column='1' id='type-id-1269'/>
      <class-decl name='binary_function&lt;PtrData, PtrData, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='118' column='1' id='type-id-1270'/>
      <class-decl name='binary_function&lt;long unsigned int, long unsigned int, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='118' column='1' id='type-id-1271'/>
      <class-decl name='binary_function&lt;void const*, void const*, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='118' column='1' id='type-id-1272'/>
      <class-decl name='less&lt;AutoData&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='382' column='1' id='type-id-795'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1269'/>
        <member-function access='public' const='yes'>
          <function-decl name='operator()' mangled-name='_ZNKSt4lessI8AutoDataEclERKS0_S3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt4lessI8AutoDataEclERKS0_S3_'>
            <parameter type-id='type-id-798' is-artificial='yes'/>
            <parameter type-id='type-id-224'/>
            <parameter type-id='type-id-224'/>
            <return type-id='type-id-144'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='less&lt;PtrData&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='382' column='1' id='type-id-799'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1270'/>
        <member-function access='public' const='yes'>
          <function-decl name='operator()' mangled-name='_ZNKSt4lessI7PtrDataEclERKS0_S3_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt4lessI7PtrDataEclERKS0_S3_'>
            <parameter type-id='type-id-802' is-artificial='yes'/>
            <parameter type-id='type-id-371'/>
            <parameter type-id='type-id-371'/>
            <return type-id='type-id-144'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='less&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='382' column='1' id='type-id-803'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1271'/>
        <member-function access='public' const='yes'>
          <function-decl name='operator()' mangled-name='_ZNKSt4lessImEclERKmS2_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt4lessImEclERKmS2_'>
            <parameter type-id='type-id-806' is-artificial='yes'/>
            <parameter type-id='type-id-890'/>
            <parameter type-id='type-id-890'/>
            <return type-id='type-id-144'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='less&lt;void const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='382' column='1' id='type-id-807'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1272'/>
        <member-function access='public' const='yes'>
          <function-decl name='operator()' mangled-name='_ZNKSt4lessIPKvEclERKS1_S4_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_function.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt4lessIPKvEclERKS1_S4_'>
            <parameter type-id='type-id-810' is-artificial='yes'/>
            <parameter type-id='type-id-1082'/>
            <parameter type-id='type-id-1082'/>
            <return type-id='type-id-144'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;DynLib&gt;' size-in-bits='320' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-474'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-726'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-288' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeI6DynLibE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeI6DynLibE9_M_valptrEv'>
            <parameter type-id='type-id-897' is-artificial='yes'/>
            <return type-id='type-id-228'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;PersistData&gt;' size-in-bits='448' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-478'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-726'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-290' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeI11PersistDataE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeI11PersistDataE9_M_valptrEv'>
            <parameter type-id='type-id-899' is-artificial='yes'/>
            <return type-id='type-id-276'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;PtrData*&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-482'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-726'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-292' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeIP7PtrDataE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeIP7PtrDataE9_M_valptrEv'>
            <parameter type-id='type-id-901' is-artificial='yes'/>
            <return type-id='type-id-282'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;TargetImage&gt;' size-in-bits='448' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-486'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-726'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-296' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeI11TargetImageE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeI11TargetImageE9_M_valptrEv'>
            <parameter type-id='type-id-903' is-artificial='yes'/>
            <return type-id='type-id-226'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;coibuffer*&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-490'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-726'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-298' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeIP9coibufferE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeIP9coibufferE9_M_valptrEv'>
            <parameter type-id='type-id-905' is-artificial='yes'/>
            <return type-id='type-id-358'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt10_List_nodeIP9coibufferE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt10_List_nodeIP9coibufferE9_M_valptrEv'>
            <parameter type-id='type-id-493' is-artificial='yes'/>
            <return type-id='type-id-356'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_node&lt;long unsigned int&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='109' column='1' id='type-id-494'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-726'/>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_storage' type-id='type-id-300' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='112' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_valptr' mangled-name='_ZNSt10_List_nodeImE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt10_List_nodeImE9_M_valptrEv'>
            <parameter type-id='type-id-906' is-artificial='yes'/>
            <return type-id='type-id-1080'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='_M_valptr' mangled-name='_ZNKSt10_List_nodeImE9_M_valptrEv' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNKSt10_List_nodeImE9_M_valptrEv'>
            <parameter type-id='type-id-496' is-artificial='yes'/>
            <return type-id='type-id-891'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_List_iterator&lt;TargetImage&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='128' column='1' id='type-id-468'>
        <member-type access='public'>
          <typedef-decl name='_Self' type-id='type-id-468' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='130' column='1' id='type-id-471'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-226' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='136' column='1' id='type-id-1273'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-284' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='137' column='1' id='type-id-1274'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-1012' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_list.h' line='198' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='map&lt;long unsigned int, Stream*, std::less&lt;long unsigned int&gt;, std::allocator&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt; &gt;' size-in-bits='384' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='96' column='1' id='type-id-234'>
        <member-type access='private'>
          <typedef-decl name='_Rep_type' type-id='type-id-529' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='135' column='1' id='type-id-1275'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='key_type' type-id='type-id-6' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='99' column='1' id='type-id-817'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='mapped_type' type-id='type-id-237' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='100' column='1' id='type-id-820'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-841' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='101' column='1' id='type-id-823'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='key_compare' type-id='type-id-803' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='102' column='1' id='type-id-1276'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='allocator_type' type-id='type-id-777' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='103' column='1' id='type-id-814'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='value_compare' visibility='default' is-declaration-only='yes' id='type-id-1277'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='type-id-1279' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='149' column='1' id='type-id-1278'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='type-id-1281' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='150' column='1' id='type-id-1280'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1283' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='151' column='1' id='type-id-1282'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1285' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='153' column='1' id='type-id-1284'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1287' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='154' column='1' id='type-id-1286'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='mapped_type' type-id='type-id-237' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='100' column='1' id='type-id-820'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-841' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='101' column='1' id='type-id-823'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-1275' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='138' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='map&lt;void const*, OffloadDescriptor*, std::less&lt;void const*&gt;, std::allocator&lt;std::pair&lt;void const* const, OffloadDescriptor*&gt; &gt; &gt;' size-in-bits='384' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='96' column='1' id='type-id-240'>
        <member-type access='private'>
          <typedef-decl name='_Rep_type' type-id='type-id-545' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='135' column='1' id='type-id-1288'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='key_type' type-id='type-id-150' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='99' column='1' id='type-id-832'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='mapped_type' type-id='type-id-235' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='100' column='1' id='type-id-835'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-860' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='101' column='1' id='type-id-838'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='key_compare' type-id='type-id-807' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='102' column='1' id='type-id-1289'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='allocator_type' type-id='type-id-780' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='103' column='1' id='type-id-829'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='value_compare' visibility='default' is-declaration-only='yes' id='type-id-1290'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='type-id-1292' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='149' column='1' id='type-id-1291'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='type-id-1294' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='150' column='1' id='type-id-1293'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1296' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='151' column='1' id='type-id-1295'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1298' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='153' column='1' id='type-id-1297'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1300' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='154' column='1' id='type-id-1299'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='mapped_type' type-id='type-id-235' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='100' column='1' id='type-id-835'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='type-id-860' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='101' column='1' id='type-id-838'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-1288' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_map.h' line='138' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pair&lt;long unsigned int const, Stream*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='128' column='1' id='type-id-841'>
        <member-type access='public'>
          <typedef-decl name='first_type' type-id='type-id-889' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='130' column='1' id='type-id-1301'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-889' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-237' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='134' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_const_iterator&lt;AutoData&gt;, bool&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='128' column='1' id='type-id-845'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-561' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-144' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='134' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_const_iterator&lt;PtrData&gt;, bool&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='128' column='1' id='type-id-848'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-570' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-144' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='134' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_iterator&lt;AutoData&gt;, std::_Rb_tree_iterator&lt;AutoData&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='128' column='1' id='type-id-851'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-597' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-597' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='134' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_iterator&lt;PtrData&gt;, std::_Rb_tree_iterator&lt;PtrData&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='128' column='1' id='type-id-854'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-603' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-603' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='134' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pair&lt;std::_Rb_tree_node_base*, std::_Rb_tree_node_base*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='128' column='1' id='type-id-857'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-959' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-959' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/stl_pair.h' line='134' column='1'/>
        </data-member>
      </class-decl>
